{"pages":[],"posts":[{"title":"24 Practical Usages of Mysqladmin Commands for Mysql MariaDB","text":"mysqladmin is a client for performing administrative operations. You can use it to check the MySQL/MariaDB configuration and current status, to create and drop databases, and more. You can use mysqladmin to reload/refresh MySQL Privileges, set/change MySQL/MariaDB Root password, check MySQL/MariaDB Server status, show MySQL/MariaDB version, show all MySQL/MariaDB server Variables and Values, check all the running Process of MySQL/MariaDB server, connect remote mysql server, create/drop a Database, reload the grant tables, perform a flush-privileges operation, check mysqladmin options and usage, and shutdown MySQL/MariaDB safely. All this can be done by executing a mysqladmin commands. Invoke mysqladmin like this: 1mysqladmin [options] command [command-arg] [command [command-arg]] ... Show MySQL version The following command shows MySQL version along with the current running status 1mysqladmin -u root -p version Or you can type in MySQL’s root password into the command if you already set it up 1234567891011121314mysqladmin -u root -pPASSWORD versionmysqladmin Ver 8.42 Distrib 5.5.38, for Linux on x86_64Copyright (c) 2000, 2014, Oracle and/or its affiliates. All rights reserved.Oracle is a registered trademark of Oracle Corporation and/or its affiliates. Other names may be trademarks of their respective owners.Server version 5.5.38Protocol version 10Connection Localhost via UNIX socketUNIX socket /var/lib/mysql/mysql.sockUptime: 360 days 15 hours 41 min 13 secThreads: 2 Questions: 82271 Slow queries: 0 Opens: 386 Flush tables: 1 Open tables: 44 Queries per second avg: 0.260 To check MySQL Server is running 123mysqladmin -u root -pPASSWORD pingmysqld is alive To find out current Status of MySQL server This mysqladmin command will shows the status of uptime with running threads and queries. 123mysqladmin -u root -pPASSWORD statusUptime: 616037 Threads: 2 Questions: 82468 Slow queries: 0 Opens: 386 Flush tables: 1 Open tables: 44 Queries per second avg: 0.260 To set MySQL Root password To set MySQL password for root user, use the following command. 1mysqladmin -u root password NEWPASSWORD To change MySQL Root password For example, you want to change your old password 123old to the new password new321. 1mysqladmin -u root -p123old password &apos;new321&apos; To check status of all MySQL Server Variables and values 12345678910111213141516171819mysqladmin -u root -pPASSWORD extended-status+------------------------------------------+-------------+ Variable_name Value +------------------------------------------+-------------+ Aborted_clients 0 Aborted_connects 9 Binlog_cache_disk_use 0 Binlog_cache_use 0 Bytes_received 11126499 Bytes_sent 133222270 Com_admin_commands 2 Com_assign_to_keycache 0 Com_alter_db 0 Threads_created 3114 Threads_running 1 Uptime 316409 Uptime_since_flush_status 316409 +------------------------------------------+-------------+ To check all MySQL server Variables and Values 1mysqladmin -u root -pPASSWORD variables To check all the running Process of MySQL server 1mysqladmin -u root -pPASSWORD processlist To create a Database in MySQL server For example: to create a new database call “wordpress” in MySQL server, use the command as shown below 1mysqladmin -u root -pPASSWORD create wordpress To check if the database is created successfully, use the command as shown below to log in to your MySQL 1234567891011mysql -u root -pPASSWORDWelcome to the MySQL monitor. Commands end with ; or \\g.Your MySQL connection id is 3122Server version: 5.5.38 MySQL Community Server (GPL) by RemiCopyright (c) 2000, 2014, Oracle and/or its affiliates. All rights reserved.Oracle is a registered trademark of Oracle Corporation and/or its affiliates. Other names may be trademarks of their respective owners.Type &apos;help;&apos; or &apos;\\h&apos; for help. Type &apos;\\c&apos; to clear the current input statement. After you logged in to MySQL, use the command as shown below to check all databases 1234567891011show databases;+--------------------+ Database +--------------------+ information_schema wordpress mysql performance_schema +--------------------+4 rows in set (0.00 sec) To drop a Database in MySQL server For example: to drop a Database “wordpress” in MySQL server, use the following command. You will be asked to confirm press ‘y’. 1234567mysqladmin -u root -p drop wordpressDropping the database is potentially a very bad thing to do.Any data stored in the database will be destroyed.Do you really want to drop the &apos;wordpress&apos; database [y/N] yDatabase &quot;wordpress&quot; dropped To reload or refresh MySQL Privileges The reload command tells the server to reload the grant tables. 1mysqladmin -u root -pPASSWORD reload The refresh command flushes all tables and reopens the log files. 1mysqladmin -u root -pPASSWORD refresh To flush hosts Flush all host information from host cache. 1mysqladmin -u root -pPASSWORD flush-hosts To flush tables Flush all tables. 1mysqladmin -u root -pPASSWORD flush-tables To flush threads Flush all threads cache. 1mysqladmin -u root -pPASSWORD flush-threads To flush logs Flush all information logs. 1mysqladmin -u root -pPASSWORD flush-logs To flush privileges Reload the grant tables (same as reload). 1mysqladmin -u root -pPASSWORD flush-privileges To clear status variables 1mysqladmin -u root -pPASSWORD flush-status To shutdown MySQL server Safely 1mysqladmin -u root -pPASSWORD shutdown You can also use the follow command to stop or start the MySQL server To stop 1/etc/init.d/mysqld stop To Start 1/etc/init.d/mysqld start To restart 1/etc/init.d/mysqld restart To kill Sleeping MySQL Client Process Use #8 command to identify sleeping MySQL client process. 12345678mysqladmin -u root -pPASSWORD processlist+----+------+-----------+----+---------+------+-------+------------------+ Id User Host db Command Time State Info +----+------+-----------+----+---------+------+-------+------------------+ 2 root localhost Sleep 11 9 root localhost Query 0 show processlist +----+------+-----------+----+---------+------+-------+------------------+ ID 2 is identified as sleeping process. run the following command with kill and process ID as shown below. 1234567mysqladmin -u root -pPASSWORD kill 2+----+------+-----------+----+---------+------+-------+------------------+ Id User Host db Command Time State Info +----+------+-----------+----+---------+------+-------+------------------+ 9 root localhost Query 0 show processlist +----+------+-----------+----+---------+------+-------+------------------+ To kill multiple IDs, pass the process ID’s with comma separated as shown below. 1mysqladmin -u root -pPASSWORD kill 2,3,4,5,6 To run multiple mysqladmin commands together 1mysqladmin -u root -pPASSWORD flush-hosts flush-tables flush-threads flush-logs flush-privileges flush-status To connect remote mysql server To connect remote MySQL server, use the -h (host) with IP Address of remote machine. 1mysqladmin -h 192.168.11.1 -u root -pPASSWORD To execute command on remote MySQL server For example, check if remote MySQL Server is running 1mysqladmin -h 192.168.11.1 -u root -pPASSWORD ping To start/stop MySQL replication on a slave server To start 1mysqladmin -u root -pPASSWORD start-slave To stop 1mysqladmin -u root -pPASSWORD stop-slave To store MySQL server Debug Information to logs 1mysqladmin -u root -pPASSWORD debug To find out more options and usage of myslqadmin command 1mysqladmin --help","link":"/tech/24-practical-usages-of-mysqladmin-commands-for-mysql-mariadb/"},{"title":"4 Must-Have iPhone apps for college students","text":"When you correcting all your Back to School needs, don’t forget your iPhone needs to be prepared to help set you up for a success and be more productive than ever. Here are some apps which make for a great companion for studying. Your Personal Scheduling Assistant: iStudiez iStudiez is on the list of: 2011 Best College Student App 2010 Best Young Adults App for iPad! 2010 Best Parenting App for iPad! 2009 Best App Ever Award Winner in Education category! iStudiez can help you: organize your schedule; follow up with your homework; summarize it up for you; track your grade or GPA; keep you alert; guard your data. You can add your schedule to make sure you never miss a class or recitation with many support modes for semesters, trimesters, and more. You can track your assignments in only a few taps and set up notifications for study time or due dates so you make sure everything is ready for when you get to class. Are you a student surviving high school, college or university epoch? If you have a heavy course load or typically have trouble delegating time to different assignments, get iStudiez Pro. Download iStudiez Lite from Apple App Store Download iStudiez Pro from Apple App Store ($2.99) Your portable scanner: Camscanner Quickly scan documents of all kinds and auto-optimize the scans quality using its unique technology. With Camscanner, you can easily send document scans to colleagues via email or the cloud and say goodbye to running between your desk and the printer. The most cool thing about Camscanner is you can use your iPhone scan multiple pages at once. All pages will be processed with amazing result. You can even reedit the scanned pages if you don’t satisfy with the result. There are a lot of apps can do similar process like camscanner, but camscanner is the only app (so far) allow user to re-edit the image after the image saved. Enable your apps to digitalize paper documents with cutting-edge image processing technologies. Download CamScanner Free from Apple App Store Download CamScanner + PDF Document Scanner and OCR from Apple App Store ($1.99) Download CamScanner Pro from Apple App Store ($4.99) Your cloud notebook: Evernote Evernote can help you: Organize your daily projects Keep everything together Sync across all devices Clip web articles, capture handwritten notes, and snap photos to keep the physical and digital details of your projects with you at all times. Download Evernote Free from Apple App Store Bring Word, Excel and PowerPoint to anywhere: Microsoft Office Mobile Microsoft Office Mobile is the official Office companion optimized for iPhone. You can access, view and edit your Microsoft Word, Microsoft Excel and Microsoft PowerPoint documents from virtually anywhere. With Microsoft Office Mobile you can: Access documents from virtually anywhere Make quick edits and share without messing the formatting and content Download Microsoft Office Mobile Free from Apple App Store","link":"/tech/4-must-have-iphone-apps-for-college-students/"},{"title":"Add 802.11-n support to BCM47xx and BCM53xx OpenWrt","text":"OpenWrt in default uses the reverse engineered b43 driver for BCM47xx and BCM53xx devices. With this driver only 802.11g is supported, but you can easily get wireless 802.11n working by installing the Broadcom open source brcmsmac driver. You can easily do make wireless N working by following below steps. telnet or SSH to the router.** execute the following commands through SSH or telnet.** By running the following commands you will remove kmod-b43 and other unnecessary drivers, install kmod-brcmsmac and kmod-brcmutil package. 123456789opkg updateopkg install kmod-brcmsmacopkg install kmod-brcmutilrmmod b43rmmod b43legacyrmmod wlrmmod brcmsmacrmmod brcmutilmodprobe brcmsmac delete the old config files and get the initial configuration file.** 12rm -f /etc/config/wirelesswifi detect &gt; /etc/config/wireless enable the WiFi.** 1vi /etc/config/wireless Comment out “option disabled 1” by adding “#” in front of it or delete it “option disabled 1” completely. After that, run the following command and you will see SSID named OpenWrt on your other devices. 1wifi *Note: brcmsmac does not support 40mhz (yet).","link":"/tech/add-802-11-n-support-to-bcm47xx-and-bcm53xx-openwrt/"},{"title":"Add Google AdSense Ads Code to WordPress Post After n Characters","text":"Are you making money with Google Ads as what you expected? Adding Ads at the beginning or at the end of the post will not gives give you improvement on the clicking numbers. However, inject Ads into the post contents after words can boost your CTR rate significantly. Add the code below to your WordPress theme’s functions.php is all you have to do (NO PLUGINS NEEDED!). You will need to replace the Ads code to your own Google Adsense Ads code. You may tweak the number to adjust where you want the Ads appear (after how many characters). The example below will inject the Ads to all posts with at least 600 characters. The Ads will be add after the 590th character. 1234567891011121314151617181920212223242526272829303132# Add Google ads after n charactersfunction inject_ad_text_after_n_chars($content) {// only inject google ads if post is longer than 600 characters$enable_length = 600;// insert after the 590th character$after_character = 590;if (is_single() &amp;&amp; strlen($content) &gt; $enable_length) {$before_content = substr($content, 0, $after_character);$after_content = substr($content, $after_character);$after_content = explode(&apos;&lt;/p&gt;&apos;, $after_content);$text = &apos;&lt;p&gt;&lt;!-- Google Ads Code --&gt;&lt;ins class=&quot;adsbygoogle&quot;style=&quot;display:inline-block;width:234px;height:60px&quot;data-ad-client=&quot;ca-pub-6914615778368190&quot;data-ad-slot=&quot;6282177961&quot;&gt;&lt;/ins&gt;&lt;script&gt;(adsbygoogle = window.adsbygoogle []).push({});&lt;/script&gt;&lt;/p&gt;&apos;;array_splice($after_content, 1, 0, $text);$after_content = implode(&apos;&apos;, $after_content);return $before_content . $after_content;}else {return $content;}}//add filter to WordPress with priority 13add_filter(&apos;the_content&apos;, &apos;inject_ad_text_after_n_chars&apos;,13); You should test and adjust enable_length and after_character for best performance.","link":"/tech/add-google-adsense-ads-code-to-wordpress-post-after-n-words/"},{"title":"Add multiple usb printers to OpenWrt firmware router via p910nd using Hotplug","text":"p910nd allow multiple printers through a socket connection to port 910n (where n=1, 2, 3 …). So, we can share more than one printer to OpenWrt. In default, port number when you unplug and plug in different printers. The following configuration uses the Hotplug script to pair printers to designed ports. This allows multiple printers to be recognized, assigned ports based on the product ID, same ports assigned will resume when printers are connected/turned on. Works on both usb printer and parallel printer using serial to USB adapter. Make sure the printer has usb essentials or support for the parallel port Install support for printers. 12opkg updateopkg install kmod-usb-printer kmod-lp luci-app-p910nd Plug in the printer, record VID and PID. SSH to the printer and run: 1lsusb -v or 1dmesg grep printer Mark down the vid and pid for the printer. Repeat this process for all printers. Add this to /etc/hotplug.d/usb/11-multi-printers The following code is a demo configuration for a Brother HL2140 on port 9100, a Zebra Eltron LP 2442 Label Thermal Printer on port 9101, and a Brother QL570 on port 9102. Note: $PRODUCT” = “4f9/27/100” represents your printer’s VendorId/ProductId/BcdVersion(1.00 = 100). VID=04f9, PID=0027 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162#!/bin/sh# process USB and parallel printers onlyif [ &quot;$INTERFACE&quot; = &quot;7/1/1&quot; ] [ &quot;$INTERFACE&quot; = &quot;7/1/2&quot; ]then# set -xDEV=&quot;none&quot;# Brother HL2140if [ &quot;$PRODUCT&quot; = &quot;4f9/33/100&quot; ]thenVID=&quot;04f9&quot;PID=&quot;0033&quot;DEV=&quot;hl2140&quot;fi# Zebra LP2442if [ &quot;$PRODUCT&quot; = &quot;1645/6/100&quot; ]thenVID=&quot;1645&quot;PID=&quot;0006&quot;DEV=&quot;lp2442&quot;fi# Brother QL570if [ &quot;$PRODUCT&quot; = &quot;4f9/2028/100&quot; ]thenVID=&quot;04f9&quot;PID=&quot;2028&quot;DEV=&quot;ql570&quot;fiif [ &quot;$DEV&quot; != &quot;none&quot; ]thenif [ &quot;$ACTION&quot; = &quot;add&quot; ]then# search for last printer assignment using dmesgLP=`dmesg grep -i &quot;usblp.: USB Bidirectional printer dev .* if .* alt .* proto .* vid 0x$VID pid 0x$PID&quot; grep -io &quot;lp[0-9]&quot; tail -n 1`if [ &quot;$LP&quot; != &quot;&quot; ]thenecho $LP &gt;/var/run/$DEV.lpln -s /dev/usb/$LP /dev/$DEVfifiif [ &quot;$ACTION&quot; = &quot;remove&quot; ]then# LP = `cat /var/run/$DEV.lp`rm /var/run/$DEV.lprm /dev/$DEVfififi Log in to OpenWrt -&gt; service -&gt; p910nd -&gt; Printer server. Finish the configuration Device = “/dev/Device name from the code above” Port = Assigned port from the code above Reboot the router and test.","link":"/tech/add-multiple-usb-printers-to-openwrt-firmware-router-via-p910nd-using-hotplug/"},{"title":"Add multiple printers on Tomato firmware router with hotplug","text":"Tomato firmware in default only recognize one printer. If more printers are detected, it assign the first detected printer to lp0. When a printer is plugged into the Tomato router and turned on, the printer port is assigned. To add a second p910nd instance, you need to manually run it with p910nd -f /dev/usb/lp1 1, and add -b for bidirectional if needed. When sharing one printer using p910nd in Tomato firmware, the first printer will be assigned to default port 9100. If you plug in more than one printers, the usb printer kernel module assigns /dev/usb/lp devices in the order printers are turned on/off. When a printer is turned on and recognized on the usb bus, it receives the first free device name in /dev/usb/lp. If you are using more than one printers and turn them on and off all the time, you have to change device assignments for p910nd dynamically. The following configuration uses the Hotplug script to pair printers to designed ports. This allows multiple printers to be recognized, assigned ports based on the product ID, same ports assigned will resume when printers are connected/turned on. Works on both usb printer and parallel printer using serial to USB adapter. Turn on “Core USB Support”, “USB 2.0 Support”, “USB 1.1 Support (Optional)”, “USB Printer Support”, and “USB Storage Support” under “USB Support”. Unplug all printers. Copy and paste the following code into the “Hotplug script” box. The following code is a demo of sharing three printers. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475#!/bin/sh# log printers Interface, VID, and PID informationecho Product:${PRODUCT} Interface: ${INTERFACE}&gt;&gt; /var/log/hotplug# process printers only# usb port# parallel to usb portif [ &quot;$INTERFACE&quot; = &quot;7/1/1&quot; ] [ &quot;$INTERFACE&quot; = &quot;7/1/2&quot; ]then# set -xDEV=&quot;none&quot;# Printer_1if [ &quot;$PRODUCT&quot; = &quot;4f9/33/100&quot; ] then VID=&quot;04f9&quot; PID=&quot;0033&quot; DEV=&quot;Printer_1&quot; port=&quot;0&quot; fi# Printer_2if [ &quot;$PRODUCT&quot; = &quot;1645/6/100&quot; ] then VID=&quot;1645&quot; PID=&quot;0006&quot; DEV=&quot;Printer_2&quot; port=&quot;1&quot; fi# Printer_3if [ &quot;$PRODUCT&quot; = &quot;4f9/2028/100&quot; ] then VID=&quot;04f9&quot; PID=&quot;2028&quot; DEV=&quot;Printer_3&quot; port=&quot;2&quot; fiif [ &quot;$DEV&quot; != &quot;none&quot; ]thenif [ -n &quot;$port&quot; ]; thenfor pid in `ps grep -i p910${port}d grep -v grep cut -c1-5` ; dokill -9 $piddoneif [ &quot;$ACTION&quot; = &quot;add&quot; ]then# search for last printer assignment in syslog (/var/log/syslog.log or logread)LP=`dmesg grep -i &quot;usblp.: USB Bidirectional printer dev .* if .* alt .* proto .* vid 0x$VID pid 0x$PID&quot; grep -io &quot;lp[0-9]&quot; tail -n 1`if [ &quot;$LP&quot; != &quot;&quot; ]thenecho $LP &gt;/var/run/$DEV.lpln -s /dev/usb/$LP /dev/$DEVp910nd -b -f /dev/$DEV $portfifiif [ &quot;$ACTION&quot; = &quot;remove&quot; ]then# LP = `cat /var/run/$DEV.lp`rm /var/run/$DEV.lprm /dev/$DEVfifififi Tomato Printers plug each printer one by one into the router, check “/var/log/hotplug”, copy and paste printers’ PRODUCT, VID, and PID information into the hotplug code above. Turn off “USB Printer Support”, this will disable the default printer support and port assignation. Copy and paste the following code into “init” under “Administration” “Scripts” This will load the printer support when the router start. 1modprobe usblp This is it. Reboot and test Note: Hotplug script box needs “USB Storage Support” be turned on at least. If you don’t want USB Storage Support, you can turn it off by using the code into “init” under “Administration” “Scripts”. 1modprobe -r usb_storage","link":"/tech/add-multiple-printers-on-tomato-firmware-router-with-hotplug/"},{"title":"Apache: Blocking bad bots attacks from ZmEu","text":"Take a quick look at Apache’s access.log, there are always all sorts of unknown IPs are connecting, mostly with a status code 403, 404. For example, Some bots like ZmEu are trying to find phpmyadmin or other unprotect web server. ZmEu is a script built by a group of Romanian Hackers. This script essentially looks for a set of scripts and directories of common interest, like for example /phpMyAdmin/*, /pma/* what it is actually looking for is unprotect scripts and other things that might allow the foreign host access into something valuable. such as such as your MySQL databases! An example of ZmEu scan logs. If you see the status code is 403 or 404, your are mostly OK. If the status code is 200, you might need to find out what ZmEu already found out. It’s only dangerous if you have unpatched or unprotected versions of software on the host that may be vulnerable. 12345186.42.181.66 - - [17/Jul/2014:08:29:35 -0700] &quot;GET /phpMyAdmin/scripts/setup.php HTTP/1.1&quot; 403 230 &quot;-&quot; &quot;ZmEu&quot;186.42.181.66 - - [17/Jul/2014:08:29:36 -0700] &quot;GET /phpmyadmin/scripts/setup.php HTTP/1.1&quot; 403 230 &quot;-&quot; &quot;ZmEu&quot;186.42.181.66 - - [17/Jul/2014:08:29:36 -0700] &quot;GET /pma/scripts/setup.php HTTP/1.1&quot; 404 2946 &quot;-&quot; &quot;ZmEu&quot;190.95.232.234 - - [17/Jul/2014:08:29:36 -0700] &quot;GET /myadmin/scripts/setup.php HTTP/1.1&quot; 404 2948 &quot;-&quot; &quot;ZmEu&quot;190.95.232.234 - - [17/Jul/2014:08:29:37 -0700] &quot;GET /MyAdmin/scripts/setup.php HTTP/1.1&quot; 404 2949 &quot;-&quot; &quot;ZmEu&quot; How to stop ZmEu? IP blocking is not a essential way to fix this problem because ZmEu scan can be executed from any IP address. An easy quick fix to rid of almost all ZmEu attacks is block all http-agent contains “ZmEu” because the http-agent that ZmEu uses is “ZmEu”. Lets block it on an Apache global level, add this to any of your virtual host or host directives (httpd.conf or *.conf or .htaccess): 12345order allow,deny # deny based on User-AgentSetEnvIfNoCase User-Agent &quot;^ZmEu&quot; bad_botdeny from env=bad_botallow from all Then restart your Apache and enjoy.","link":"/tech/apache-blocking-bad-bots-attacks-zmeu/"},{"title":"Asus Z87-A MacOS high sierra upgrade prepare with clover","text":"This guide is for upgrading your system from previous version to high sierra 10.13.x. For how to prepare USB installation kit, check here: Install Mac OS X with clover EFI bootloader on ASUS Z87a First, add driver support to APFS.Upgrading to high sierra will automatically cover HFS+ file system to APFS. Without the driver, clover will not able to boot to high sierra. What is APFS? APFS is the Apple File System. It was introduced at WWDC 2016 and, starting this year, it will replace the existing HFS+ file system on Apple Watch, Apple TV, iPhone, iPad, MacBook, iMac, and Mac Pro. apfs.efi for 10.13.2 If you already have apfs.edi in your clover driver folder and want to upgrade it to the version that match your system. You can follow below step. 1. Boot into macOS High Sierra 2. open terminal 3. type 1open /usr/standalone/i386/ 4. Copy apfs.efi to /Volumes/EFI/EFI/CLOVER/drivers64UEFI/ Second, upgrade your kextsMake sure you have updated version of kext for the new system. AppleALC.kext - enabling native macOS HD audio. FakeSMC.kext - an open source SMC device driver/emulator. Lilu.kext - open source kernel extension bringing a platform for arbitrary kext, library, and program patching throughout the system for macOS. IntelGraphicsFixup.kext - kernel extension for Lilu Fixes PAVP freezes on Intel video (HD 4000/4400/4600), Sky Lake and Kaby Lake Graphics Fixes boot logo on all known Intel Graphics starting with HD4000, (via frame buffer reset or via restoring video memory content) Fixes display initialization issues for Sky Lake &amp; Kaby Lake RealtekRTL8111.kext - Realtek RTL8111 Network Driver. USB_Series8_Injector.kext - inject USB ports Asus Z87-A motherboard (Specifically modified for Z87-A with iMac14,2 SMBIOS, will not work with other SMBIOS without changing code. Not tested with other board) - no update needed for future update unless Apple make significant change to their code for USB port. Third, raise USB Port limit12345Comment: Change 15 port limit to 24 in XHCI kext 10.13Find: 837D8C10Name: AppleUSBXHCIPCIReplace: 837D8C1B Now you are good to go with the upgrade just like upgrading a real Mac.","link":"/tech/asus-z87-macos-high-sierra-upgrade-guide-clover/"},{"title":"AWS Lightsail Wireguard Unable to access interface: Protocol not supported easy fix","text":"AWS Lightsail is a perfect Wireguard server VPS. If you install Wireguard in AWS Lightsail instance, you will most likely get an error Cannot find device &quot;wg0&quot; or Unable to access interface: Protocol not supported. This is a common issue when wireguard-dkms module didn’t match the kernel headers version and it can happen in other VPS also. To make Wireguard work correctly you will need to re-install linux-headers-*** and wireguard-dkms. Most of time once you re-installed kernel headers, you don’t have to reinstall wireguard-dkms. 1sudo apt install linux-headers-$(uname -r) After that you can try bring up the wg0 interface. If you are using pivpn, the debug command pivpn -d have the options to re-enable Wireguard. If issue still exist, you can reinstall wireguard-dkms 1sudo apt install --reinstall wireguard-dkms","link":"/tech/aws-lightsail-wireguard-unable-to-access-interface-protocol-not-supported-easy-fix/"},{"title":"Best and easiest way to sterilize baby bottles - UV sterilization","text":"Baby is vulnerable to diseases and illnesses, so you will want to ensure their bottles are clean and germ free until baby’s immune system developed providing a much higher tolerance to bacterias and germs. Sterilizing bottles can have different ways. Some require more efforts and times and some need more cautions. There are many ways to sterilize baby bottles. Use electric steamers Use Microwave Use boiling water Use UV sterilizer Sterilizing Tablets Many other ways. The best and easiest way to sterilize baby bottles at home is use UV sterilizer if you can get one. Why use UV sterilizer? It does not use water, so no worry about germ from steamers water. No need to boil. Plastic bottle safe. UV can kill viruses, germs and bacteria (99.9% rate). Some sterilizer offer dryer function, save your time for sleep! The only con of this method is usually UV sterilizer is a bit expensive compare to other methods. There are not a lot of options of UV sterilizer in the market. You don’t want a products that can only sterilize one bottle or one nipple at a time because you will have more than one bottle need to be sterilized. If you don’t know which one to get, you can consider the Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer. It is available at Amazon and Wabi’s website. Get one from Amazon: Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; DryerWabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer have sterilizer and dryer function so all you need to do is wash the bottles and put them into Wabi UV sterilizer &amp; dryer. We tested one Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer and found it is a nice product for family with new baby. Wabi UV sterilizer &amp; dryer is not the small one you usually see in the market. The box width is about the mid size computer case. But it is lighter than it looks like. You will find this UV sterilizer looks very well made and nice. It has touch panel for function control. Very simple and easy to use. Not too small, but not too big. We use 8oz bottle in our test. Looks very cool also when it is on. We tested the UV and dryer function for a set of bottles. After the full cycle complete, all bottles were dry and feels clean. It does left some warm feeling when finish, but that is totally normal.","link":"/lifestyle/best-easiest-way-sterilize-baby-bottles-uv-sterilization/"},{"title":"Bridge Multiple LAN ports/NICs in pfSense 2.1","text":"Nowadays is easy to find a board with more than two ports. For a box with 4 gigabit ports, one used as WAN, others act as as LAN as if they are all part of a switch. Bridging is a good way to go. A bridged interface is one that can filter traffic without pfSense being involved in the IP layer of the connection. This is commonly referred to as a “transparent firewall”. Requirements: pfSense box with multiple NICS; 1 for Wan, others for Lans (two or more). What we will get: i port as 1 WAN, Others as LAN. Assign an individual IP for all NICs by going to ‘Interfaces → Assign’. Important! Note: Only set up a IPv4 address for each NIC. Set up DHCP on NIC1 by going ‘Services → DHCP server’ Bridge other NICs by going to ‘Interfaces → Assign → Bridges’ and set up an IP for the interface. Note: Do not include WAN and NIC1. Create a interface groups by going to ‘Interfaces → Assign → Interface Groups’. Note: Include all NICs and Bridge interface in “Member (s)”, do not include WAN. Change the default firewall rule under NIC1 to all NICs interfaces to avoid being locked out by going to ‘Firewall → Rules’Note: Change the Interface from NIC1 to the Interface groups which is created in Step 4. Enable DHCP on the bridge interface by going to ‘Services → DHCP server’. Disable DHCP on NIC1 by going to ‘Services → DHCP server’ and include NIC1 into the bridge which is set up in Step 3 by going to ‘Interfaces → Assign → Bridges’. reboot and test.","link":"/tech/bridge-multiple-lan-ports-in-pfsense-2-1/"},{"title":"Build an extremely fast WordPress with GCP Part 1: server","text":"Can you get a super fast server free from Google? Yes, you can. Google Cloud Platform has free tier for US region server. If you are building a small WordPress website using light bandwidth, the free tier is more than sufficient. Free tier provide 720 hours of instance usage which will cover whole month of usage. The only downside is if your site use a lot of bandwidth you will be billed after 1GB of free egress bandwidth, but still cheap because 1 GB cost only $0.01 for US and 1 TB $0.12 - $0.23 depends on the regions. Most new sites use only small amount of bandwidth. Ingress is free if you wonder. As of today, the free tier offer: 1 f1-micro instance per month (US regions only - Excluding Northern Virginia) 30 GB-months HDD, 5 GB-months snapshot 1 GB network egress from North America to all region destinations per month (excluding China and Australia) update your billing info. Open https://console.cloud.google.com/billing, update your billing info. You may be requested to create a project name. create your virtual server (instance) Open https://console.cloud.google.com/compute and click CREATE INSTANCE. configure your server. Match the free tier configuration, do not click create yet after this step. Zone: pick a US region. eg: us-west1-a Machine type: micro (1 shared vCPU, 0.6 GB memory, f1-micro) Boot disk: 30 GB standard persistent disk. SSD is not free! OS images: pick one of your favor, or use Debian GNU/Linux 9 (stretch) as what we picked. Firewall: check Allow HTTP traffic and Allow HTTPS traffic get an static IP for your instance. Expand Management, disks, networking, SSH keys under Networking &gt;&gt; Network interfaces &gt;&gt; External IP, select Create IP address After you reserve an static external IP address, you can click Create to finish the instance setup. You have complete the step 1 and you have your free server from GCP, continue to part 2 when you ready.","link":"/tech/build-an-extremely-fast-wordpress-gcp-part1-server/"},{"title":"Build an extremely fast WordPress with GCP Part 2: Nginx","text":"Apache or Nginx, what softwares should be used to for your server to achieve the maximum performance? If you have a small free server from GCP from part 1, and you want it to be able to handle average 1000 clients per second, Nginx is the best option. Apache use more server resources and must be configured properly to get the best performance. Nginx can handle very large amount of traffic even in a limited environment. We have done the loading test with the server from Google Cloud Platform from part 1 and the result was great without deep optimization. 1000 client/sec is not the maximum that this setup can get, it is the limit of the free test we could get. When we tried the same test using Apache, the test was aborted at the beginning because server crashed. That is why we will use Nginx. We are not the server expert, so we will not discuss how to optimize Apache to pass the same test. What we will need is NGINX + MySQL + PHP-FPM + Microcaching + WordPress. install Nginx. 123sudo apt-get update -ysudo apt-get install nginx -ysudo service nginx start install Mysql (or MariaDB). 12345sudo apt-get install mysql-server -ysudo service mysql stopsudo mysql_install_db # follow instructionssudo service mysql startsudo mysql_secure_installation # follow instructions install Install PHP-FPM 1sudo apt-get install php-fpm php-mysql php-gd php-cli php-xml php-mbstring Add cgi.fix_pathinfo=0 to php.ini, if you know how to add, jump to step 4, otherwise, continue below. 12345# if you use different version of PHP, change 7.0 to your version e.g. 8.0sudo nano /etc/php/7.0/fpm/php.ini# paste cgi.fix_pathinfo=0# press ctrl + X key, and type Y to save the file. 123# restart PHP-FPM service# if you use different version of PHP, change the 7.0 accordinglysudo service php7.0-fpm restart configure Nginx to use PHP-FPM to process php files 123456789101112sudo nano /etc/nginx/sites-available/default# add the following to the server { } block location ~ \\.php$ { try_files $uri =404; fastcgi_split_path_info ^(.+\\.php)(/.+)$; fastcgi_pass unix:/var/run/php/php7.0-fpm.sock; fastcgi_index index.php; fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name; include fastcgi_params; } Restart Nginx 1sudo service nginx restart add Microcaching to Nginx With Microcaching, Nginx can handle large amount of traffic because dynamic inquiries/files are cached to prevent overloading your database. For example if each client to your website generate 2 database inquiry, 1000 client will have 2000 inquires. If you set up cache for 5 seconds, 1000 clients within 5 seconds will only hit your database 2 times if both inquires are cached. That is the magic of this setup. 123# always backup the file you want to changesudo cp /etc/nginx/sites-available/default /etc/nginx/sites-available/default.baksudo nano /etc/nginx/sites-available/default Add the following to the file. You can add this before the server {} block 123# Microcachingfastcgi_cache_path /var/run/nginx-cache levels=1:2 keys_zone=qualityology-com:100m inactive=60m;fastcgi_cache_key &quot;$scheme$request_method$host$request_uri&quot;; Add the following to location ~ \\.php$ {} block. Below configuration will set the cache to expire after 10 seconds, and no cache for logged in users and commenters. You can change the 10s to longer time, but 10s is long enough for your need. 123456789101112131415161718192021222324252627282930313233#Cache everything by defaultset $no_cache 0;#Don&apos;t cache logged in users or commentersif ( $http_cookie ~* &quot;comment_author_wordpress_(?!test_cookie)wp-postpass_&quot; ) { set $no_cache 1;}#Don&apos;t cache the following URLsif ($request_uri ~* &quot;/(wp-admin/wp-login.php)&quot;){ set $no_cache 1;}#matches keys_zone in fastcgi_cache_pathfastcgi_cache qualityology-com;#don&apos;t serve pages defined earlierfastcgi_cache_bypass $no_cache;#don&apos;t cache pages defined earlierfastcgi_no_cache $no_cache;#defines the default cache timefastcgi_cache_valid any 10s;#unsure what the impacts of this variable isfastcgi_max_temp_file_size 2M;#Use stale cache items while updating in the backgroundfastcgi_cache_use_stale updating error timeout invalid_header http_500;fastcgi_cache_lock on;fastcgi_cache_lock_timeout 10s; Test if your configuration 1sudo nginx -t If no error, reload your Nginx or restart it 1sudo service nginx start install WordPress 123456cd /var/www/html/sudo wget http://wordpress.org/latest.tar.gzsudo tar xzvf latest.tar.gzsudo rm latest.tar.gzsudo mv wordpress/* ./sudo chown -R www-data:www-data /var/www/html/* You are all set. Now, open your domain or IP to setup WordPress","link":"/tech/build-extremely-fast-wordpress-gcp-part-2-nginx/"},{"title":"Changing default date and timezones on a Linux server","text":"Assume that your current timezone is UTC. You would like to change your server’s timezone to Pacific Time. How do I change the timezone on my Linux distribution? On some distributions (for example, CentOS), the timezone is controlled by /etc/localtime file. The /etc/localtime file is a link to or copy of a file containing information about your time zone. How to get the current date and time in the terminal?You need to use the following syntax to print current date and time on screen: 1date The date syntax has many options; you can use formatting options with spaces and commas to make the date look nice like “Friday, February 14, 2014, 00:00:00 AM” get by using the date command: 1date +&quot;%A, %B %d, %Y, %T %p&quot; If the syntax above shows the wrong time or date, normally is because the system is set to the wrong timezone. Changing the timezone, date, and timeTimeZone information files are usually in /usr/share/zoneinfo but this depends on your distribution. there are now about a dozen distributions out there (Debian, Dedora, Ubuntu, Mageia, Min Linux, Fuduntu, Red Har, Backtrack, Arch). So if your localtime file points to a zone info file that is not your time zone you can change it by browsing the directories in /usr/share/zoneinfo to find your country, then find your city or a city in the same time zone and link localtime to it. For example, all US timezones are located under under the /usr/share/zoneinfo/US directory as shown below. 12ls /usr/share/zoneinfo/America/Adak Coral_Harbour Hermosillo Moncton SantaremAnchorage Cordoba Indiana Monterrey SantiagoAnguilla Costa_Rica Indianapolis Montevideo Santo_DomingoAntigua Creston Inuvik Montreal Sao_PauloAraguaina Cuiaba Iqaluit Montserrat ScoresbysundArgentina Curacao Jamaica Nassau ShiprockAruba Danmarkshavn Jujuy New_York SitkaAsuncion Dawson Juneau Nipigon St_BarthelemyAtikokan Dawson_Creek Kentucky Nome St_JohnsAtka Denver Knox_IN Noronha St_KittsBahia Detroit Kralendijk North_Dakota St_LuciaBahia_Banderas Dominica La_Paz Ojinaga St_ThomasBarbados Edmonton Lima Panama St_VincentBelem Eirunepe Los_Angeles Pangnirtung Swift_CurrentBelize El_Salvador Louisville Paramaribo TegucigalpaBlanc-Sablon Ensenada Lower_Princes Phoenix ThuleBoa_Vista Fortaleza Maceio Port-au-Prince Thunder_BayBogota Fort_Wayne Managua Porto_Acre TijuanaBoise Glace_Bay Manaus Port_of_Spain TorontoBuenos_Aires Godthab Marigot Porto_Velho TortolaCambridge_Bay Goose_Bay Martinique Puerto_Rico VancouverCampo_Grande Grand_Turk Matamoros Rainy_River VirginCancun Grenada Mazatlan Rankin_Inlet WhitehorseCaracas Guadeloupe Mendoza Recife WinnipegCatamarca Guatemala Menominee Regina YakutatCayenne Guayaquil Merida Resolute YellowknifeCayman Guyana Metlakatla Rio_BrancoChicago Halifax Mexico_City RosarioChihuahua Havana Miquelon Santa_Isabel For other country timezones, browse the /usr/share/zoneinfo directory. Change TimeZone Using /etc/localtime FileFirst step: delete the current localtime file /etc/localtime. 1rm /etc/localtime Link the Los_Angeles file from the above the U.S. directory to the /etc/localtime directory as shown below. 1ln -sf /usr/share/zoneinfo/America/Los_Angeles /etc/localtime Now the timezone on your Linux system is changed to the U.S. Los Angeles time. You can use the “date” command to verify. Change TimeZone Using /etc/timezone File for some distribution like UbuntuTo show the current timezone in the file /etc/timezone, use the command: 1cat /etc/timezone To change this to the U.S. Los Angeles time, we need to modify the /etc/timezone file. First step: edit the /etc/timezone file via vim or nano. Vi editor: 1vi /etc/timezone Nano editor: 1nano /etc/timezone Second step: modify the file as shown below: 1America/Los_Angeles set the timezone from the terminal using the TZ variable. 1export TZ=America/Los_Angeles","link":"/tech/changing-default-date-and-timezones-on-a-linux-server/"},{"title":"Common Windows boot/startup problems fix","text":"Having boot problems on your Windows PC? Everything was fine but the computer just didn’t want to boot; Windows Update stuck loop; boot to a black screen; received errors like: Windows wouldn’t recognize disk one day; got error messages: Invalid Boot.ini, Windows could not start, Windows could not start because the following file is missing or corrupt: \\WINDOWS\\SYSTEM32\\CONFIG\\SYSTEM. Most of the common Windows boot or star up problems appears because of a corruption in the Windows registry. You can fix most problems by doing the following procedures. Using Last Known Good Configuration This method will replace the corrupt Windows configuration and restore the “Last Known Good Configuration”. Restart your Windows Press and hold the F8 key as your computer restarts. You need to press F8 before the Windows logo appears. If the Windows logo appears, you’ll need to try again by shutting down and restarting your computer. On the Advanced Boot Options screen, use the arrow keys to highlight Last Known Good Configuration (advanced), and then press Enter. Windows will then resume starting normally. Using System Restore Restart your Windows Press and hold the F8 key as your computer restarts. You need to press F8 before the Windows logo appears. If the Windows logo appears, you’ll need to try again by shutting down and restarting your computer. Use the arrow keys to select the Safe mode with a Command prompt option. Log on as an administrator or with an account that has administrator credentials. At the command prompt, type %systemroot%\\system32\\restore\\rstrui.exe, and then press ENTER. Follow the instructions that appear on the screen to restore your computer to a functional state. To open the System Recovery Options menu using the Windows installation disc or a USB flash drive, or a system repair disc To use this method, you need to restart (boot) your computer using the disc or USB flash drive. Insert the Windows installation disc or USB flash drive, or a system repair disc, and then shut down your computer. Restart your computer using the computer’s power button. When prompted, press any key, and then follow the instructions that appear. On the Install Windows page, or on the System Recovery Options page, choose your language and other preferences, and then click Next. If you are using the Windows installation disc or USB flash drive, click Repair your computer. Select the Windows installation you want to repair, and then click Next. On the System Recovery Options menu, click a tool to open it. Restoring Windows Boot Loader Boot from Windows installation disc or USB Choose to Repair your computer. In the System Recovery Options dialog box click Command Prompt and type the following: 12Bootrec.exe /FixMbrBootrec.exe /FixBoot *If you want to completely rebuild Windows Boot Configuration Data, then you should issue the following command: 1Bootrec.exe /RebuildBcd Perform an in-place upgrade installation You can perform an in-place upgrade installation to repair a flaky existing install while keeping all your programs, personal data, and user accounts intact. To initiate in-place upgrade is easy, insert the Windows Installation disc or USB and Run setup.exe In the initial phase of the installation process, you must choose the ‘Upgrade’ option to perform a repair install. After the installation complete, clean up the old files using Disk Cleanup or Ccleaner. Run Check Disk from a Command Line to Check for and fix Disk Errors Check Disk examines disks and can correct many types of common errors on FAT16, FAT32, and NTFS drives. Boot from Windows installation disc or USB Choose to Repair your computer. In the System Recovery Options dialog box click Command Prompt and type the following: 1chkdsk C: /p Use tool like “Easy Recovery Essentials” (paid option)","link":"/tech/common-windows-bootstartup-problems-fix/"},{"title":"Configure sendmail to use a different port for outgoing mail other than 25","text":"Typically sendmail uses standard SMTP port 25 to relay mail. In most cases, this works fine as is, however, some ISPs block port 25. This makes it particularly difficult for sendmail to do its thing since it is supposed to work on port 25. In addition, opening port 25 could be risky. What are the security risks of opening port 25? Port 25 is used by the SMTP protocol to send mail. Some DDOS attacks seems to be targeted at port 25, email related. Under DDOS attacks, it will create huge number of connections to port 25 and causing too much traffic on the server. Port 25 obviously needs to be open for us to receive legitimate email, so we can’t block it. We can however change the default port 25 to other ports to reduce the risk of being attack. To make sendmail listen on a different port: edit /etc/mail/sendmail.mc Change Port=&lt;portnumber&gt; in DAEMON_OPTIONS. Rebuild the sendmail.cf. 1m4 /etc/mail/sendmail.mc &gt; /etc/mail/sendmail.cf Restart sendmail.For Debian: 1/etc/rc.d/init.d/sendmail restart For CentOS: 1service sendmail restart","link":"/tech/configure-sendmail-to-use-a-different-port-for-outgoing-mail-other-than-25/"},{"title":"Connect to Amazon EC2 Linux Instance from Windows Via PuTTY","text":"PuTTY does not natively support the private key format (.pem) generated by Amazon EC2. If you load the .pem formet private key directly to PuTTY you will get error message: Unable to use key file “***.pem” (OpenSSH SSH-2 private key). PuTTY has a tool called PuTTYgen, which can convert keys to the required PuTTY format (.ppk). You must convert your private key into this format (.ppk) before connecting to your instance using PuTTY. Install the latest version Putty for Windows. Download PuTTY. Locate the private key. .pem file for the key pair that you specified when you launched the instance. Enable inbound SSH traffic from your IP address to your instance. Your default security group does not allow incoming SSH traffic. authorize Inbound Traffic for Your Amazon EC2 Linux Instances Get the public DNS name of the instance or the Public IP address. Converting Your Private Key Using PuTTYgen. Download the latest version PuTTYgen Start puttygen.exe Under Type of key to generate, select SSH-2 RSA Load your .pem file. Click Load. By default, PuTTYgen displays only files with the extension .ppk. To locate your .pem file, select the option to display files of all types. Click Save private key to save the key in the format that PuTTY can use. Note: You can use a passphrase to add an extra layer of protection to the private key. Starting a PuTTY Session Fill in the public DNS name of the instance or the Public IP address. In the Category pane, expand Connection, expand SSH, and then select Auth. Browse and select the .ppk file that you generated for your key pair, and then click Open. login in as: ec2-user or ubuntu depends on the system that you selected for the instance. You can try to login as root first and find out what login name should you use.","link":"/tech/connect-to-amazon-ec2-linux-instance-from-windows-via-putty/"},{"title":"Connect to existing AWS AppSync API from a React Application","text":"Have an existing API within AWS AppSync and need to connect it from a React web application? If you are not completely new to GraphQL you should know that the most popular GraphQL client is Apollo. There are many different way to connect to AWS AppSync with React, using different packages. Some required more packages/dependencies. Use Apollo client The latest version @apollo/client can handle AWS AppSync’s query and mutation just fine with simple setup and also support React hook out of the box. Per their official doc, they will only support useQuery for query and useMutation for mutation hooks in their future release. Component based query and mutation will still work but will not be supported. However, for subscription, @apollo/client and AWS AppSync API won’t work without complex setup because AppSync’s subscriptions use MQTT as the transport layer, but @apollo/client support WebSockets. If you are using React with version that support hook, and you don’t have the need for subscription, this option will work very well. Install required packageyarn add @apollo/client aws-appsync-auth-link graphql Create client.js with following setup. aws-exports is the config download from your AWS AppSync API 123456789101112131415161718192021222324import { ApolloClient, ApolloLink, InMemoryCache, createHttpLink,} from &apos;@apollo/client&apos;;import { createAuthLink } from &apos;aws-appsync-auth-link&apos;;import AppSyncConfig from &apos;./aws-exports&apos;;const url = AppSyncConfig.aws_appsync_graphqlEndpoint;const region = AppSyncConfig.aws_project_region;const auth = { type: AppSyncConfig.aws_appsync_authenticationType, apiKey: AppSyncConfig.aws_appsync_apiKey,};const link = ApolloLink.from([ // @ts-ignore createAuthLink({ url, region, auth }), // @ts-ignore createHttpLink({ uri: url }),]);const client = new ApolloClient({ link, cache: new InMemoryCache(),});export default client; In your index.js add below code to Apollo client accessible.ApolloProvider will make your AppSync client accessable any child of the entry point component whic is App in this example. 123456import { ApolloProvider } from &apos;@apollo/client&apos;;import client from &apos;./graphQL/client&apos;;&lt;ApolloProvider client={client}&gt;&lt;App /&gt;&lt;/ApolloProvider&gt; Example of making a mutation call: 12345678910111213141516171819202122232425262728293031import { useMutation, gql} from &apos;@apollo/client&apos;;const createTodo = gql` mutation CreateTodo( item: String! ) { createUpdateMonitor(input: { item: item }) { item } }`;const [createTodoMutation] = useMutation(createTodo);const handleCreateTodoClick = () =&gt; { const todo = { item: &apos;visit qualityology.com&apos; } createTodoMutation({ variables: todo, }) .then((res) =&gt; console.log(&apos;Todo created successfully&apos;)) .catch((err) =&gt; { console.log(&apos;Error occurred&apos;); console.log(err); }); }; Use AWS AppSync JavaScript SDK This SDK can be used with apollo-client and it is the offical SDK provided by AWS Labs. It support offline feature and also work with class components. Your index.js will need to be setup with the following code. You will need to download aws-exports.js from your AWS AppSync API and install react-apollo aws-appsync-react for this setup. ``aws-exports.js` contains the GraphQL endpoint url and your AWS AppSync API region, auth type info. new AWSAppSyncClient will create a new AppSync client and store it in the client variable.ApolloProvider will make your AppSync client accessible any child of the entry point component whic is App in this example. 12345678910111213141516171819202122232425262728import AWSAppSyncClient from &apos;aws-appsync&apos;import React from &apos;react&apos;;import ReactDOM from &apos;react-dom&apos;;import AppSyncConfig from &apos;./aws-exports&apos;import { ApolloProvider } from &apos;react-apollo&apos;import { Rehydrated } from &apos;aws-appsync-react&apos; // this needs to also be installed when working with Reactimport App from &apos;./App&apos;const client = new AWSAppSyncClient({ url: AppSyncConfig.graphqlEndpoint, region: AppSyncConfig.region, auth: { type: AppSyncConfig.authenticationType, apiKey: AppSyncConfig.apiKey, // jwtToken: async () =&gt; token, // Required when you use Cognito UserPools OR OpenID Connect. token object is obtained previously }})const WithProvider = () =&gt; ( &lt;ApolloProvider client={client}&gt; &lt;Rehydrated&gt; &lt;App /&gt; &lt;/Rehydrated&gt; &lt;/ApolloProvider&gt;)ReactDOM.render(&lt;WithProvider /&gt;, document.getElementById(&apos;root&apos;)); Rehydrate will make sure application cache has been read and is ready to use before rendering the app. If app is not ready, it will show the default loading text. If you want to confured the display text, you can call the render function as below. 12345&lt;Rehydrated render={({ rehydrated }) =&gt; ( rehydrated ? &lt;App /&gt; : &lt;div&gt;Fancy loading function here!&lt;/div&gt; )} /&gt; This method didn’t work with out test application because it always show loading so it is not recommended to use unless you want to try it with a good reason. You can get more configuration from the project page here. Use AWS Amplify This is the easiest and with complete support of query, mutation, and subscription for AWS AppSync API. You will need your AWS AppSync API ID and the config export for this method. It can be found in AWS console. Install AWS Amplify cli. 1npm install -g @aws-amplify/cli The cli is needed for importing API Navigate to your React project root folder. 1amplify init Add the codegen category to your React project. 1amplify add codegen --apiId YOUR_API_ID_HERE Generate client code. 1amplify codegen Follow the steps in your terminal. Add aws-amplify 1npm install aws-amplify or use yarn 1yarn add aws-amplify Add below code to your React application root index.js 12345678// some imports hereimport { Amplify } from &apos;aws-amplify&apos;;import amplifyConfig from &apos;./aws-exports&apos;;// after all the importsAmplify.configure(amplifyConfig);// the rest of the code, ReactDOM etc. Example of how the function used to call mutation look like: 1234567891011121314151617import { API, graphqlOperation } from &apos;aws-amplify&apos;;import { createTodo } from &apos;/graphql/mutations&apos;;const todo = { item: &apos;visit qualityology.com&apos;}const update = await API.graphql( graphqlOperation( createTodo, { input: todo, }, ), ) .then((res) =&gt; res) .catch((error) =&gt; console.log(&apos;error, creating user&apos;, error));console.log(&apos;update&apos;, update);","link":"/tech/connect-to-existing-aws-appsync-api-from-a-react-application/"},{"title":"Create a bootable latest & final version Beini 1.2.5 USB","text":"Beini is a small Linux distribution that packs a punch. it is based on Tiny Core Linux. It offers an array of WiFi security audit tools. Beini is easy for newbie to used compare to BackTrack, which is the popular system used to crack WEP/WPA. Beini include packages: Minidwep, Aircrack, Inflator, Reaver, Feeding Bottle, Wifite *This guide is for your own educational purpose. Hacking or Cracking other people wireless network is illegal and against law. We advice you do not attempt to attack wireless network other than your own. Download the latest Beini system. Beini-1.2.5.iso Download UNetbootin . (Note: Do NOT use the latest version, here we use 377) UNetbootin 377 Format your USB as FAT32. Create a new folder on your desktop, extract the ISO file that you downloaded in step 1 into that folder. Open UNetbootin and setup the following (~ means the full Path of a Folder): Kernel: ~\\boot\\bzImage Initrd: ~\\boot\\tinycore.gz Options: ~\\boot\\isolinux\\isolinux.cfg (you can change these options manually, for example: change the language (e.g. en.utf8). Note: If the USB does not load you should add the following kernel boot parameter waitusb=8 to potentially fix the problem. Note: Make sure you select the correct USB drive. After you see “Installation Complete, Reboot (Current)”, you can reboot the computer and select boot from your USB from BIOS.","link":"/tech/create-a-bootable-latest-final-version-beini-1-2-5-usb/"},{"title":"Still need DOS? Create a Bootable MS-DOS / FreeDOS USB Drive","text":"Does we still need DOS for somethings? Yes, if you are still using Ghost for backup and restore. Or you need data recovery software work only under DOS. BIOS updates, firmware-updating utilities often require you to boot into DOS and run the utility. However, it is extremely hard to find a floppy disks with MS-DOS or a computer can read floppy disks anymore. If you still need DOS to do some operations, you can create a bootable DOS USB drive. Burning ISO to USB can be a headache for a lot of people, and oftentimes it will split a USB drive into two partitions. Here we have a tool Rufus to do this simple but not easy job for us. Rufus will not split USB to multiple partitions so the remaining portion of the drive can still be used. Download Rufus Rufus doesn’t need any installation so you just launch it after you downloaded it. Now we can create a bootable USB drive with DOS in a very simple way: Connect a USB drive to the computer and select it in the Device box. Check “Create a bootable disk using” checkbox and select MS-DOS or FreeDOS. Click the Start button. This will erase the contents of your USB drive. You can also use Refus to create a bootable USB from an ISO image. You can even use it to create a Windows 8 installation USB drive. *Since version 1.3.2, Rufus support UEFI as well as GPT for installation media, meaning that it will allow you to install Windows 7, Windows 8 or Linux in full EFI mode. Because of OS limitations, Windows XP restricts the creation of UEFI bootable drives to MBR mode.","link":"/tech/create-a-bootable-ms-dos-freedos-usb-drive/"},{"title":"Disable Adobe Reader build in PDF Viewer in Firefox Chrome IE","text":"Firefox, Chrome, and the latest version Internet Explorer now have a built in PDF reader. The built-in PDF viewer is enabled by default. It allow users to view PDF without installing Adobe PDF reader. However, the built-in viewers are not compatible with all PDF files. Some PDF files have special arrangements or contain extra functions would have issues when viewing it with built-in PDF viewer. This viewer might not display all PDF documents correctly. To change the default PDF view in web browsers, follow the instructions to active the Adobe PDF reader plug-ins or add-ons. Google Chrome Open Chrome, Type chrome://plugins in the address bar to open the Plug-ins page. Locate the Adobe PDF plug-in, and do one of the following: To make Adobe PDF plug-in the default PDF viewer in the browser, enable the Adobe PDF plug-in and disable Chrome PDF Viewer. To disable in browser PDF viewing and force Chrome download PDF files, leaves both viewer plug-ins disabled so the PDFs won’t display in the browser. Mozilla Firefox Press Ctrl+Shift+A to open the Add-ons Manager window. Enable the Acrobat or Reader plugin by select “Always Active” Next open option windows, under Applications tab Select Use Adobe Acrobat (in Firefox) for Adobe Acrobat Forms Document, Adobe Acrobat XML Data Package File, and Portable Document Format (PDF). * To disable in browser PDF viewing, select save file. Internet Explorer (IE) Open Internet Explorer, and choose Tools &gt; Manage Add-ons. Under Add-on Types, select Toolbars And Extensions. In the Show menu, select All Add-ons. In the list of add-ons, select Adobe PDF Reader.","link":"/tech/disable-adobe-reader-build-in-pdf-viewer-in-firefox-chrome-ie/"},{"title":"Disable ASUS Motherboard's UEFI secure boot","text":"Most new ASUS motherboards do not have the option to let users to turn off the UEFI secure boot. The “Secure Boot Enabled” is always greyed out and unable to change that option. Yet, we do have the option to disable the secure boot by clearing secure boot keys. This is reversible so no need to worry about breaking the warranty or damaging the BIOS. BIOS’s Secure Boot menu should show Secure Boot state as “enabled” and Platform Key (PK) state as “loaded” To disable the UEFI secure boot: Make sure the “OS Type” is “Windows UEFI” Enter “Key Management” Select “Clear Secure Boot keys” (You will have the option “Install default Secure Boot keys” to restore the default keys after you cleared the Secure Boot Keys) After you cleared the Secure Boot Keys, Secure Boot will be automatically disabled. You can set the OS Type to Other OS now.","link":"/tech/disable-asus-motherboards-uefi-secure-boot/"},{"title":"Easy fix for Java error FRM-92095: Oracle JInitiator version too low","text":"After logging into Java application in any browser (Chrome, Firefox, or Internet Explorer), Windows produces an error indicating that the JInitiator version is too low, system pop up below error message: FRM-92095: Oracle JInitiator version too low. Please install version 1.1.8.2 or higher Why: The cause is the JRE version is not compatible. Oracle made an internal change in the Java plugin after Java 7 that causes Oracle Forms (Banner) to not recognize that Java is correctly installed. Solution 1: Add a OS Parameter: JAVA_TOOL_OPTIONS, and parameter value: -Djava.vendor=”Sun Microsystems Inc.” as Environment Variables 1. Open Advanced system settings Start Menu › Control Panel › System and Security › System 2. Click Environment Variables 3. Add a System variables 12Variable name: JAVA_TOOL_OPTIONSVariable value: -Djava.vendor=&quot;Sun Microsystems Inc.&quot; 4. Re-log or reboot your system Solution 2: Add a OS Parameter: JAVA_TOOL_OPTIONS, and parameter value: -Djava.vendor=”Sun Microsystems Inc.” as Java Runtime Parameter 1. Open Java Control Panel Windows 8 or Windows 10 Use search to find the Control Panel Press Windows logo key + W to open the Search charm to search settings In the search box enter Java Control Panel Click on Java icon to open the Java Control Panel. Windows 7, Vista Click on the Start button and then click on the Control Panel option. In the Control Panel Search enter Java Control Panel. Click on the Java icon to open the Java Control Panel. Windows XP Click on the Start button and then click on the Control Panel option. Double click on the Java icon to open the Java Control Panel. Alternate method of launching Java Control Panel In the Start Search box, type: Windows 32-bit OS: c:\\Program Files\\Java\\jre7\\bin\\javacpl.exe Windows 64-bit OS: c:\\Program Files (x86)\\Java\\jre7\\bin\\javacpl.exe 2. After the Java Control Panel opens, go to the Java tab as shown below. The rest of the directions apply to both 32-bit and 64-bit Windows. 3. Click “View”, then add -Djava.vendor=”Sun Microsystems Inc.” into the Runtime Parameter box Solution 3: Uninstall your JRE 7, and re-install JRE 6 since Java 7 currently incompatible with Banner Forms Solution 4 (advanced solution and it is not recommended for end-users): Enable EBS environments for JRE 7, refer: https://blogs.oracle.com/stevenChan/entry/java\\_jre\\_1\\_7\\_03","link":"/tech/easy-fix-for-java-error-oracle-jinitiator-version-too-low/"},{"title":"Easy Dual WAN Load Balancing with MikroTik RouterOS PCC","text":"RouterOS’s load balancing is simple but tricky. Even Mikrotik shows an example of how to configure PCC for load balancing. It does not say how to implement it with dynamic IP. The method introduced here is simple. We will add lease scripts to WAN1 and WAN2. RouterOS will run the script to add the correct gateway IP and firewall rules to make the load balancing work. Requirements: 1. Name your WAN ports as WAN1 and WAN2. Your bridge as bridge.2. Basic knowledge of RouterOS3. Turn off fasttrack. Yes. It must be off. Otherwise, router can’t mark traffic and distribute to both WANs. Disable the firewall filter with action “fasttrack-connection” and that is it. Add below scripts to IP/DHCP Client/WAN1 and IP/DHCP Client/WAN2. You can do that via web config. For WAN1: 123456789101112131415161718192021222324252627282930{ :local count [/ip route print count-only where comment=WAN1] :if ($bound=1) do={ :if ($count = 0) do={ /ip route add gateway=$&quot;gateway-address&quot; routing-mark=WAN1 comment=WAN1 /ip firewall nat add chain=srcnat out-interface=WAN1 action=masquerade comment=WAN1 /ip firewall mangle add chain=prerouting dst-address=$&quot;gateway-address&quot; action=accept in-interface=bridge comment=WAN1 /ip route add gateway=$&quot;gateway-address&quot; routing-mark=WAN1_out check-gateway=ping comment=WAN1 /ip route add gateway=$&quot;gateway-address&quot; distance=1 check-gateway=ping comment=WAN1 } else={ :if ($count &gt; 1) do={ :local test [/ip route find where comment=WAN1] :if ([/ip route get $test gateway] != $&quot;gateway-address&quot;) do={ /ip route set $test gateway=$&quot;gateway-address&quot; } :local test2 [/ip firewall mangle find where comment=WAN1] :if ([/ip firewall mangle get $test2 gateway] != $&quot;gateway-address&quot;) do={ /ip route set $test2 gateway=$&quot;gateway-address&quot; } } else={ :error &quot;Multiple routes found&quot; } } } else={ /ip route remove [find comment=WAN1] /ip firewall mangle remove [find comment=WAN1] /ip firewall nat remove [find comment=WAN1] }} For WAN2: 123456789101112131415161718192021222324252627282930313233343536373839{ :local count [/ip route print count-only where comment=WAN2] :if ($bound=1) do={ :if ($count = 0) do={ /ip route add gateway=$&quot;gateway-address&quot; routing-mark=WAN2 comment=WAN2 /ip firewall nat add chain=srcnat out-interface=WAN2 action=masquerade comment=WAN2 /ip firewall mangle add chain=prerouting dst-address=$&quot;gateway-address&quot; action=accept in-interface=bridge comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=WAN1 connection-mark=no-mark action=mark-connection new-connection-mark=WAN1_conn comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=WAN2 connection-mark=no-mark action=mark-connection new-connection-mark=WAN2_conn comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=bridge connection-mark=no-mark dst-address-type=!local protocol=tcp dst-port=22,80,443 per-connection-classifier=both-addresses:2/0 action=mark-connection new-connection-mark=WAN1_conn comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=bridge connection-mark=no-mark dst-address-type=!local protocol=tcp dst-port=22,80,443 per-connection-classifier=both-addresses:2/1 action=mark-connection new-connection-mark=WAN2_conn comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=bridge connection-mark=no-mark dst-address-type=!local per-connection-classifier=both-addresses-and-ports:2/0 action=mark-connection new-connection-mark=WAN1_conn comment=WAN2 /ip firewall mangle add chain=prerouting in-interface=bridge connection-mark=no-mark dst-address-type=!local per-connection-classifier=both-addresses-and-ports:2/1 action=mark-connection new-connection-mark=WAN2_conn comment=WAN2 /ip firewall mangle add chain=prerouting connection-mark=WAN1_conn in-interface=bridge action=mark-routing new-routing-mark=WAN1_out comment=WAN2 /ip firewall mangle add chain=prerouting connection-mark=WAN2_conn in-interface=bridge action=mark-routing new-routing-mark=WAN2_out comment=WAN2 /ip firewall mangle add chain=output connection-mark=WAN1_conn action=mark-routing new-routing-mark=WAN1_out comment=WAN2 /ip firewall mangle add chain=output connection-mark=WAN2_conn action=mark-routing new-routing-mark=WAN2_out comment=WAN2 /ip route add gateway=$&quot;gateway-address&quot; routing-mark=WAN2_out check-gateway=ping comment=WAN2 /ip route add gateway=$&quot;gateway-address&quot; distance=2 check-gateway=ping comment=WAN2 } else={ :if ($count &gt; 1) do={ :local test [/ip route find where comment=WAN2] :if ([/ip route get $test gateway] != $&quot;gateway-address&quot;) do={ /ip route set $test gateway=$&quot;gateway-address&quot; } :local test2 [/ip firewall mangle find where comment=WAN2] :if ([/ip firewall mangle get $test2 gateway] != $&quot;gateway-address&quot;) do={ /ip route set $test2 gateway=$&quot;gateway-address&quot; } } else={ :error &quot;Multiple routes found&quot; } } } else={ /ip route remove [find comment=WAN2] /ip firewall mangle remove [find comment=WAN2] /ip firewall nat remove [find comment=WAN2] }} For port 22,80,443 we use “both-addresses” as connection classifier to avoid HTTPS error or other authentication issues. Other ports we use both-addresses-and-ports so we can get maximum speed from both WANs. If you want to see the official doc of how to configure PCC in RouterOS. Here is the link: https://wiki.mikrotik.com/wiki/Manual:PCC","link":"/tech/easy-dual-wan-load-balancing-with-mikrotik-routeros-pcc/"},{"title":"Edit Hosts file to override DNS record for domains","text":"Hosts file will instruct your machine to go directly to an IP address for specified domain instead of checking with DNS server. For example, point www.qualityology.com and qualityology.com to Google Cloud Platform server: 1235.185.219.11 www.qualityology.com35.185.219.11 qualityology.com WindowsFor Windows 10, Windows 8, Windows 7, and Windows Vista systems that use User Account Control (UAC). Run Notepad as Administrator. Press the “Windows” key, type in “Notepad”. Right-click the notepad icon and select: Run as Administrator. OK the UAC prompt. Open the HOSTS file from Notepad. By default, the Hosts file is located in the C:\\Windows\\System32\\Drivers\\etc\\ folder. Edit the HOSTS file and save. Run the command below in CMD to flush DNS cache. 1ipconfig /flushdns *If you use other programs to edit the Hosts file when you have Windows Defender enabled, Windows Defender may determine incorrectly that the Hosts file was changed by malware, and will automatically remove your modified Hosts file and replace it with the default from Microsoft. You will need to allow hosts file change in Windows Defender, exclude the Hosts file from scanning in Windows Defender. By default, Windows system’s Hosts file is located in the %systemroot%\\system32\\drivers\\etc folder. Open Windows Defender. On the Settings tab, click Excluded files and locations. Under File locations, click Browse. Locate and then click the Hosts file. Click Add, and then click Save changes. Exit Windows Defender. After everything is done. Go back to Windows Defender and remove the exclusion to secure the hosts file from unauthorized edit. macOS Open Terminal. Type 1sudo nano /etc/hosts and hit return. Enter your administrator password and then hit return. Edit the record or add IP Domain based on your need. press control and X, and type Y to save and exit. Run the command below in Terminal to flush DNS cache. 1sudo killall -HUP mDNSResponder","link":"/tech/edit-hosts-file-to-override-dns-record-for-domains/"},{"title":"Fix error - Mediakit reports not enough space on device for requested operation","text":"If you tried use MacOS’s disk utility to erase or format a old/new hard drive, you may encounter some issue. MacOS will show below error when you tried to erase or format the drive, regardless your hard drive space: Erase process has failed, press done to continue The detail message will say: Volume erase failed: Media kit reports not enough space on this device for requested operation This error appear mostly when you try to convert Windows formatted hard drive to HFS+ (OSX Journaled). Some new external hard drive come with NTFS format. If you have this issue, you can still use diskutil to do this, but in terminal. Step 1, find your disk name you’re trying to format. You can use command: 1diskutil list or find that from disk utility. Step 2, unmount that usb from terminal. From step 1 we got the disk name is disk3. Replace disk3 with the correct disk name you found using step 1 for below command. 1diskutil unmountDisk force disk3 Step 3, Filling the disk with all zeros (This may take a while, as it is making every bit of data 0. 1sudo dd if=/dev/zero of=/dev/disk3 bs=1M Step 4, partition it The following command will create one partition with JHFS+ format. You can change JHFS+ to APFS, ExFAT if you like. 1diskutil partitionDisk disk3 GPT JHFS+ &quot;My External HD&quot; 0g If you have issue with Windows, you can see the tutorial for Windows: Properly Delete Extra Partitions on USB Drive using DiskPart","link":"/tech/fix-error-mediakit-reports-not-enough-space-device-requested-operation/"},{"title":"FREE Let's Encrypt SSL certificate via Certbot and auto renew","text":"SSL certificate from Let’s Encrypt is free. That is the the whole point of why people are getting Let’s Encrypt’s SSL certificate. Their SSl are supported in all modern browsers. The only con is the certificate expire in 3 months. However, we can make the renewing process easier with cron. This guide is for server that already have https setup correctly, and will NOT cover how to setup https or modify server ssl configuration file. get Let’s Encrypt’s client: Certbot. Most systems already have Certbot package in the repository. You can check and follow the installation step from https://certbot.eff.org *You can add more domain to above command if you like. use CertBot to get SSL certificate for domain1 and domain2. *We only need CertBot to generate certificate only in this case and we don’t want CertBot to touch SSL configuration file. 1./certbot certonly --email xxx@xxx.com -d domain1.com -d www.domain1.com -d domain2.com -d www.domain2.com Pick 1-3 for according to your server setup if you see below feedback. 1234567How would you like to authenticate with the ACME CA?-------------------------------------------------------------------------------1: Apache Web Server plugin - Beta (apache)2: Place files in webroot directory (webroot)3: Spin up a temporary webserver (standalone)-------------------------------------------------------------------------------Select the appropriate number [1-3] then [enter] (press &apos;c&apos; to cancel): CertBot will automatically verify your domain(s), generate key, and create CSR. Your will see Congratulation! note after all processes are completed. Total about 20 seconds. 1234567IMPORTANT NOTES: - Congratulations! Your certificate and chain have been saved at /etc/letsencrypt/live/domain1.com/fullchain.pem. Your cert will expire on 2017-02-31. To obtain a new or tweaked version of this certificate in the future, simply run certbot-auto again. To non-interactively renew *all* of your certificates, run &quot;certbot-auto renew&quot; check if your SSL certificate is in /etc/letsencrypt/live/domain1.com/ folder. You should have below files. 1234privkey.pem : the private key for your certificate.fullchain.pem: the certificate file used in most server software.chain.pem : used for OCSP stapling in Nginx &gt;=1.3.7.cert.pem : will break many server configurations, and should not be used without reading further documentation. point your SSL certificate, private key, and chain to the new generated SSL certificate location with correct names. (How to? please refer to this guide: Configuring HTTPS servers) create a auto renewal check task to have your server run CertBot to check the certification expiration date everyday to make sure your SSL is not expired. 12#!/bin/bashcertbot renew --noninteractive --renew-hook &apos;sudo systemctl reload nginx&apos;","link":"/tech/free-lets-encrypt-ssl-certificate-via-certbot/"},{"title":"Fix Raspberry Pi OpenWrt Boot problem","text":"If you install the OpenWrt into your Raspberry Pi can’t get it boot. The following steps might help you fix the problem. If you still don’t know how to install OpenWrt on Raspberry Pi, you can go to: How to install OpenWrt on Raspberry Pi After the installation process complete and when you boot the Raspberry Pi with OpenWrt the first time, you might be stuck while booting up the system. The console will stopped scrolling messages at 1procd: - init complete - Most likely this issue is because the image does not include the latest boot files and it will not work with the more recent Raspberry Pi boards with different RAM chip. The easiest fix for this is manually replace the boot files with the latest version boot files from Raspbian image. You don’t need to download the whole Raspbian image. Simply go to https://github.com/raspberrypi/firmware/tree/master/boot Download bootcode.bin fixup.dat and start.elf copy and paste these 3 files to the boot partition to replace the original boot files on your OpenWrt card.","link":"/tech/fix-raspberry-pi-openwrt-boot-problem/"},{"title":"Free Office 365 for Students and Teachers","text":"Office 365 Education for Students and Teachers is now available. You can install Office on up to 5 PCs or Macs and on other mobile devices, including Windows tablets and iPads. Check if you’re eligible What are the eligibility requirements for FREE Office 365 Education program? Use your .edu or .edu.* email address to see if your school is qualify for this program. What will I get? Latest version Word, Excel, PowerPoint, Outlook, OneNote, Publisher, and Access on up to 5 PCs or Macs and Office apps on other mobile devices including Windows tablets and iPads. The plan also includes 1TB of OneDrive storage, managed by the school, and students can edit and collaborate using Office Online, Yammer, and SharePoint sites. How long can I use this plan for? If you are eligible, you can use the plan until you graduate or are no longer enrolled at a qualified school. Student eligibility may be re-verified at any time. Basically, keep your .edu email active. What do I do if I am student but I’m not eligible for this program? Buy the discounted version Office 365. Click here to go.","link":"/tech/free-office-365-for-students-and-teachers/"},{"title":"Get Free $25 Cricket Wireless Credit for New Customer - Expired","text":"Why use Cricket Wireless? Cricket Wireless uses AT&amp;T cell towers so it will have native AT&amp;T coverage plus some domestic roaming. You can even have Canada and Mexico roaming coverage when traveling by paying $10 more. Cricket Wireless get new feature even faster than AT&amp;T’s prepaid plan (former AT&amp;T gophone). For example, Cricket Wireless user have VoLTE (Voice over LTE) now while AT&amp;T’s prepaid plan still missing that option. Tax is included. Why pay 20% more tax? Affordable family plan, 5 lines for $100! No hidden fee. Local stores everywhere if you need assistence Cricket Wireless offer more GB than other competitors in same price. The only downside is Cricket Wireless limit the max LTE peak download speeds to 8 Mbps, however, that is fast enough to watch HD video. If you’re a new customer looking to try Cricket Wireless and want to save even more, you can use our  referral for a $25 Credit for each line. If you’re planning on moving multiple lines, after you activate your own line, then refer your other lines so you receive your own $25 credit for each line! After you have them all transferred, you should be able to group them all together for some major group discounts by calling customer service. ***Cricket no longer offer referral credit now. How to claim the $25 credit? Open the referral link: Cricket Rewards Set up your Cricket Rewards account Activate Cricket service within 30 days of the referral and update your phone number within the Cricket Rewards app if you got a new one. Keep your account active and in good standing for 60 days. You can refer your friend using the Cricket Rewards account too. Both parties will receive $25 Credit.","link":"/lifestyle/get-free-25-cricket-wireless-credit-new-customer/"},{"title":"Google Voice + OBi202 = Free home phone service","text":"Obihai had officially announced Obi devices are supported by Google Voice. With a Google Voice account and a companion OBi device you can make and receive VoIP calls on a regular home phone. Obihai adapters have been around since 2011, with the latest update and the Google Voice official integration, the installation process is easier than before. All you need is a Obi device (Obi100, Obi110, Obi200, Obi202), a good internet connection, a regular phone. Although you need to pay for the OBI device, after you pair it up with Google voice, you will save a lot from your phone bill every month. First thing to do is get a Obi device, review the comparison of OBi Devices (Obi100, Obi110, Obi200, Obi202) first and choose a suitable Obi device. OBI mostly are sold on Amazon.com. Below are links to Obi100, Obi110, Obi200, Obi202 Amazon pages. Buy Obi100 from Amazon Buy Obi110 from Amazon Buy Obi200 from Amazon Buy Obi202 from Amazon *You might want to port your home phone number to Google Voice first if you want to keep the number for $20 one time charge. However, you will not able to port your home line number directly to Google Voice because Google’s restriction. You can port the number to Tmobile or AT&amp;T’s prepaid service (cost about $10), wait for couple days after the porting process completed , then submit the port request to Google Voice. After you received your OBI device, for example OBi202, following the procedures below to set up your OBI box. Open the box and plug in the cables.   AC adapter, telephone line, and ethernet cable to router. Here is how the connection should looks like: Go to your computer and visit ObiTalk.com. Register a account and following the directions. Dial a test phone number from the phone connected to the OBI device when it asks. The new setup page now have option “Sign in with Google Account” button makes the set up even easier. Accept the permission request when it asks. Test your phone. Call your OBI connected home phone number to see if the phone rings. Almost done. Log in to your Google voice account, make sure the option “Forwards to Google Chat” is checked. Without this you will not able to make any call from your phone. If you don’t see the option in your Google Voice account, follow this guide to active the option: Missing Forwards calls to Google Chat Option in Google Voice","link":"/tech/google-voice-obi202-free-home-phone-service/"},{"title":"Host Your DNS With Google Cloud DNS","text":"Can Google host my DNS? Yes. We can set domain DNS zones using the Google Cloud DNS service. Google Cloud DNS is a high performance, resilient, and global DNS service, which allows you to easily publish and manage DNS records. It is FREE? Google Cloud DNS provide max billable limit: 50,000 requests/day, so is almost free for a small website. For a website with huge amount of traffic, see https://developers.google.com/cloud-dns/pricing for pricing. 1. Create a new Cloud Project. Google Cloud DNS is part of the Google Cloud Platform. First you need to create a new Cloud Project. Go to https://console.developers.google.com/project Create a new project and choose a descriptive project name such as “Google DNS”, copy down the project ID because we need it later. Click “Enable an API” from the Project Dashboard. Enable “Google Cloud DNS API” (Required). Disable the other default enabled APIs (such as Google Cloud Storage) as they are not required for this project (optional). 2. Install the Google Cloud SDK Google Cloud SDK contains tools and libraries that enable you to create and manage resources on Google Cloud DNS. Go to https://developers.google.com/cloud/sdk/, download and install the SDK before you continue. We only need the Cloud SDK Core Libraries and Tools for Google Cloud DNS. Once the Cloud SDK is installed, make sure it includes the required DNS component. Open the Google Cloud SDK shell and execute the following command. 1gcloud components list If you don’t see “Cloud DNS Admin Command Line Interface” as “Installed”, run the following command. 1gcloud components update dns Next, authorize access to the Google APIs with your Google domain admin account. 1gcloud auth login You will be asked to give permissions to “Google Cloud SDK” to perform operations on your behalf, and the list of permissions is sufficient to use any of the tools included in the SDK. The command will prompt you to enter the project ID. Enter the value from the Developers Console when you created the project. Once you see You are now authenticated with the Google Cloud SDK! you can close the browser and continue. To see if your account has been successfully added run the following command. 1gcloud auth list 3. Create a Managed DNS Zone You will need to set the project ID first. Change the value to the one that you created in the Developers Console. 1gcloud config set project qualityology Let’s create a new Cloud DNS managed zone so we can manage DNS zones and records. 1gcloud dns managed-zone create --description=&quot;qualityology.com zone&quot; --dns_name=&quot;qualityology.&quot; qualityology –description=”qualityology.com zone” is a readable description of your DNS zone. –dns_name=”qualityology.com.” is your domain name. Make sure you include the trailing dot. qualityology is the name of our managed zone. You will see: 12345678910111213141516171819Creating {&apos;dnsName&apos;: &apos;qualityology.com.&apos;, &apos;name&apos;: &apos;qualityology&apos;, &apos;description&apos;:&apos;qualityology.com zone&apos;} in google-dnsDo you want to continue (Y/n)? Y{&quot;creationTime&quot;: &quot;2014-07-24T07:15:31.276Z&quot;,&quot;description&quot;: &quot;qualityology.com zone&quot;,&quot;dnsName&quot;: &quot;qualityology.com.&quot;,&quot;id&quot;: &quot;5988761527897559933&quot;,&quot;kind&quot;: &quot;dns#managedZone&quot;,&quot;name&quot;: &quot;qualityology&quot;,&quot;nameServers&quot;: [&quot;ns-cloud-e1.googledomains.com.&quot;,&quot;ns-cloud-e2.googledomains.com.&quot;,&quot;ns-cloud-e3.googledomains.com.&quot;,&quot;ns-cloud-e4.googledomains.com.&quot;]} 4. Modify an existing DNS Record In default, Google has added NS and SOA for us, to see the default detail, run the follow command. 1gcloud dns records --zone=qualityology list You will see: 1234567891011121314151617181920212223[{&quot;kind&quot;: &quot;dns#resourceRecordSet&quot;,&quot;name&quot;: &quot;qualityology.com.&quot;,&quot;rrdatas&quot;: [&quot;ns-cloud-e1.googledomains.com.&quot;,&quot;ns-cloud-e2.googledomains.com.&quot;,&quot;ns-cloud-e3.googledomains.com.&quot;,&quot;ns-cloud-e4.googledomains.com.&quot;],&quot;ttl&quot;: 21600,&quot;type&quot;: &quot;NS&quot;},{&quot;kind&quot;: &quot;dns#resourceRecordSet&quot;,&quot;name&quot;: &quot;qualityology.com.&quot;,&quot;rrdatas&quot;: [&quot;ns-cloud-e1.googledomains.com. dns-admin.google.com. 0 21600 3600 1209600 300&quot;],&quot;ttl&quot;: 21600,&quot;type&quot;: &quot;SOA&quot;}] The NS record specifies four authoritative name server that you will need when you update your domain’s name servers to use Google Cloud DNS The SOA record specifies the base DNS information about the domain: the primary name server is ns-cloud-e1.googledomains.com the domain administrator’s contact e-mail is dns-admin@google.com, in SOA, it replace @ into a dot. the initial serial number (which has to be incremented with every DNS update) is 0 the refresh time that secondary DNS servers wait before querying the primary DNS server’s SOA record to check for changes is 21600 seconds retry interval that a secondary server waits before retrying a failed zone transfer is 3600 seconds the expire time that a secondary server will keep trying to complete a zone transfer is 1209600 seconds the default minimum time to live is 300 seconds (used for negative caching, meaning that all the queries that don’t have a valid response are cached for this amount of seconds) Now lets edit the DNS record. 1gcloud dns records --zone=qualityology edit Your default editor appears with an example of a change with both the additions and deletions sections displayed in JSON notation. You can edit it by entering your additions, deletions or both. Additions is for new record, deletions is for deleting old record. If you want to change a record, make sure you delete the old record, otherwise it will shows error. After you done your editing, save and close your editor and all changes will be updated to the cloud DNS. 123456789101112131415161718192021222324{&quot;additions&quot;: [{&quot;kind&quot;: &quot;dns#resourceRecordSet&quot;,&quot;name&quot;: &quot;qualityology.com.&quot;,&quot;rrdatas&quot;: [&quot;ns-cloud-e1.googledomains.com. dns-admin.google.com. 1 21600 3600 1209600 300&quot;],&quot;ttl&quot;: 21600,&quot;type&quot;: &quot;SOA&quot;}],&quot;deletions&quot;: [{&quot;kind&quot;: &quot;dns#resourceRecordSet&quot;,&quot;name&quot;: &quot;all4os.com.&quot;,&quot;rrdatas&quot;: [&quot;ns-cloud-e1.googledomains.com. dns-admin.google.com. 0 21600 3600 1209600 300&quot;],&quot;ttl&quot;: 21600,&quot;type&quot;: &quot;SOA&quot;}]} The gcloud tool automatically incremented the serial counter of the SOA record, so the SOA records always shows in both additions and deletions. Google Cloud DNS supported record types: https://developers.google.com/cloud-dns/what-is-cloud-dns#supported_record_types You can add all records in one batch. Here is the example of a adding records to Google Cloud DNS: 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113{ &quot;additions&quot;: [ { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;38.109.218.151&quot; ], &quot;ttl&quot;: 86400, &quot;type&quot;: &quot;A&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;2605:6f00:877::3b9e:9265&quot; ], &quot;ttl&quot;: 86400, &quot;type&quot;: &quot;AAAA&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;10 aspmx.l.google.com.&quot;, &quot;20 alt1.aspmx.l.google.com.&quot;, &quot;20 alt2.aspmx.l.google.com.&quot;, &quot;30 alt3.aspmx.l.google.com.&quot;, &quot;30 alt4.aspmx.l.google.com.&quot; ], &quot;ttl&quot;: 3600, &quot;type&quot;: &quot;MX&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;ns-cloud-e1.googledomains.com.&quot;, &quot;ns-cloud-e2.googledomains.com.&quot;, &quot;ns-cloud-e3.googledomains.com.&quot;, &quot;ns-cloud-e4.googledomains.com.&quot; ], &quot;ttl&quot;: 21600, &quot;type&quot;: &quot;NS&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;ns-cloud-e1.googledomains.com. admin.all4os.com. 1 21600 3600 1209600 300&quot; ], &quot;ttl&quot;: 21600, &quot;type&quot;: &quot;SOA&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;\\&quot;v=spf1 include:_spf.google.com ~all\\&quot;&quot; ], &quot;ttl&quot;: 21600, &quot;type&quot;: &quot;SPF&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;\\&quot;v=spf1 include:_spf.google.com ~all\\&quot;&quot; ], &quot;ttl&quot;: 21600, &quot;type&quot;: &quot;TXT&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;gmail._domainkey.all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;\\&quot;v=DKIM1; k=rsa; p=all4os\\&quot;&quot; ], &quot;ttl&quot;: 86400, &quot;type&quot;: &quot;TXT&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;www.all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;38.109.218.151&quot; ], &quot;ttl&quot;: 86400, &quot;type&quot;: &quot;A&quot; }, { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;www.all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;2605:6f00:877::3b9e:9265&quot; ], &quot;ttl&quot;: 86400, &quot;type&quot;: &quot;AAAA&quot; }] &quot;deletions&quot;: [ { &quot;kind&quot;: &quot;dns#resourceRecordSet&quot;, &quot;name&quot;: &quot;all4os.com.&quot;, &quot;rrdatas&quot;: [ &quot;ns-cloud-e1.googledomains.com. dns-admin.google.com. 0 21600 3600 1209600 300&quot; ], &quot;ttl&quot;: 21600, &quot;type&quot;: &quot;SOA&quot; } ] } Note: we always use the same command to add or remove DNS record. However, your record will not show in your editor when you re-run the command again. To list the records from your zone: 1gcloud dns records --zone=&quot;all4os&quot; list You probably notice that the Shell only show part of the dns records and we are unable to scroll the window to see more information. Google Cloud SDK Shell for Windows in default limits 40 lines in a screen and the it is not scrollable. We need to change to mode to make the shell be able show more lines. If your display isn’t large enough to show all lines, you can still have a shell box that can have much more virtual lines, so that you can scroll up to view the results of a long operation. 1mode 120,500 Now re-run the the list command you will be able to see up to 500 lines. 1gcloud dns records --zone=&quot;all4os&quot; list 5. Update domain name servers After you edited the DNS record, you are almost done. The last thing you need to do is point your domain’s DNS to Google Cloud DNS. To determine the Cloud DNS name server associated with the zone, use the following command: 1gcloud dns managed-zone get all4os 1234567&quot;nameServers&quot;: [&quot;ns-cloud-e1.googledomains.com.&quot;,&quot;ns-cloud-e2.googledomains.com.&quot;,&quot;ns-cloud-e3.googledomains.com.&quot;,&quot;ns-cloud-e4.googledomains.com.&quot;]} Change your domain registrar’s name servers for your domain, replace the name servers in the registrar’s NS records with the four name servers we looked up in the previous step (without the trailing dot). You’re all set. It can take up to 24-48 hours for the new nameservers to become fully active. Other useful Google Cloud DNS commands: https://developers.google.com/cloud-dns/gcloud-dns-command","link":"/tech/host-your-dns-with-google-cloud-dns/"},{"title":"How to install OpenWrt on Raspberry Pi","text":"OpenWrt official supported Raspberry Pi. The latest OpenWrt release as of today already support for Raspberry Pi A, Raspberry Pi B, Raspberry Pi B+, and Raspberry Pi models. The Raspberry Pi is supported in the brcm2708 target. Parts: Raspberry Pi (Click here to buy from Amazon) Power adapter (A popular power supply is the Apple 12W iPad charger, supplying 5V 2.4A. Similar high-powered mobile phone and tablet chargers should suffice. Using cheap power supplies off eBay is not recommended, as they provide a very uneven and noisy current which can lead to unreliable operation.) SD Card (Regular SD or Micro SD based on the Raspberry Pi model you get) PI Case USB Ethernet adapter or WiFi dongle Ethernet cable HDMI monitor - setup only USB Keyboard - setup only Computer for SD Card image creation and configuration - setup only Step 1: Download the relevant openwrt-brcm2708-bcm2708-sdcard-vfat-ext4.img (For Raspberry Pi A/B/B+) or openwrt-brcm2708-bcm2709-sdcard-vfat-ext4.img image (For Raspberry Pi 2). Open http://wiki.openwrt.org/toh/raspberry_pi#supported_versions and choose the most recent update from the download list. Step 2: Flash OpenWrt to an SD/Micro SD card. For Linux desktop: 1. Insert your SD/Micro SD card and run: 1dmesg The most recent message should give you the SD card’s device name, such as sdb or sdf or similar 2. As the root user, use dd to copy the image file to the device you identified previously, for example: For Raspberry Pi A/B/B+: 1dd if=/home/username/Downloads/openwrt-brcm2708-bcm2708-sdcard-vfat-ext4.img of=/dev/sdX bs=2M conv=fsync For Raspberry Pi 2 1dd if=/home/username/Downloads/openwrt-brcm2708-bcm2709-sdcard-vfat-ext4.img of=/dev/sdX bs=2M conv=fsync Replace the sdX with your device name you already get from previous step, such as sdb or sdf. For Windows desktop: On a Windows desktop, use Win32DiskImager to copy the img file to your SD card’s drive letter At this point your are ready to boot OpenWrt on Raspberry Pi. Step 3: Boot the Pi with OpenWrt Insert the SD/Micro SD card into the Raspberry Pi Attach HDMI to monitor Attach keyboard Plug in a network cable from your computer to the Raspberry Pi’s built in network port Attach power Once the console has stopped scrolling messages, press the enter key to open the command line prompt. Run the following command: 1ifconfig eth0 Pay attention to the inet addr line. You will need that address to login and manage the OpenWrt. Open a web browser to the IP address you identified above and you will be able to configure your OpenWrt by using the interface now.","link":"/tech/how-to-install-openwrt-on-raspberry-pi/"},{"title":"Initial Server Setup with CentOS 5.x 6.x 7.x","text":"This is a quick tutorial for building a CentOS based VPS/Dedicated server. CentOS server doesn’t include GUI in default so the only way to access server is using Secure Shell (SSH). The following steps will be completed by using SSH. Login to your server as root. Have your server’s IP address and root password ready. Login as the main user: root. We use PuTTY in Windows environment here to demonstrate how to use SSH to connect to your CentOS server. Open Putty and fill in the IP address, make sure the “connection type” is “SSH”. Leave port 22 as default and click Open. For other platforms like Mac OS X which has a built-in SSH client call Terminal. Use the following command (replace the boldfaced numbers with your own IP address): 1ssh root@192.168.1.1 The Putty or Terminal will ask you to confirm the connection when you first time using SSH in your environment, Click/type yes and then enter your root password. Change default root password. If you rent VPS or Dedicated server, using the default password that the server provider sent you is not a good idea. So the next thing to do is change it to one of your choice. Execute the following command and follow the direction to change your root password 1passwd root You can either set a more complex password or a short or simple password (Not recommended using a simple password for root). You will not need to re-login again to your server as root after the password change. Add a new sudo user account. Log-in into your server as root is not recommended because of root has all of the administrative capabilities. In this step we will make a new user, with a new password, and give them all of the root capabilities. First, create your user; you can choose any name for your user. Here is a example of creating a new user: “qualityology” (replace “qualityology” with your own username): 1adduser qualityology Second, change the new user’s password. 1passwd qualityology Third, grant administrative privileges. When you perform any root tasks with the new user account, you will need to use the phrase “sudo” before the command. We give users access to the sudo command with the visudo command. Execute the following command to edit the sudo configuration. This will be done through the default editor in CentOS is called “vi”. 1visudo It will looks like this: 12## Allow root to run any commands anywhereroot ALL=(ALL) ALL We give a user sudo privileges by copying the line beginning with “root” and pasting it after. We then change the user “root” on the new line to our new user, like this: 123## Allow root to run any commands anywhereroot ALL=(ALL) ALLqualityology ALL=(ALL) ALL We can now save the file and close it. Press Esc key to stop editing, then type :wq and hit Enter to save and exit the file. Now, when you are logged in as your regular user, you can execute a certain command with root privileges by typing: 1sudo command_name Configure SSH and Disable root login in sshd configuration files (OPTIONAL). If you have a concern about the server’s security. Now you can make the server more secure by following this optional but recommended steps. They will make the server more secure by making unauthorized login more difficult. First, change the default SSH port 22 to a new port number. Port 22 is the default SSH port, you can change this to any number between 1025 and 65536 to prevent some automated “Brute-Force SSH Attack” to port 22. Open the SSH configuration file: 1sudo vi /etc/ssh/sshd_config Find the following sections. Remove the # symbol (The # symbol tells the server to ignore anything after it on the same line, so we will need to remove that character) and change the number 22 to whatever number you want bewtwwn 1025 and 65536. Be sure you do not pick a port number that is in use by a different service (eg: 80, 443). 1#Port 22 Second, disable SSH login for the root user. Everyone knows that Linux systems comes with root user access and by default the root access is enabled for outside world. With a good, long, and complicated password, you can limit your exposure to a brute force attack. However, it may still be possible. Hackers can potentially get access to your system if they can figure out your root password. For security reason, root access through SSH should be disabled in order to prevent the hacker from gaining root access to your server. Find the following sections, Remove the # symbol and change the from yes to no to stop future root login. 1#PermitRootLogin yes Third, reload the SSH. 1sudo systemctl reload sshd.service or 1service sshd restart And that’s it. Your SSH port number will change and you can no longer directly access root via SSH.","link":"/tech/initial-server-setup-with-centos-5-x-6-x-7-x/"},{"title":"Install Docker and Docker Compose On Raspberry Pi","text":"If you need help installing Docker on your Raspberry Pi, be sure you pick the guide wisely. Some guides online won’t work on Raspberry Pi. The following steps had been tested on Raspberry Pi 4. Install Docker 123456789101112# Install required packagessudo apt updatesudo apt install -y \\ apt-transport-https \\ ca-certificates \\ curl \\ gnupg2 \\ software-properties-common# Get recommened installation script from docker.curl -fsSL https://get.docker.com -o get-docker.shsudo sh get-docker.sh 123# verify you have docker installeddocker -v# Docker version 20.10.4, build d3cb89e Add current user to docker group. This allow you to manage Docker as a non-root user. 12sudo usermod -aG docker $USERnewgrp docker Install Docker Compose 123# Install Docker Compose from pip (Python3)sudo apt install -y python3-pip libffi-devsudo pip3 install docker-compose 123# verify you have docker-compose installeddocker-compose -v# docker-compose version 1.28.5, build unknown","link":"/tech/install-docker-and-docker-compose-on-raspberry-pi/"},{"title":"Install entware on ARM MIPS based DDWRT, Tomato, and ASUS Merlin","text":"Entware is described as a modern optware replacement. Most of entware’s packages are taken from OpenWRT, but others are unique. If you are considering to install optware, you should try entware. This instruction is for ARM or MIPS devices only. Turn on jffs. In Tomato, enter the web interface, go to “Administrator”, then “jffs”, check “Enable”. Type in the code below into the “Execute When Mounted” box. 1mount -o bind /jffs /opt After reboot Tomato will mount jffs partion to opt. DD-WRT need to put the above command to the startup. Perform the entware install. The script will install entware to /opt. On ARM devices 1wget -O - http://pkg.entware.net/binaries/armv7/installer/entware_install.sh sh On MIPS devices: 1wget -O - http://pkg.entware.net/binaries/mipsel/installer/installer.sh sh Entware is now installed. Use ‘opkg’ command to install pkgs","link":"/tech/install-entware-on-arm-mips-based-ddwrt-tomato-and-asus-merlin/"},{"title":"Install English firmware to Chinese version Yi Car WiFi DVR Camera","text":"Xiao Yi car DVR dash camcorder is a nice budget car DVR from a Chinese company Xiao Mi. There are two version of Xiao Yi car dash cam available in the Market. One is Chinese version, with suction cup mount, Chinese menu, and Chinese voice. There other one is the international version. with adhesive mount, English menu, and voice. The design and video quality are the same except one with suction cup and the other one with adhesive mount. If you bought a Chinese version from eBay or you like the suction cup version, you can covert the firmware to International version by following this guide. All menu will become English and the advanced driver assistance systems will have English prompts. Here are the steps, Create a blank file and name it “engmode”, no file extension. Copy the first 14 characters of the serial number from the menu or label on the bottom of the camera, save as SN.txt. (you will have problem connecting the cam using mobile app if you have more or less than 14 characters in this step) Open SN.txt, find and change the letter “CN” to “US” in the serial number. For example: ******CN****** to ******US****** Copy two files engmode and SN.txt to your SD card. Insert the SD card back into the camera and power it on. Once you see the engineering menu, select number 8 - exit. Go into the settings menu and select factory reset. Once it reboots, select number 8 to exit ENG mode again and enter the settings menu and check if your serial number shows “US” and all other characters match the original serial number. If all good, power off the dash cam, download the firmware from : http://www.yitechnology.com/support/firmware\\_en.html Check the file you download, it should be FWCARC10.bin and size around ~ 9.3M. It you got smaller file, unzip the file use 7zip or other unarchiver you have. Copy FWCARC10.bin from step 10 to your SD card, insert the card back to your dash cam. Power on the cam and it should start updating the firmware. Status light should flash when flashing firmware. once finished, accept all prompts. Format the card and reset your cam.","link":"/tech/install-english-firmware-to-chinese-version-yi-car-wifi-dvr-camera/"},{"title":"How to Check XEN/OpenVZ VPS Memory/RAM Usage","text":"To check used and unused ram and swap space on XEN or OpenVZ VPS is easy. The free command provides information about ram usage on VPS running Linux or another Unix-like operating system. The basic syntax of free is 1free [options] Free accepts no arguments (i.e., input data) and is commonly used without any options. Below is the example of free command on a XEN VPS 12345free total used free shared buffers cachedMem: 1015876 969688 46188 0 58876 679356-/+ buffers/cache: 231456 784420Swap: 1048568 912 1047656 Another example of free command on a OpenVZ VPS 12345free total used free shared buffers cachedMem: 1048576 223836 824740 0 0 78060-/+ buffers/cache: 145776 902800Swap: 1310720 8752 1301968 Some people might question Xen ram usage. Is XEN VPS used up most of the ram? No worry, your ram is fine! XEN VPS is more like a real dedicated Linux server. Linux system will borrow unused ram for disk caching. This makes it looks like you are low on ram. Xen in their work makes a connection between the environment of OS and the server hardware. OpenVZ creates a virtual server as a layer that runs on another operating system.The model of ram allocation between XEN VPS and OpenVZ is different. Xen provides better isolation and dedicated ram, OpenVZ uses a shared kernel approach so resources are more shared. To put it in simple, for OpenVZ VPS, the most important information for free ram is the first row’s free value For XEN VPS, the free ram available is the second row’s free value, - buffers/cache is the “used”, + buffers/cache is “free” Several options are available to change the unit of display for free from its default kilobytes, including -b for bytes, -m for megabytes and -g for gigabytes. Of these, -m is usually the most useful. Thus, for example, to show all of the data in megabytes, the following would be used: 1free -m","link":"/tech/how-to-check-xenopenvz-vps-memoryram-usage/"},{"title":"Install Isso server free with GCP","text":"Isso is an open source comment system similar to Disqus and other paid comment systems, but without using heavy third party script that contain tracking and analystic functions. It use SQLite3 database to store comments since comments take very litttle space. If you are using CMS or blog engine that doesn’t support comments and you care about your website’s loading time and also don’t want your user to tracked by third party comment system. You should try Isso. Get a Linux server. GCP free tier is more than enough. You will need a Linux server for Isso. It can be Detbian, Ubuntu, or Fedora etc. If you don’t have one, you can use Google Cloud Platform (GCP) and create an server with their free tier option. Comments system use very little traffic so you will not likely go over the free tier quota. Start a Linux server first from here Point a sub domain to your GCP’s external IP from step 1. Using a domain is optional. But it is required if you want to use https your Isso link. You can create an sub domain like isso.your_domain.com and set the IP to GCP instance’s external IP Install docker and docker-compose Isso can be installed using docker. Easier to maintain and migrate if needed in the future. If you are using Debian from step 1. You can install docker and docker-compose via follow commands. 12345678910111213141516171819# remove old docker installationsudo apt-get remove docker docker-engine docker.io containerd runcsudo apt-get update# add required packagessudo apt-get install apt-transport-https ca-certificates curl gnupgcurl -fsSL https://download.docker.com/linux/debian/gpg | sudo gpg --dearmor -o /usr/share/keyrings/docker-archive-keyring.gpg# add docker source listecho \\ &quot;deb [arch=amd64 signed-by=/usr/share/keyrings/docker-archive-keyring.gpg] https://download.docker.com/linux/debian \\ $(lsb_release -cs) stable&quot; | sudo tee /etc/apt/sources.list.d/docker.list &gt; /dev/nullsudo apt-get updatesudo apt-get install docker-ce docker-ce-cli containerd.io# install docker-composesudo curl -L &quot;https://github.com/docker/compose/releases/download/1.28.5/docker-compose-$(uname -s)-$(uname -m)&quot; -o /usr/local/bin/docker-composesudo chmod +x /usr/local/bin/docker-compose# add current user to docker groupsudo usermod -aG docker $USERnewgrp docker To verify docker and docker-compose installed correctly. Run following command and you should see the version installed. 12docker -vdocker-compose -v Create docker-compose.yml for Isso 123456789101112131415161718mkdir ~/Isso &amp;&amp; cd ~/Issonano docker-compose.yml# docker-compose.yml for Isso# copy and paste below and ctl + x saveisso: image: wonderfall/isso ports: - &quot;8080:8080&quot; restart: unless-stopped environment: - GID=1000 - UID=1000 volumes: - ./config:/config - ./db:/db Create config file for Isso Replace below conf with your own setup [general] host: your website or blog domain[hash] salt: put some random string (letters + number)[guard] require-email: if you don’t require email for new comment, set it to false[guard] require-author: if you don’t require name for new comment, set it to false[smtp] username: for comment email notification, you can your gmail for this[smtp] password: for the email password. If you are using gmail and have 2FA enabled, generate an app password and use that one instead of your gmail password[smtp] to: where should the email be sent to when new comment posted.[smtp] from: show where the email is coming from[admin] enabled: this will enable the admin panel for Isso. Address will be your Isso domain:8080/admin[admin] password: your password for the admin panel. 1234567891011121314151617181920212223242526272829303132333435363738394041424344mkdir ~/Isso/config &amp;&amp; cd ~/Isso/confignano isso.conf# config/isso.conf# copy and paste below and ctl + x save[general]dbpath = /db/comments.dbhost = https://www.qualityology.commax-age = 1mnotify = smtpreply-notifications = truegravatar = true[moderation]enabled = truepurge-after = 30d[guard]enabled = trueratelimit = 2require-email = truerequire-author = true[server]listen = http://0.0.0.0:8080reload = offprofile = off[markup]options = strikethrough, superscript, autolinkallowed-elements =allowed-attributes =[hash]salt = randomString123algorithm = pbkdf2[smtp]username = no-reply@your_domain.compassword = change_to_your_passwordhost = smtp.gmail.comport = 587security = starttlsto = admin@your_domain.comfrom = &apos;Isso comments system&apos;&lt;no-reply@your_domain.com&gt;timeout = 10[admin]enabled = truepassword = yourPassword Start the Isso container 1docker-compose up -d Setup Nginx 12sudo apt-get update -ysudo apt-get install nginx -y Install certbot for free SSL. This is for your comment domain, not your website or blog domain. So you can call your Isso server with https. 1sudo apt-get install certbot python3-certbot-nginx Generate SSL certificate for your Isso server You will need to enter the sub domain from step 2 for this process. 1sudo certbot certonly --nginx Follow the steps and you will get the certificate fullchain.pem and privkey.pem path. Create a Nginx config for the Isso domain. You will need to replace server_name with your sub domain below. 1234567891011121314151617181920212223242526nano /etc/nginx/conf.d/isso.confserver { listen 80; listen [::]:80; server_name isso.your_domain.com; return 301 https://comments.qualityology.com$request_uri; access_log /dev/null; error_log /dev/null;}server { listen 443 ssl http2; listen [::]:443 ssl http2; server_name isso.your_domain.com; access_log /var/log/nginx/isso-access.log; error_log /var/log/nginx/isso-error.log; ssl_certificate /etc/letsencrypt/live/isso.your_domain.com/fullchain.pem; ssl_certificate_key /etc/letsencrypt/live/isso.your_domain.com/privkey.pem; location / { proxy_set_header Host $http_host; proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for; proxy_set_header X-Forwarded-Proto $scheme; proxy_pass http://localhost:8080; }} Restart Ngnix 12sudo service nginx restartsudo service nginx restart You are all set. You now should be able to use your Isso server. Calling your server from your website/blog with something similar to below script. 1234567891011&lt;script data-isso=&quot;//your_post_url&quot; src=&quot;//isso.your_domain.com/js/embed.min.js&quot; data-isso-require-author=&quot;true&quot; data-isso-require-email=&quot;true&quot; data-isso-avatar=&quot;false&quot; data-isso-gravatar=&quot;true&quot; data-isso-vote=&quot;true&quot; data-isso-reveal-on-click=&quot;true&quot;&gt;&lt;/script&gt;","link":"/tech/install-isso-server-free-with-gcp/"},{"title":"Install MacOS with clover EFI bootloader on ASUS Z87a","text":"Clover is an open source EFI bootloader. clover can do better job than Chameleon, especially on newer UEFI based systems. Using Clover is easy and straightforward. There are tons of documents about how to use clover on Gigabyte motherboards because Gigabyte motherboards usually have less compatibility issues with MAC OS X in the old day. However, with Clover and new OS X after Yosemite, Asus motherboard can also be turned into a perfect Hackintosh. Hardwares used in this instruction: Motherboard: Asus Z87-A motherboard (Get ASUS Z87-A motherboard from Amazon) CPU: I7 4770K CPU or any LGA1150 CPU (Get LGA1150 CPU from Amazon) Graphics Card: Integrated Graphics Processor (HD Graphics 4600) Sound Card: Integrated Realtek ALC892 Overview for this instructions: Download the OS X Yosemite (or El Capitan‎) Application from the Mac App Store Prepare a UEFI Installer USB flash drive ASUS 87-A BIOS setup Install Clover into USB Modify Clover bootloader’s configuration file Install OS X Yosemite Install the bootloader and drivers to system drive Install Sound card driver and fix wake up no sound issue Download OS X Operating System The full operating system is a FREE download for anyone who are using Mac OS X 10.6.8 or after. A full image can be download from the Mac App Store using your Apple ID. Open Mac App Store Search OS X Download OS X *** (in this demo we are using OS X Yosemite) The Application Install OS X Yosemite will appear in /Applications. Prepare a UEFI Installer USB flash drive.(this step will completely erases the USB) Insert the USB drive Open /Applications/Utilities/Disk Utility Select the USB derive in left column. (Click and highlight the name with Total Capacity) Click on the Partition tab Click Current and choose 1 Partition Click Options… Choose GUID Partition Table Under Name: type MAC (It will be renamed later) Under Format: choose Mac OS Extended (Journaled) Click Apply then Partition Open Terminal (/Applications/Utilities/Terminal) and use the command below to create a native OS X installer media from the Install OS X Yosemite Application. 1sudo /Applications/Install\\ OS\\ X\\ Yosemite.app/Contents/Resources/createinstallmedia --volume /Volumes/MAC --applicationpath /Applications/Install\\ OS\\ X\\ Yosemite.app --no interaction The USB will be renamed Install OS X Yosemite upon completion. BIOS setup Should I patch the BIOS? NO, you don’t have to. Make sure Z87-A’s BIOS is up to day. You can always download the latest version BIOS from ASUS’s website. The latest version’s BIOS already have the option to disable the CFG lock (MSR 0xE2) so you don’t need to patch your BIOS. If you don’t have the latest BIOS, you can still use Clover’s AsusAICPUPM patch. You can do that in STEP 4. Disable ASUS Motherboard’s UEFI secure boot Set CSM (Compatibility Support Module) to Disabled Set SATA Mode to AHCI Mode Other settings do not really matter. The system will boot just fine. Install Clover into USBDownload the latest version of Clover from Clover from Sourceforge Open Clover package installer Choose the USB Install OS X Yosemite We are using UEFI boot we will install Clover to the EFI partition of the USB for UEFI booting only. Hit Customize and install Clover to the same USB with the following Custom Install settings: Make Clover Fit your MachineOpen the mounted EFI partition, Navigate EFI/CLOVER/drivers64UEFI/ remove VBoxHfs-64.efi and add HFSPlus.efi (Apple’s HFS driver. Required to boot OSX when creating USB stick using this guide.) Navigate to /EFI/CLOVER/kexts/10.10/ and add FakeSMC.kext Navigate to /EFI/CLOVER/kexts/10.10/ and add RealtekRTL8111.kext (Driver for Realtek 8111GR Gigabit LAN Controller) Navigate to /EFI/CLOVER/ and replace default config.plist with plist for ASUS Z87-A config.plist The configuration file will tell Clover how to run on your machine. You can enable various features and apply patches that the developers have built into Clover. The configurations are going to be vastly different depending upon what components you have. The full explanation of config.plist parameters can be found here. Install OS XReboot your PC and select boot from your newly created USB When Clover boot screen is visible, choose Boot OS X Install from OS X Install OS X Yosemite For a new installation of OS X, you MUST erase and format the destination drive according to the following steps before continuing. If you are upgrading from previous generation OS X like Snow Leopard, Lion, or Mountain Lion and you want to keep your files and apps, skip the following 1-10 steps. Choose Disk Utility Highlight your target hard drive for the Yosemite installation in left column. Click Partition tab Click Current and choose 1 Partition Click Options… Choose GUID Partition Table Under Name: type MAC (You can rename it later) Under Format: choose Mac OS Extended (Journaled) Click Apply then Partition Close Disk Utility When the installer asks you where to install, choose Yosemite, or your existing install. System will restart the 1st time Boot to your USB again, when Clover boot screen is visible, choose Boot OS X Install from OS X Install OS X Yosemite The system will boot into the new drive, create the recovery partition, and complete the installation. Upon completion, system will restart the 2nd time. When Clover boot screen is visible, choose Yosemite then the system will launch OS X Setup Install the bootloader and drivers to system drive. Repeat step 4 after you finished OS X setup, but this time choose to install Clover to your hard drive MAC Repeat step 5 to your hard drive MAC‘s EFI partition. Install Sound card driver and fix wake up no sound issue. Note: The config.plist we provided will prevent the popping sound or static noise issue as we use Mac Pro 3,1 identifier. iMac will periodically force sound card to sleep and will cause Realtek ALC892 sound card to make static noise or popping. The performance different between using Mac Pro 3,1 or iMac system definition is not obvious so no need to change that unless you have specific reason to do so. Download alc892 Open Kext Utility and drag AppleHDA892.kext and CodecCommander.kext to install both kext into /S/L/E. *CodecCommander will fix the no sound problem after sleep and wakeup. *AppleHDA892.kext will not affect original AppleHDA, need to together use with the config.plist provided in this post. add Intel i7 4770K SSDT for better CPU SpeedStep &amp; Power Management Navigate to /Volumes/EFI/EFI/CLOVER/ACPI/patched/ and add SSDT.aml Credit: http://www.tonymacx86.com/yosemite-desktop-guides/144426-how-install-os-x-yosemite-using-clover.html","link":"/tech/install-macos-with-clover-efi-bootloader-on-asus-z87-a/"},{"title":"Install LAMP (Linux Apache MySQL and PHP) phpMyAdmin on CentOS 6 7","text":"LAMP represents a full featured stack of the most popular web server, database, web programming language known as Apache, MySQL and PHP. This article will cover the steps on how to install the LAMP on a CentOS 6 and CentOS 7. make sure your system is up to date. 1yum update -y install Apache and add Apache to your system’s startup. Apache is available as a package in the official Cent-OS repositories. The installation of Apache can be as easy as this. 12yum install httpd -ychkconfig --levels 235 httpd on check your Apache installation. 1service httpd start Open your domain in web browser you will be able to see Apache’s default page in your browser. If you are testing the installing without a domain, use the server IP instead. To find your Server’s IP address, use the command below (You might need to change eth0 to match your VPS): 1ifconfig eth0 grep inet awk &apos;{ print $2 }&apos; install MySQL server and add MySQL to your system’s startup. 12yum install mysql-server -ychkconfig --levels 235 mysqld on Start MySQL and run the mysql_secure_installation script. The script will help you to set the MySQL ‘root’ password, disable remote ‘root’ login, remove anonymous users and remove the ‘test’ database. 12service mysqld startmysql_secure_installation It’s easiest just to say Yes to all the options. At the end, MySQL will reload and implement the new changes. 12345678910111213141516171819202122232425262728By default, a MySQL installation has an anonymous user, allowing anyone to log into MySQL without having to have a user account created for them. This is intended only for testing, and to make the installation go a bit smoother. You should remove them before moving into a production environment.Remove anonymous users? [Y/n] y... Success!Normally, root should only be allowed to connect from &apos;localhost&apos;. This ensures that someone cannot guess at the root password from the network.Disallow root login remotely? [Y/n] y... Success!By default, MySQL comes with a database named &apos;test&apos; that anyone can access. This is also intended only for testing, and should be removed before moving into a production environment.Remove test database and access to it? [Y/n] y- Dropping test database...... Success!- Removing privileges on test database...... Success!Reloading the privilege tables will ensure that all changes made so far will take effect immediately.Reload privilege tables now? [Y/n] y... Success!Cleaning up...All done! If you&apos;ve completed all of the above steps, your MySQL installation should now be secure.Thanks for using MySQL! install PHP as an Apache module (mod_php) so you can execute PHP scripts under your Apache web server. 1yum install php -y install PHP Modules. PHP has a variety of useful libraries and modules that you can add onto your server.Check the libraries that are available: 1yum search php- The following is a list of the available PHP modules: php-bcmath =&gt; A module for PHP applications using the bcmath library php-cli =&gt; Command-line interface for PHP php-common =&gt; Common files for PHP php-dba =&gt; A database abstraction layer module for PHP applications php-devel =&gt; Files needed for building PHP extensions php-embedded =&gt; PHP library for embedding in applications php-enchant =&gt; Human Language and Character Encoding Support php-gd =&gt; A module for PHP applications using the gd graphics library php-imap =&gt; A module for PHP applications that use IMAP php-intl =&gt; Internationalization extension for PHP applications php-ldap =&gt; A module for PHP applications that use LDAP php-mbstring =&gt; A module for PHP applications which need multi-byte string handling php-mysql =&gt; A module for PHP applications that use MySQL databases php-odbc =&gt; A module for PHP applications that use ODBC databases php-pdo =&gt; A database access abstraction module for PHP applications php-pear.noarch =&gt; PHP Extension and Application Repository framework php-pecl-apc =&gt; APC cache optimizing PHP intermediate code php-pecl-memcache =&gt; Extension to work with the Memcached caching daemon php-pgsql =&gt; A PostgreSQL database module for PHP php-process =&gt; Modules for PHP scripts using system process interfaces php-pspell =&gt; A module for PHP applications using pspell interfaces php-recode =&gt; A module for PHP applications using the recode library php-snmp =&gt; A module for PHP applications that query SNMP-managed devices php-soap =&gt; A module for PHP applications that use the SOAP protocol php-tidy =&gt; Standard PHP module provides tidy library support php-xml =&gt; A module for PHP applications which use XML php-xmlrpc =&gt; A module for PHP applications which use the XML-RPC protocol php-zts =&gt; Thread-safe PHP interpreter for use with the Apache HTTP Server Install some necessary modules. For example: PHP’s common files and MySQL support for PHP 1yum install php-cli php-common php-gd php-mysql php-mbstring Note: php-mbstring is needed for phpMyAdmin check your PHP installation. Create a PHP info page within Apache’s document root (/var/www/html). 1echo -e &quot;&lt;?php\\n\\tphpinfo();\\n?&gt;&quot; &gt; /var/www/html/info.php Reload Apache to make the newly installed PHP module take effect. 1service httpd restart Now open “your domain/info.php” in web browser (http://example.com/info.php) and you should see various information page about your PHP installation. install phpMyAdmin so you can easily manage your MySQL databases via a nice frontend written in PHP.phpMyAdmin is NOT available as a package in the official Cent-OS repositories. Important: before continue the following step, go http://www.phpmyadmin.net/home\\_page/downloads.php and check what is the latest version available. (At the time of writing this article the latest version of phpMyAdmin is 4.2.5. You can replace the version number in the following command.) 12345wget -P /tmp http://prdownloads.sourceforge.net/phpmyadmin/phpMyAdmin-4.2.5-english.tar.gztar -zxf /tmp/phpMyAdmin*.tar.gz -C /var/www/html/mv /var/www/html/phpMyAdmin-4.2.5-english /var/www/html/dbAdmincd /var/www/html/mysqlcp config.sample.inc.php config.inc.php Finish up by visiting your phpMyadmin: http://yourdomain/mysql","link":"/tech/install-linux-apache-mysql-php-phpmyadmin-centos-6-7/"},{"title":"Install vQmod to OpenCart","text":"Modifying OpenCart core files greatly reduces your ability to upgrade your store to later versions, and can affect other modules and extensions. vQmod provides a mechanism by which modules requiring OpenCart core modifications can be installed without damaging the integrity of your core system for upgrades. vQmod keeps a list of filenames and changes required, in the form of one XML file per extension. These changes are then created as the core files are used, and the resulting files are stored as cached copies which are executed instead of the original, core PHP or TPL file. Note: OpenCart 2.0 already include OCmod in default. OCmod is similar to vQmod. The vQmod download and instructions for installation can be found here: vQmod download vQmod WiKi Here is the easy instruction: Download the appropriate vQmod zip file provided in the link. Uncompress the zip file and FTP the vQmod folder to your site’s root directory. Set the permissions to 755 or 777 to sure vqmod/vqcache folders writable. Enter your store’s location in your browser, then “vqmod/install” afterwards. If your store is located at “www.mystore.com&quot;, the vQmod install page would be located at “www.mystore.com/vqmod/install&quot;. The following text will appear on the page if it was installed correctly: “VQMOD HAS BEEN INSTALLED ON YOUR SYSTEM!”. Unlike the install folder after installing OpenCart, do not delete vQmod’s install folder after the vQmod installation! Load your homepage to see if it appears and works correctly after the install.","link":"/tech/install-vqmod-to-opencart/"},{"title":"Installing EPEL and REMI repository on CentOS 5.x, 6.x, or 7.x","text":"How to install EPEL and REMI repository on CentOS 5.x, 6.x, or 7.x? The following article will describe how to configure a CentOS 5 based, CentOS 6 based, or CentOS 7 based system to use Fedora Epel repos and third party remi package repos. These package repositories are not officially supported by CentOS, but they provide much more current versions of popular applications like PHP or MYSQL. Like the PHP that the official repositories provide is 5.3.3, the PHP from REMI repository is much more current versions PHP 5.5 or 5.6. Install the extra repositories: The first step requires downloading some RPM files that contain the additional YUM repository definitions. The example below point to the 64-bit versions that work with 64bit VPS instances. CentOS 5.x 64-bit 123wget http://dl.fedoraproject.org/pub/epel/5/x86_64/epel-release-5-4.noarch.rpmwget http://rpms.famillecollet.com/enterprise/remi-release-5.rpmsudo rpm -Uvh remi-release-5*.rpm epel-release-5*.rpm CentOS 6.x 64-bit 123wget http://dl.fedoraproject.org/pub/epel/6/x86_64/epel-release-6-8.noarch.rpmwget http://rpms.famillecollet.com/enterprise/remi-release-6.rpmsudo rpm -Uvh remi-release-6*.rpm epel-release-6*.rpm CentOS 7.x 64-bit 123wget http://dl.fedoraproject.org/pub/epel/beta/7/x86_64/epel-release-7-0.2.noarch.rpmwget http://rpms.famillecollet.com/enterprise/remi-release-7.rpmsudo rpm -Uvh remi-release-7*.rpm epel-release-7*.rpm The example below point to the 32-bit versionsthat work with 32bit VPS instances. For CentOS 7.x, 64 bit version only CentOS 5.x 32-bit 123wget http://download.fedoraproject.org/pub/epel/5/i386/epel-release-5-4.noarch.rpmwget http://rpms.famillecollet.com/enterprise/remi-release-5.rpmsudo rpm -Uvh remi-release-5*.rpm epel-release-5*.rpm CentOS 6.x 32-bit 123wget http://download.fedoraproject.org/pub/epel/6/i386/epel-release-6-8.noarch.rpmwget http://rpms.famillecollet.com/enterprise/remi-release-6.rpmsudo rpm -Uvh remi-release-6*.rpm epel-release-6*.rpm To see all the repos you have with their current status, execute: 1yum repolist Enable the REMI repository By default, the REMI repository is disabled. The REMI repository provides a variety of up-to-date packages that are useful or are a requirement for many popular web-based services. REMI maintains latest version of MySQL and PHP (backports of fedora RPM) so it is not a bad idea to enable the REMI repositories by default. Use VIM or NANO to edit /etc/yum.repos.d/remi.repo 1vi /etc/yum.repos.d/remi.repo or 1nano /etc/yum.repos.d/remi.repo Edit the [remi] portion of the file so that the enabled option is set to 1. This will enable the REMI repository. 1234567[remi]name=Les RPM de remi pour Enterprise Linux 6 - $basearch#baseurl=http://rpms.famillecollet.com/enterprise/6/remi/$basearch/mirrorlist=http://rpms.famillecollet.com/enterprise/6/remi/mirrorenabled=1gpgcheck=1gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-remi Edit the [remi-php55] portion of the file so that the enabled option is set to 1. This will enable the PHP 5.5 update. 12345678[remi-php55]name=Les RPM de remi de PHP 5.5 pour Enterprise Linux 6 - $basearch#baseurl=http://rpms.famillecollet.com/enterprise/6/php55/$basearch/mirrorlist=http://rpms.famillecollet.com/enterprise/6/php55/mirror# WARNING: If you enable this repository, you must also enable &quot;remi&quot;enabled=1gpgcheck=1gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-remi Enabling [remi-php56] PHP 5.6 update is Not recommend before the stable version come out You will now have a larger array of yum repositories from EPEL and REMI. Next is update your CentOS 1yum update","link":"/tech/installing-epel-and-remi-repository-on-centos-5-x-6-x-or-7-x/"},{"title":"Installing the CUPS Print Server to pfSense 2.1 and 2.x","text":"CUPS, the Common UNIX Printing System, provides a portable printing layer for UNIX-based operating systems. It has been developed by Easy Software Products to promote a standard printing solution for all UNIX vendors and users. To install CUPS using a precompiled binary, for pfSense 2.x, issue the following command from a root terminal: Note: For NanoBSD, must remount embedded filesystem as read-write. pfSense 2.1: in the GUI under Diagnostics &gt; NanoBSD, using the toggle button there. Previous version: 1/etc/rc.conf_mount_rw Adding CUPS to PFSense 2.1 Step 1: Add correct repository For x86 version: 1setenv PACKAGESITE ftp://ftp-archive.freebsd.org/pub/FreeBSD-Archive/old-releases/i386/8.1-RELEASE/packages/Latest/ or 1setenv PACKAGESITE http://www.mirrorservice.org/pub/FreeBSD/ports/i386/packages-8.3-release/Latest/ For x64 version: 1setenv PACKAGESITE http://www.mirrorservice.org/pub/FreeBSD/ports/amd64/packages-8.3-release/Latest/ Install CUPS + dependencies 1pkg_add -r cups modify cupsd.conf Replace the original config file (/usr/local/etc/cups/cupsd.conf) with the text below, this will allow anyone on the local network to access the Web GUI, cancel print jobs, and connect to the printer. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384DefaultEncryption NeverLogLevel warnSystemGroup wheel# Allow remote accessPort 631Listen /var/run/cups.sock# Enable printer sharing and shared printers.Browsing OnBrowseOrder allow,denyBrowseAllow allBrowseRemoteProtocols CUPSBrowseAddress @LOCALBrowseLocalProtocols CUPSDefaultAuthType Basic&lt;Location /&gt;# Allow shared printing and remote administration...Order allow,denyAllow @LOCAL&lt;/Location&gt;&lt;Location /admin&gt;# Allow remote administration...Order allow,denyAllow @LOCAL&lt;/Location&gt;&lt;Location /admin/conf&gt;AuthType DefaultRequire user @SYSTEM# Allow remote access to the configuration files...Order allow,denyAllow @LOCAL&lt;/Location&gt;&lt;Policy default&gt;&lt;Limit Send-Document Send-URI Hold-Job Release-Job Restart-Job Purge-Jobs Set-Job-Attributes Create-Job-Subscription Renew-Subscription Cancel-Subscription Get-Notifications Reprocess-Job Cancel-Current-Job Suspend-Current-Job Resume-Job CUPS-Move-Job CUPS-Get-Document&gt;Require user @OWNER @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit CUPS-Add-Modify-Printer CUPS-Delete-Printer CUPS-Add-Modify-Class CUPS-Delete-Class CUPS-Set-Default CUPS-Get-Devices&gt;AuthType DefaultRequire user @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit Pause-Printer Resume-Printer Enable-Printer Disable-Printer Pause-Printer-After-Current-Job Hold-New-Jobs Release-Held-New-Jobs Deactivate-Printer Activate-Printer Restart-Printer Shutdown-Printer Startup-Printer Promote-Job Schedule-Job-After CUPS-Accept-Jobs CUPS-Reject-Jobs&gt;AuthType DefaultRequire user @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit CUPS-Authenticate-Job&gt;Require user @OWNER @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit All&gt;Order deny,allow&lt;/Limit&gt;&lt;/Policy&gt;&lt;Policy authenticated&gt;&lt;Limit Create-Job Print-Job Print-URI&gt;AuthType DefaultOrder deny,allow&lt;/Limit&gt;&lt;Limit Send-Document Send-URI Hold-Job Release-Job Restart-Job Purge-Jobs Set-Job-Attributes Create-Job-Subscription Renew-Subscription Cancel-Subscription Get-Notifications Reprocess-Job Cancel-Current-Job Suspend-Current-Job Resume-Job CUPS-Move-Job CUPS-Get-Document&gt;AuthType DefaultRequire user @OWNER @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit CUPS-Add-Modify-Printer CUPS-Delete-Printer CUPS-Add-Modify-Class CUPS-Delete-Class CUPS-Set-Default&gt;AuthType DefaultRequire user @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit Pause-Printer Resume-Printer Enable-Printer Disable-Printer Pause-Printer-After-Current-Job Hold-New-Jobs Release-Held-New-Jobs Deactivate-Printer Activate-Printer Restart-Printer Shutdown-Printer Startup-Printer Promote-Job Schedule-Job-After CUPS-Accept-Jobs CUPS-Reject-Jobs&gt;AuthType DefaultRequire user @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit Cancel-Job CUPS-Authenticate-Job&gt;AuthType DefaultRequire user @OWNER @SYSTEMOrder deny,allow&lt;/Limit&gt;&lt;Limit All&gt;Order deny,allow&lt;/Limit&gt;&lt;/Policy&gt;BrowseWebIF Yes Create the startup script (/usr/local/etc/rc.d/run_cups.sh) for CUPS 12345678910111213141516#!/bin/sh # Allow time for devfs to initialize.sleep 5 # This will allow LPT(parallel port) printers.echo -e &quot;[system=10] \\nadd path &apos;unlpt*&apos; mode 0660 group cups\\nadd path &apos;ulpt*&apos; mode 0660 group cups\\nadd path &apos;lpt*&apos; mode 0660 group cups&quot; &gt; /etc/devfs.rules # Restart devfs so it can read new config./etc/rc.d/devfs restart # Allow time for devfs to initialize.sleep 5 # Now let&apos;s start CUPS!/usr/local/etc/rc.d/cupsd onestart Make the script executable 1`chmod 755 /usr/local/etc/rc.d/run_cups.sh` Add rule to devfs so CUPS print server can start on boot Add two lines to /etc/rc.conf 12cupsd_enable=&quot;YES&quot;devfs_system_ruleset=&quot;system&quot; Disable CUPS during reboot and shutdown Add the following command to “/etc/rc.reboot” and “/etc/rc.shutdown” before the line that says “# If PLATFORM is pfSense then remove” 1/usr/local/etc/rc.d/cupsd stop All set. Start CUPS now Reboot or use command: 1/usr/local/etc/rc.d/run_cups.sh Add printer to CUPS: Now open up your web browser and go to “http://Your pfSense address:631”. Printer driver:Foomatic: a database-driven system for integrating free software printer drivers with common spoolers under Unix. If you receive error “stopped with status 22”. Install foomatic-db + dependencies. 1pkg_add -r foomatic-db foomatic-filters hplip: HP drivers for DeskJet, OfficeJet, Photosmart, Business Inkjet and some LaserJet printer models, as well as a number of Brother printers. 1pkg_add -r hplip gutenprint: A collection of high quality drivers for Canon, Epson, Lexmark, Sony, Olympus, and PCL printers for use with GhostScript, CUPS, Foomatic, and the GIMP 1pkg_add -r gutenprint splix: Samsung drivers for SPL (Samsung Printer Language) printers. 1pkg_add -r splix Missing printer driver file PPD?Some printers’ PPD are available in http://www.openprinting.org/printers Troubleshooting: If you receive error: “Unable to create certificate file /var/run/cups/certs/0 - No such file or directory”, add the following command to the startup script. 1mkdir -r /var/run/cups/certs/ If you receive error: “cupsdReadClient: Unable to write 14 bytes to /var/spool/cups/00000005: Bad file descriptor”, add the following command to the startup script. 1mkdir -pv /var/spool/cups/ If your CUPS decided to detect printers as a /dev/ulpt1 /dev/ulpt0 instead of the correctly detected printer (with /dev/usb/0.2.* and /dev/usb/0.3.*), to enable printing with local printer you need to give group ‘cups’ r/w access to printer device: 1) Add following to /etc/devfs.rules (create if it doesn’t exist): 1234[system=10]add path &apos;unlpt*&apos; mode 0660 group cupsadd path &apos;ulpt*&apos; mode 0660 group cupsadd path &apos;lpt*&apos; mode 0660 group cups And following to /etc/rc.conf: 1devfs_system_ruleset=&quot;system&quot; Restart devfs: 1/etc/rc.d/devfs restart If your system supports ‘devd’ you can copy $PREFIX/share/examples/cups/lpt-cupsd.conf to $PREFIX/etc/devd/ To enable printing under Gimp and MS-Windows clients do the following: Uncomment application/octet-stream line in mime.types Uncomment application/octet-stream line in mime.convs Restart cupsd If you are using libusb, it is important that no device driver, e.g. ulpt(4) is attached to the device you wish to use. In this case please ensure the cups user and group has read/write access to /dev/ugen* If you are using a USB printer wtih FreeBSD 8.0 or later, you will need to find the proper /dev/usb/* device pointed at by the /dev/ugen* entry. Follow the instructions for devfs.rules as above, but append a rule similar to the following for a printer attached as /dev/ugen0.2: 1add path &apos;usb/0.2.*&apos; mode 0660 group cups","link":"/tech/installing-the-cups-print-server-to-pfsense-2-1-and-2-x/"},{"title":"iPhone's battery draining? Here's what you can do","text":"If you just upgraded your iPhone to a new version iOS system from the old version for example from iOS 10 to iOS 11 or iOS 9 to iOS 11, you may notice that your battery is draining twice as fast or more after the upgrade. Sometime system can be lagging too. You may heard that you can turn off some features to help the battery to stay longer. However, if a smart phone needs to turn off all the features, what is the point of having a smart phone right? Here is what you can do if you experience battery issue after upgraded. leave it alone! If you just finished the upgrade, let your new system reindex everything! It will take couple hours and use some battery, that is normal. hard restart with full battery Step 1, connect your phone to the charger and let it charge until 100% and hard reset your iPhone with the charger connecting using below methods. For iPhone 6/6S/6S+, press and hold the Home button. At the same time, press and hold the Power button until you see the Apple logo. For iPhone 7/7+, press and hold the Lock/Wake button. At the same time, press and hold down the Volume Down button until you see the Apple logo. For iPhone 8/8+, and iPhone X, press and quickly release the Volume Up button. Press and quickly release the Volume Down button Press and hold the Side button (power) until you see the Apple logo Step 2, after your iPhone restarted, continue charge for ~10 mins and you are good to go. reset you iPhone’s setting. You can find the reset option in  Setting &gt; General &gt; Reset &gt; Reset All Settings. All setting will be reset but your personal items like photos, musics, and other things will remain. Do NOT select Erase All Content and Setting  unless you want clean phone! revert back if you can. Revert back to the previous version and wait for Apple to release the newer version to fix the issue.","link":"/tech/iphones-battery-draining-heres-what-you-can-do/"},{"title":"Let Docker and UFW Firewall work together","text":"If you see your Docker container ports got exposed and bypassed all UFW rules, that is normal because Docker will manipulate iptables when creating container. Docker in default will work with iptables nicely without user creating complicated iptables rules. If you don’t want Docker creating iptables rules or you are using UFW, you need to propertly configure them to make then work nicely together. There are two ways to prevent Docker exposing itself with iptables. Prevent Docker from manipulating iptablesAccording to Docker’s guides, it is possible to set the iptables key to false in the Docker engine’s configuration file at /etc/docker/daemon.json You can achieve that by running below command 123sudo bash -c &apos;echo &quot;{\\&quot;iptables\\&quot;: false}&quot; &gt;&gt; /etc/docker/daemon.json&apos; Put Docker behind UFW Get your external interface name 1echo $(ip route get 8.8.8.8 | awk -- &apos;{printf $5}&apos;) Add the following to the end of /etc/ufw/after.rules. Replace eth0 with the interface name you got from previous step. Most common interface name is eth0 1234567891011121314151617181920212223242526272829# sudo nano /etc/ufw/after.rules# BEGIN UFW AND DOCKER*filter:ufw-user-forward - [0:0]:ufw-docker-logging-deny - [0:0]:DOCKER-USER - [0:0]-A DOCKER-USER -j ufw-user-forward-A DOCKER-USER -j RETURN -s 10.0.0.0/8-A DOCKER-USER -j RETURN -s 172.16.0.0/12-A DOCKER-USER -j RETURN -s 192.168.0.0/16-A DOCKER-USER -p udp -m udp --sport 53 --dport 1024:65535 -j RETURN-A DOCKER-USER -j ufw-docker-logging-deny -p tcp -m tcp --tcp-flags FIN,SYN,RST,ACK SYN -d 192.168.0.0/16-A DOCKER-USER -j ufw-docker-logging-deny -p tcp -m tcp --tcp-flags FIN,SYN,RST,ACK SYN -d 10.0.0.0/8-A DOCKER-USER -j ufw-docker-logging-deny -p tcp -m tcp --tcp-flags FIN,SYN,RST,ACK SYN -d 172.16.0.0/12-A DOCKER-USER -j ufw-docker-logging-deny -p udp -m udp --dport 0:32767 -d 192.168.0.0/16-A DOCKER-USER -j ufw-docker-logging-deny -p udp -m udp --dport 0:32767 -d 10.0.0.0/8-A DOCKER-USER -j ufw-docker-logging-deny -p udp -m udp --dport 0:32767 -d 172.16.0.0/12-A DOCKER-USER -j RETURN-A ufw-docker-logging-deny -m limit --limit 3/min --limit-burst 10 -j LOG --log-prefix &quot;[UFW DOCKER BLOCK] &quot;-A ufw-docker-logging-deny -j DROPCOMMIT# END UFW AND DOCKER Remove &quot;iptables&quot;: &quot;false&quot; from etc/docker/daemon.json Make sure DEFAULT_FORWARD_POLICY=&quot;DROP&quot; in /etc/default/ufw If you ever add any docker related rules to /etc/ufw/before.rules, remove them. Test before reboot Open ports based on your needed. You can allow port access to all containers or specific container. To allow public access to port 8080. 1sudo ufw route allow proto tcp from any to any port 8080 Allow public access to port 80 for container with private address 172.17.0.3 1ufw route allow proto tcp from any to 172.17.0.3 port 80 Allow DNS 1ufw route allow proto udp from any to any port 53","link":"/tech/let-docker-and-ufw-firewall-work-together/"},{"title":"Linksys smart router slow download issue fix","text":"If you experience slow download speed with Linksys smart router in Comcast network, you are encountering a bug in some Linksys smart routers. When it happen, ipv4 speed test will be slower than real speed. However, ipv6 is not throttled. Comcast speed test on ipv4 speed is always &lt; 20m. The cause is that IPv4 packets from the Comcast network are configured with DSCP 8, which Linksys smart routers will treat all package as low priority traffic and throttle their speed. ipv6 have correct DSCP so it is not affected. If you are facing this issue and using stock firmware, you can use the small fix below: reset Media Prioritization. In case you messed up any setting before. enable Media Prioritization. Add a New Application. Add a name and input port range 1 to 65535. Drag the new added name to the High Priority box and save. Test your speed again and you should see the speed back to normal.","link":"/tech/linksys-smart-router-slow-download-issue-fix/"},{"title":"MacOS Safari cannot install extension solution","text":"Some old MacOS user may notice that installing Safari extention is not working like before in new system. “Install now” is no longer exist, it was replaced by “Trust”. However, when click the “Trust” button to install external extension, extension will not be installed in to Safari. That has nothing to do with the extension compatible issue. This seems like a bug on the “Trust” button. Mouse click on the “Trust” button is ignored. However, there is a trick to get this work. We can use keyboard to confirm the installation. Before that, we need to enable the keyboard control access in Windows and dialogs. For OS X 10.11.* or maybe later version if bug still exist. Go to System Preferences &gt; Keyboard &gt; Shortcuts &gt; Full Keyboard Access, select “All controls”. Now we can press Tab key to move focus between button in Windows and dialogs. Now try to install Safari extension, when the dialog pop up, do not use mouse to click the “Trust” button since it will not work, use keyboard instead. Press the “tab” key to move the focus to “Trust” button and hit space or return. Extension will be installed.","link":"/tech/macos-safari-cannot-install-extension-solution/"},{"title":"macOS Sierra Asus Z87-A Clover Installation for Upgrade from El Capitan Or Fresh Install","text":"Instruction for how to prepare Clover USB system installation flash driver can be found from here: Install Mac OS X with clover EFI bootloader on ASUS Z87a Hardwares used in this instruction: Motherboard: Asus Z87-A motherboard (Get ASUS Z87-A motherboard from Amazon) CPU: I7 4770K CPU or any LGA1150 CPU (Get LGA1150 CPU from Amazon) Graphics Card: Integrated Graphics Processor (HD Graphics 4600) Sound Card: Integrated Realtek ALC892 Harddriver: SATA3 SSD Clover’s configuration and files from this guide will fit El Capitan and Sierra. You can directly upgrade from previous macOS to Sierra using this guide for Asus Z87-A motherboard or other similar Asus motherboards. What is working? CPU Power management/Sleep/Wake OK USB 3.0 OK USB 2.0 OK ALC892 Sound Card OK Graphic Card OK Almost everything What is not working? None macOS bug or Clover bug and fix? WiFi issue after wake from sleep? uncheck Disable Wake for network access from Energy Saver and restart No sound after wake from sleep? Install CodecCommander, download the latest version from here: https://bitbucket.org/RehabMan/os-x-eapd-codec-commander/downloads iMessage issue? Do you have 17 digit MLB# and Board Serial number? 15 digit Serial#? and SmUUID? Clover configuration download SSDT-XOSI.aml and ssdt.amland unzip to EFI/CLOVER/ACPI/patched download AppleALC.kext FakeSMC.kext RealtekRTL8111.kext USB_Series8_Injector.kext and unzip to EFI/CLOVER/kexts/Other download FSInject-64.efi HFSPlus.efi NTFS.efi OsxAptioFix2Drv-64.efi OsxFatBinaryDrv-64.efi and unzip to EFI/CLOVER/drivers64UEFI Delete other files in this folder. upgrade to macOS Sierra or do a fresh installation.","link":"/tech/macos-sierra-asus-z87-a-clover-installation-for-upgrade-from-el-capitan-or-fresh-install/"},{"title":"MacPassHTTP - keepasshttp plugin for Mac keepass","text":"This plugin is primarily intended for Macpass with PassIFox for Mozilla Firefox, chromeIPass for Google Chrome, or passafari for Mac Safari. KeePassHttp does’t not officially support Mac system just like Keepass doesn’t have a official native client for Mac. Since MacPass, this situation has changed and now MacOS people can use MacPass as native keepass application together with MacPassHTTP to get the similar experience like the Windows platform. Safari must install passafari extension in order to connect to MacPass or other keepkass application. Safari extension passafari download The latest version of MacPass can be download from MacPass Official Release. However, the official MacPass release does not include MacPassHTTP (keepasshttp support). It must be compile manually. Install/compile guide can be found MacPassHTTP. As of now, the last version of MacPass is 0.6.2. If you don’t want to go through the compile process, you can download the plugin from this post. MacPassHTTP.mpplugin The plugin has been tested for MacPass 0.6.2. Future version support is unknown. It should go to folder ~/Library/Application Support/MacPass/ You can open the folder from terminal and drag the plugin into the folder. 1open ~/Library/Application\\ Support/MacPass/ After that you should be able to see it on MacPass.","link":"/tech/macpasshttp-keepasshttp-plugin-for-mac-keepass/"},{"title":"Marking a directory as sources root equivalent in Visual Studio Code for Python","text":"In PyCharm you have that nice easy right click shortcut to mark a folder as sources root. But in VS code things you don’t have that simple setup. If you are coming from ModuleNotFoundError: No module named you should have known why you need this. You can easyliy resolved by adding below setting to the VS code settingss.json . Assume that the local modules that you are importing is from src folder. This has been tested with Conda env and unit test in terminal. Python language server is set to Pylance. All other setting remain untouched. 123456789&quot;terminal.integrated.env.osx&quot;: { &quot;PYTHONPATH&quot;: &quot;${workspaceFolder}/src&quot;,},&quot;terminal.integrated.env.linux&quot;: { &quot;PYTHONPATH&quot;: &quot;${workspaceFolder}/src&quot;,},&quot;terminal.integrated.env.windows&quot;: { &quot;PYTHONPATH&quot;: &quot;${workspaceFolder}/src&quot;,}, If you are calling the py file from terminal directly, you can also append the src path to PYTHONPATH so you won’t get import error. 1export PYTHONPATH=$PYTHONPATH:$(git rev-parse --show-toplevel)/src","link":"/tech/marking-a-folder-as-sources-root-equivalent-in-visual-studio-code-for-python/"},{"title":"Missing Forwards calls to Google Chat Option in Google Voice solution","text":"Forwards calls to Google Chat is an important option for people who are using Google Voice as free VOIP solution. In order to able to receive calling, forwards calls to Google Chat option must be activated so the VOIP adapter can acts as a Google Chat to receive calling, eg: OBi Devices. Without that, the phone will never ring when people call your Google Voice number. If the Google Voice Account was newly set up, in default the “Forwards calls to Google Chat” option is inactivated. Google didn’t provide any selectable option for adding the option to Google Voice. Here is how you can add Google Chat to the “Forwards calls to” list. Open Gmail using the same Google Voice account and call a phone number using the Google Hangouts feature on the lower left hand side. If the Forwards calls to Google Chat Option under “Phones” does not show after that, then click on the chat option and change to the old “Chat” feature to convert it back. Then dial a phone number and hang up. Now the “Forward to Google Chat” option should be available in Google Voice.","link":"/tech/missing-forwards-calls-to-google-chat-option-in-google-voice/"},{"title":"Native KeePass client for MAC OS X with KeePassHTTP - MacPass","text":"Keeps can be used via Mono on OS X but lack of important functionality and not work very well. MacPass is a KeePass compatible password manager for OS X. MacPass is free and open source. Unlike other KeePass for Mac alternatives, MacPass support KeePassHTTP. KeePassHTTP is a KeePass plugin that allows MacPass to connect with a browser extension like Passifox / ChromeIPass to automatically fill in ID and password details on web pages. KeePassHTTP is not available on the official release as of MacPass version 0.5. It will included in default after version 0.6. However, current version binaries already included KeePassHTTP and can be turn on when building your own MacPass. Download MacPass with KeePassHTTP When your extension makes a connection with your database, MacPass will display a confirmation dialog on screen. Hit “yes” to allow the connection between your extension and MacPass. SOURCE: Native OS X KeePass client http://mstarke.github.io/MacPass","link":"/tech/native-keepass-for-mac-os-x-with-keepasshttp-macpass/"},{"title":"No chain/target/match by that name iptables error","text":"iptables: No chain/target/match by that name. That is one of the common error message shows up when we trying a iptables’ rule in OpenVZ based VPS. If the chain and target are correct, it must be limited in kernel config. Problem description: Error message: iptables: No chain/target/match by that name. Run “iptables -L” and get: 12345678Chain INPUT (policy ACCEPT)target prot opt source destinationChain FORWARD (policy ACCEPT)target prot opt source destinationChain OUTPUT (policy ACCEPT)target prot opt source destination Make sure the kernel is the latest or almost the latest version. Run “lsmod” return blank: 1Module Size Used by Most likely the problem appear on an OpenVZ based VPS. As with all container-based virtualization, you are limited to the kernel modules provided by the host. If you add the rule that require a kernel modules isn’t virtualized, you will get the error: “No chain/target/match by that name”. Problem solution: To solve the problem, you can: submit a ticket to the host and request that they make the necessary kernel modules available to you. Most CS will happy to load the module for your VPS node. Use a VPS not based on containers but on full virtualization or paravirtualization, such as Xen, KVM or VMware. If you are using Xen, Kvm, or VM based VPS, try update your kernel and load the required module.","link":"/tech/no-chain-target-match-by-that-name-iptables-error/"},{"title":"Open PDF/A PDF file without read-only mode","text":"The file you have opened complies with the pdf/a standard and has been opened read-only. If you open a PDF/A standard PDF, in default you will not able to modify it because Adobe PDF reader or Acrobat will open it in view only mode. PDF/A is an ISO-standardized version of the Portable Document Format (PDF) specialized for use in the archiving and long-term preservation of electronic documents. PDF/A differs from PDF by prohibiting features ill-suited to long-term archiving, such as font linking (as opposed to font embedding) and encryption.[1] The ISO requirements for PDF/A file viewers include color management guidelines, support for embedded fonts, and a user interface for reading embedded annotations (From Wikipedia). PDF/A format is important and mainly for business use. It’s a format that ensures a PDF file can be reproduced exactly the same way because all necessary information for displaying the document is embedded in the file. It is safe, It is safer and securer for long run. Actually Adobe PDF reader or Acrobat have the option to turn off the PDF/A view only mode. How to open a PDF/A PDF file without read-only mode?Edit&gt;Preferences&gt;Documents&gt;PDF/A View mode. Set view documents in PDF/A mode to “never”. You can revert back to the default setting anytime you want to.","link":"/tech/open-pdfa-pdf-file-without-read-mode/"},{"title":"Open Source FREE Automatic Periodic Screen Capture Tool","text":"AutoScreenCap is a lightweight Open Source screen capture tool. It is a small software does like what its name describes: auto screen capture. It allows you to make screen shots periodically and automatically save to the folder in JPG format. It is fully customizable, the capture interval can be set from 1 second to 99999 and the JPG quality also adjustable. It can be set to auto hide the main windows and auto start screenshot capture for special purposes. Although the last update of this tool is back in 2012, this software still work fine in the latest Windows 8.1 64 bit. Click here to download the latest version AutoScreenCap It does not require installation. So basically extract the zip file to a folder and run AutoScreenCap.exe","link":"/tech/open-source-free-automatic-periodic-screen-capture-tool/"},{"title":"Opencart Admin Folder Rename with vQmod","text":"OpenCart is open source so the basic file structure is exposed. In order to secure OpenCart, the easiest way is rename the /admin/ folder to other phrase. Renaming OpenCart admin folder can prevent hackers who specifically looking for the admin folder of OpenCart break in into OpenCart. This tutorial is for OpenCart with vQmod installed. If you don’t have vQmod installed, simply rename the Admin folder will work. If you have vQmod installed, you will need some extra steps to make vQmod recognize your new Admin folder. For how install vQmod to OpenCart, follow this tutorial: Install vQmod to OpenCart updated all instances in your admin/config.php. Change xxx.com/admin/ to xxx.com/(your new admin folder name)/ in config.php. rename the admin folder. Simple rename the admin folder using the method that you prefer. edit vQmod’s configuration file. vQmod must already installed! Edit the file vqmod/install/index.php, change the name admin to match the name in previous steps. 12// CHANGE THIS IF YOU EDIT YOUR ADMIN FOLDER NAME$admin = &apos;admin&apos;; 2. Edit the file vqmod/pathReplaces.php. Add the following to the file after // START REPLACES // before // END REPLACES //. Change the admin123 to match the name in previous steps. 123// START REPLACES //$replaces[] = array(&apos;~^admin\\b~&apos;, &apos;admin123&apos;);// END REPLACES // clean the vQmod cache. Simply delete all files under vqmod/vqcache folder. You are all set. Don’t forget that once you do this, you’ll need to use the new path to access your admin dashboard.","link":"/tech/opencart-admin-folder-rename-with-vqmod/"},{"title":"Opencart Manual Installation Guide","text":"OpenCart is a free, open-source shopping cart. You can install OpenCart using cPanel by just one click, which will be much easier than manually installing it. However, in this tutorial, we will show you how to manually install OpenCart into your server. Before anything else, make sure your hosting meet the requirements listed below. PHP (at least 5.2) PHP Settings: Register Globals: Off Magic Quotes GPC: Off File Uploads: On Session Auto Start: Off Required PHP extensions: MySQL GD cURL mCrypt ZIP Database (MySQLi suggested) Curl enabled Download OpenCart from the OpenCart Downloads Page Create a MySQL database and assign a user to it. Assign the user ALL Privileges. The database information is needed for the installation process. OpenCart does not allow special characters in the database password field, be sure to NOT use any special characters in the password, only letters and numbers. Extract the “opencart-x.x.x.x” zipped file. Use your FTP or SFTP client to upload the extracted folders and files in the folder “upload” to your hosting. Make sure you have set the correct permissions on the opencart directories. For example, for Apache server, default user/group names are “apache”. To set the user/group permission in Linux, execute the command (Change the Path to match the location of the your store): 1chown apache:apache /var/www/store-path/* -R Visit the store’s home page use your browser. You are almost done! Follow the onscreen instructions. You’ll need to fill in the database name, database username, and password. You’ll also be setting up an adminstrator username and password as well. Delete the install directory after the installation is complete for security purposes","link":"/tech/opencart-manual-installation-guide/"},{"title":"Properly Delete Extra Partitions on USB Drive using DiskPart","text":"Windows does have a Disk Management tool for simple disk management operations. For USB drive or logical drive, if the drive already has more than one partition, Disk Management will not allow you manage extra partitions on removable storage devices, unless you deleted all of the partitions and make a new, full size partition. Disk Management will not provide delete volume option for extra partitions on USB drives if more than one partition is detected. How to combine two partitions or more into one and restore USB drive to it’s original state? To delete partitions on USB drive, you will need to use the command-line utility: Diskpart. Diskpart enhances the Disk Management graphical user interface (GUI). Below guide is for Windows systems only. For MacOS, you can have similar solution here Caution: When you use DiskPart to clean USB drive partition, all data on the USB will be erased. start a command prompt as an administrator (CMD) Click Start. In the Start Search box, type cmd, and then press CTRL+SHIFT+ENTER or right click choose “Run as administrator” If the User Account Control dialog box appears, confirm that the action it displays is what you want, and then click Continue. run DISKPART. At the command prompt, type: 1diskpart List all disk in DISKPART. At the DISKPART prompt, type: 1list disk Important! Make down the disk number of the disk from which you want to delete the partition. select your USB disk which you want to delete the partition. Replace the * with your disk number from step 3. At the DISKPART prompt, type: 1select disk* if you want to delete all partitions and create one full size partition, use the following command and go to step 10 below. At the DISKPART prompt, type: 1clean list all partitions on the drive. At the DISKPART prompt, type: 1list partition Make note of the number of the partition that you want to delete. select the partition you want to delete. Replace the * with your disk partition number from step 5. At the DISKPART prompt, type: 1select partition* delete partition. This command will delete the partition that you select from step 7. At the DISKPART prompt, type: 1delete partition repeat the step 6-8 if you need to delete other partitions. All delete partitions will be left as unallocated space. you can now use Disk Management to manage the drive now. If you want to create one full partition using DISKPART, use the following command. At the DISKPART prompt, type: 1create partition primary Step X. After all done, exit DISPART. 1exit","link":"/tech/properly-delete-a-partition-on-usb-drive-using-diskpart/"},{"title":"Raspberry Pi Model B+ (July 2014) VS Model B","text":"After two years since Raspberry Pi Model B was launched, the Raspberry Pi foundation has just released a new version of their popular Model B board: Raspberry Pi Model B+. Raspberry Pi Model B+ contains numerous small improvements. Technical Specifications of Raspberry Pi Model B+: Chip: 700MHz Broadcom BCM2835 CPU CPU: 700 MHz Low Power ARM1176JZ-F Applications Processor GPU: Dual Core VideoCore IV® Multimedia Co-Processor RAM: 512MB Power: micro usbMicro USB power supply connection 5V via micro USB, or power via GPIO heade Ethernet: Onboard 10/100 Ethernet RJ45 jack Dimensions: 85mm x 56mm (Roughly 3 1/2” x 2 1/4”) Here is the list of notable changes in Raspberry Pi Model B+: USB Ports Model B: dual usb2 Model B+: quad usb4 (the B+ comes with double the USB ports) GPIO pins Model B: 26 Model B+: 40 (Build even bigger and better projects with additional inputs and outputs) SD Card Model B: sd cardSD Card Model B+: micro sd card Micro SD (The smaller SD card no longer protrudes from board, contributing to an all around better form factor) Audio Output Model B: 2 pole 3.5mm Model B+: 4 pole 3.5mm (Send audio and composite video through one output) Display Output Model B: HDMI, DSI Display Port, Composite RCA Model B+: HDMI, DSI Display Port, 4 pole 3.5mm (Combining the composite output from RCA into the 4 pole connector allows the necessary space for GPIO expansion) Power Consumption Model B: 750mA Model B+: 600mA (Less power usage all around - measured at idle) Mounting Model B: 2 holes Model B+: 4 holes (Additional evenly distributed mounting holes make for a sturdier project)","link":"/tech/raspberry-pi-model-b-plus-july-2014-vs-model-b/"},{"title":"React Native Screens swipe flickering or white edge in dark mode fix","text":"react-native-screens with enableScreens() can reduce app memory usage and prevent your heavy stacked app slowing down since it bring native navigation component to React Native app. One of the issue when using react-native-screens and enableScreens() setup is it intrucded a flickering bug when swipe or switch screen. It may not be noticeable without dark mode enabled. If you have dark mode, swipe slowly and will see a white edge at some point. Some version of react-native-screens do not have this issue, but the bug seems come and go in multiple versions. Remove enableScreens() will resolve the issue, but you will lose the benefit of enableScreens() that help in app memory usage. Before react-native-screens officially fixed the issue completely, we can resolve the flicker/white edge issue with enableScreens() . Add below code to your screenOptions in Stack and you will you are all set. 1234567&lt;Stack.Navigator screenOptions={({ navigation }) =&gt; { return { detachPreviousScreen: !navigation.isFocused(), } }}&gt;","link":"/tech/react-native-screens-swipe-flickering-or-white-edge-in-dark-mode-fix/"},{"title":"Patch Bash NOW, Linux, UNIX, Mac OS X Bash Shellshock Code Injection Vulnerability","text":"One critical security hole exist in Unix/Linux based system just got uncovered today. Bash is a Unix shell written by Brian Fox for the GNU Project as a free software replacement for the Bourne shell (sh). A security bug in Bash, could create a bigger threat to computer users than the “Heartbleed” bug in OpenSSL. For many Unix or Linux personal computer, this might not be a really big issue. For Unix or Linux based Web servers, it’s a critical problem. Most of the servers are using Linux system. “Shellshock” Bug detail: CVE-2014-6271 remote code execution through bash which allows unauthorized disclosure of information, unauthorized modification, and allows disruption of service. Vulnerability mostly is exploitable over the network. HTTP requests to CGI scripts have been identified as the major attack vector so far. How to fix/patch Bash? Ubuntu/Debian 1apt-get update &amp;&amp; sudo apt-get upgrade or if you just want to update bash: 1apt-get update &amp;&amp; sudo apt-get install --only-upgrade bash CentOS 1yum update or if you just want to update bash: 1yum update bash Mac OS For Mac OS users, Apple says most Mac users are safe from ‘Shellshock’ Bash bug. “With OS X, systems are safe by default and not exposed to remote exploits of bash unless users configure advanced Unix services.” -Apple said Apple released OS X bash Update 1.0 for OS X Lion v10.7.5, OS X Lion Server v10.7.5, OS X Mountain Lion v10.8.5, OS X Mavericks v10.9.5 on Sept 29 to patch “Shellshock” Bash bug in OS X. This is the latest patch from Apple, however, some security researchers found out that fix is incomplete. If you are a Mac users with advanced Unix services set up, check out Apple’s security updates list regularly for further fix. Download OS X bash Update 1.0 for Mavericks Download OS X bash Update 1.0 for Mountain Lion Download OS X bash Update 1.0 for Lion. If you’re running bash from Homebrew you can get a patched version by running: 12brew updatebrew upgrade bash If you’re running bash from MacPorts: 12sudo port self updatesudo port upgrade bash","link":"/tech/patch-bash-code-injection-vulnerability/"},{"title":"Rename network name for MAC OS X","text":"Network name is the unique name that differentiate a MAC or PC on a network. If you have more than one MAC and you start sharing things back and forth between your computers, the names of those MACs start to matter. On Mac OS X, changing computer name is extremely easy. How to change it? Just open up System Preferences, go to Sharing, and change the computer name. You may need to change the name under your Network setting also. Open Network (next to Sharing), Advanced, WINS, and change the NetBIOS name. Done!","link":"/tech/rename-network-name-for-mac-os-x/"},{"title":"Resetting the Hosts File to Microsoft Defaults in Windows 8/7/Vista/XP","text":"To reset the Hosts file back to the default in Windows 8/7/Vista/XP, follow these steps, as appropriate for the operating system that you are running. Navigate to c:\\Windows\\System32\\drivers\\etc or press Windows key + R and type in 1%WinDir%\\System32\\Drivers\\Etc into the “RUN” box where you can type commands to either pull up a program or go online. Rename the Hosts file “hosts” to “Hosts.old”. Create a new default hosts file: Right-click an open space in the Windows\\System32\\Drivers\\Etc folder, point to New, click Text Document. Enter “hosts“ for the filename, press Enter. Click Yes to confirm that the file name extension will not be .txt. Open the new Hosts file in a text editor, such as Notepad. Copy the following text to the file: Windows XP 123456789101112131415161718# Copyright (c) 1993-1999 Microsoft Corp.## This is a sample HOSTS file used by Microsoft TCP/IP for Windows.## This file contains the mappings of IP addresses to host names. Each# entry should be kept on an individual line. The IP address should# be placed in the first column followed by the corresponding host name.# The IP address and the host name should be separated by at least one# space.## Additionally, comments (such as these) may be inserted on individual# lines or following the machine name denoted by a &apos;#&apos; symbol.## For example:## 102.54.94.97 rhino.acme.com # source server# 38.25.63.10 x.acme.com # x client host127.0.0.1 localhost Windows Vista 12345678910111213141516171819# Copyright (c) 1993-2006 Microsoft Corp.## This is a sample HOSTS file used by Microsoft TCP/IP for Windows.## This file contains the mappings of IP addresses to host names. Each# entry should be kept on an individual line. The IP address should# be placed in the first column followed by the corresponding host name.# The IP address and the host name should be separated by at least one# space.## Additionally, comments (such as these) may be inserted on individual# lines or following the machine name denoted by a &apos;#&apos; symbol.## For example:## 102.54.94.97 rhino.acme.com # source server# 38.25.63.10 x.acme.com # x client host127.0.0.1 localhost::1 localhost Windows 7 and Windows 8 1234567891011121314151617181920# Copyright (c) 1993-2006 Microsoft Corp.## This is a sample HOSTS file used by Microsoft TCP/IP for Windows.## This file contains the mappings of IP addresses to host names. Each# entry should be kept on an individual line. The IP address should# be placed in the first column followed by the corresponding host name.# The IP address and the host name should be separated by at least one# space.## Additionally, comments (such as these) may be inserted on individual# lines or following the machine name denoted by a &apos;#&apos; symbol.## For example:## 102.54.94.97 rhino.acme.com # source server# 38.25.63.10 x.acme.com # x client host# localhost name resolution is handle within DNS itself.# 127.0.0.1 localhost# ::1 localhost This article also applies to: Windows 7 Enterprise Windows 7 Home Basic Windows 7 Home Premium Windows 7 Professional Windows 7 Starter Windows 7 Ultimate Windows Vista Enterprise 64-bit Edition Windows Vista Home Basic 64-bit Edition Windows Vista Home Premium 64-bit Edition Windows Vista Ultimate 64-bit Edition Windows Vista Business Windows Vista Business 64-bit Edition Windows Vista Enterprise Windows Vista Home Basic Windows Vista Home Premium Windows Vista Starter Windows Vista Ultimate Microsoft Windows XP Home Edition Microsoft Windows XP Professional Microsoft Windows Server 2003, Web Edition Microsoft Windows Server 2003, Enterprise x64 Edition Microsoft Windows Server 2003, Enterprise Edition (32-bit x86) Microsoft Windows Server 2003, Standard x64 Edition Microsoft Windows Server 2003, Standard Edition (32-bit x86) Windows Server 2008 Datacenter Windows Server 2008 Enterprise Windows Server 2008 Standard Windows 8 Windows 8 Pro Windows 8 Enterprise","link":"/tech/resetting-hosts-file-to-microsoft-defaults-in-windows-8-7-vista-xp/"},{"title":"Resolve overheating issues on Linksys EA6300 EA6350 EA6400 EA6700 or similar routers","text":"Linksys smart WiFi routers like EA6300 EA6350 EA6400 EA6700 or other similar design routers usually heat up very fast and have high temperature issue. CPU temperature usually stay over 90°c after short run even idle. Although Broadcom chips are said to have an operating rating up to 130°c, it is not recommend to let routers that run 24/7 stay in high temperature since it will shorten its lifespan. Some consumer routers are designed to fail within a certain period of time, but we can make some tweak to make it stay longer. Here are two options to resolve the overheat issue: Option 1, add a fan to the router. It will cool down the router to around 60c without without any other steps being taken. Not recommended because adding a fan will also add noise and space. If you have issue following option 2, do option 1. Option 2, replace factory thermal pad with thermal paste plus additional steps explained below. Linksys use heatsink on routers’ CPU. However, some people report that the heatsink is not contacting verywell with the CPU. We unscrewed the heatsink from EA6400 and found that the CPU has only about 1/3 area contacting with the heatsink based on the footprint on the 1mm thermal pad attached to the heatsink. If the heatsink was well contacted with CPU, we would see a square visible of place of contact. because there is a large gap between the heatsink and the CPU so even Linksys add 1mm thermal pad it still have some space left. CPU in picture left labeled The chip next to the CPU should be the RAM by Hynix labeled Note: RAM in default has not contact with heatsink at all. Below are what we need (you can get all of them from Amazon): 1. Arctic Silver 5 High-Density Polysynthetic Silver Thermal Compound, 3.5 Grams 2. Vktech® Heatsink Copper Shim Thermal Pads for Laptop GPU CPU VGA 30Pcs 15mmx15mm K5 PRO viscous thermal paste for thermal pad replacement 20g (Apple iMac, Sony PS4 &amp; PS3, XBOX, Acer Aspire etc) Step 1, remove the screws to under the feet of the router. Use plastic tool like credit card, open from two sides first and remove the cover. Unscrew the heatsink. Step 2, remove the thermal pad. Clean the heatsink and CPU and RAM surface. Because the thermal pad has less thermal conductivity compare to others so we remove it. Step 3, apply Arctic Silver 5 High-Density Polysynthetic Silver Thermal Compound to CPU surface. Note: because there is a gap between the heatsink and CPU plus we removed the thermal pad. We need to add some high to the make sure CPU and heatsink are well contacted. Step 4, place one clean Copper Shim Thermal Pad to the CPU surface on top of the Arctic Silver 5. Apply Arctic Silver 5 High-Density Polysynthetic Silver Thermal Compound to other side of the Copper Shim Thermal Pad. Cooper Shim Thermal Pad has better thermal conductivity than the aluminum heatsink, so this will also help to spread the heat from CPU to heatsink since the contact area is increased. So here is how the heat flow now: CPU - Arctic Silver 5 - Cooper Shim Thermal Pad - Arctic Silver 5 - heatsink Step 5, Arctic Silver 5 High-Density Polysynthetic Silver Thermal Compound to RAM surface. Step 6, place one clean Copper Shim Thermal Pad the RAM surface on top of the Arctic Silver 5. Apply LARGE amount of K5 PRO viscous thermal paste to other side of the Copper Shim Thermal Pad. Because the RAM surface is lower than the CPU, so we use K5 PRO viscous thermal paste to add more high to the make sure the RAM’s heat will flow to the heatsink. Arctic Silver 5 has better thermal conductivity than K5 PRO but Arctic Silver 5 is more liquid like. K5 PRO is better in filling the GAP between RAM and heatsink. So here is how the heat flow now: RAM - Arctic Silver 5 - Cooper Shim Thermal Pad - K5 PRO viscous thermal paste - heatsink Step 7, re-install the heatsink and put everything back to normal. All done. Plus in the router and let it with normal load for couple hours. Temperature will slowly increase from ~40°c to 70°c and become stay around 71°c to 73°c. Compared to the CPU’s temperature of around 90°c this is a great result. If you need the temperature lower than this, now you can consider option 1 and add a mini fan like the below one. You can click the image to get it from Amazon too.","link":"/tech/resolve-overheating-issues-on-linksys-ea6300-ea6350-ea6400-ea6700-or-similar-routers/"},{"title":"Ricoh SP C250DN C252DN PPD CUPS driver for LINUX and macOS","text":"C250DN or C252DN can be driven by setting PCL6 and use CUPS+Gutenprint driver. However, if we use Generic driver, it will not print out color. Ricoh does not have dedicate PPD driver for Linux platforms like Ubuntu or Debian for SP C250DN and C252DN color printers. However, Ricoh does have driver for MacOS which in fact is a PPD driver. It comes with a PPD installer for MacOS and it will copy to the PPD to MacOS’s CUPS driver folder. We can use this PPD for Linux CUPS setup. With the driver, we can also make Air Print server to make this printer even more valuable if you have Apple devices all around your house. Download RICOH C250DN C252DN PPD Driver Both PPDs has been tested in macOS high sierra, and also in AirPrint setup using Debian and CUPS, print, color and alignment all work perfectly.","link":"/tech/ricoh-sp-c250dn-c252dn-ppd-cups-driver-for-linux-macos/"},{"title":"Rotate Apache logs on a daily basis using rotatelogs","text":"If you Apache to start a new log file every day automatically, rotatelogs is the simple way to do it. Rotatelogs is a simple program for use in conjunction with Apache’s piped logfile feature. It supports rotation based on a time interval or maximum size of the log. The use of rotatelogs is actually quite simple. Search your httpd.conf and replace the following line 1CustomLog logs/access_log combined to 1CustomLog &quot;/usr/sbin/rotatelogs /var/log/httpd/access_log.%Y-%m-%d 86400&quot; combined 86400 (= 60 * 60 * 24) which causes a new log file each day at midnight The rotatelogs in default record log using GMT time. If your system is using local time rather than GMT, you need to add -l option. 1CustomLog &quot;/usr/sbin/rotatelogs -l /var/log/httpd/access_log.%Y-%m-%d 86400&quot; combined Now check if the syntax is OK and give Apache a graceful. Run the command below to check the configuration syntax. 123/usr/sbin/apachectl configtestSyntax OK Graceful restart. The apachectl graceful command tells Apache that you want to restart the server gracefully without aborting any open connections. It automatically checks the configuration files before initiating the restart to make sure Apache doesn’t die. 1/usr/sbin/apachectl graceful If apachectl graceful doesn’t restart your server, there are a few other things you can try. apachectl restart to restart the server. If the server is not running it is started. This command also runs a configuration test to make sure Apache won’t die when it restarts. apachectl stop to stop the Apache server apachectl start to start the Apache server (will throw an error message if Apache is running) apachectl configtest to test the configuration file syntax.","link":"/tech/rotate-apache-logs-on-daily-basis-using-rotatelogs/"},{"title":"Set custom DNS servers on Linux with resolv.conf","text":"resolv.conf is the configuration file for DNS resolvers for all Linux distributions, including Debian, Mint, Ubuntu, RedHat, CentOS, etc. Usually we change the DNS resolvers list by editing resolv.conf. However, depends on your dhcp client configuration, resolv.conf may be rewrite after reboot. Without deep Linux experience, setting customs DNS servers on Linux maybe time consuming. But one thing we can do is make /etc/resolv.conf immutable to other program after you changed it. This will be the easier setup with no side effects on system. Change the DNS serverBelow example we will set DNS resolver to 1.1.1.1. (1.1.1.1 is a privacy-first consumer DNS service provided by Cloudflare.) 1sudo echo &apos;nameserver 1.1.1.1&apos; &gt; /etc/resolv.conf Run the chattr +i command to sets the immutable filesystem attribute on resolv.conf, so it can’t be modified any anyone else. 1sudo chattr +i /etc/resolv.conf Reboot your system and test if your change to DNS server succeed. You can test it via DNS leak test. If you want to make change to resolv.conf again, you need to remove the attribute. 1sudo chattr -i /etc/resolv.conf Some free public DNS server list:Google Public DNS 8.8.8.8 / 2001:4860:4860::8888 8.8.4.4 / 2001:4860:4860::8844 OpenDNS 208.67.222.222 / 2620:0:ccc::2 208.67.220.220 / 2620:0:ccd::2 Comodo Secure DNS 8.26.56.26 8.20.247.20 Norton ConnectSafe 199.85.126.10 199.85.127.10 Level 3: 209.244.0.3 209.244.0.4 Verisign Public DNS 64.6.64.6 64.6.65.6 DNS.WATCH 84.200.69.80 84.200.70.40 2001:1608:10:25::1c04:b12f 2001:1608:10:25::9249:d69b AdGuard Default 176.103.130.130 176.103.130.131 2a00:5a60::ad1:0ff 2a00:5a60::ad2:0ff Family protection 176.103.130.132 176.103.130.134 2a00:5a60::bad1:0ff 2a00:5a60::bad2:0ff Quad9 9.9.9.9 9.9.9.10 2620:fe::fe 2620:fe::10 Cloudflare DNS Resolver 1.1.1.1 1.0.0.1 2606:4700:4700::1111 2606:4700:4700::1001 CleanBrowsing Family Filter 185.228.168.168 185.228.168.169 2a0d:2a00:1:: 2a0d:2a00:2::","link":"/tech/set-custom-dns-server-on-linux-resolv-conf/"},{"title":"Set up your Raspberry Pi for the first time","text":"The Raspberry Pi is a credit-card-sized single-board computer use Linux-kernel based operating systems. Debian GNU/Linux, Iceweasel, Calligra Suite and Python are planned to be bundled with the Raspberry Pi. The Raspberry Pi is powerful and inexpensive, allowing you to create a home media center, internet radio, or even your own VPN server on the cheap. To set up your Raspberry Pi you will need: A Raspberry Pi: HDMI to HDMI / DVI lead or RCA video lead. SD card: Minimum size 4Gb class 4 (the class indicates how fast the card is). We recommend using branded SD cards as they are more reliable. A standard USB keyboard and mouse. An ethernet cable: Networking is optional, although it makes updating and getting new software for your Raspberry Pi much easier. Power adapter: A good quality, micro USB power supply that can provide at least 700mA at 5V is essential. Preparing your SD card for the Raspberry Pi: In order to use your Raspberry Pi, you will need to install an Operating System (OS) onto an SD card. An Operating System is the set of basic programs and utilities that allow your computer to run; examples include Windows on a PC or OS X on a Mac. Full instructions can be found in Raspberry Pi’s quick start guide, but in summary you will need to: 1. Insert an SD card that is 4GB or greater in size into your computer 2. Format the SD card so that the Pi can read it a. Windows a1. Download the SD Association’s Formatting Tool from https://www.sdcard.org/downloads/formatter_4/eula_windows/ (The built in Windows formatting tool will only format the first partition that Windows can read not the entire disk. For this reason we advise using the official SD Card Association Formatting Tool.) a2. Install and run the Formatting Tool on your machine a3. Set “FORMAT SIZE ADJUSTMENT” option to “ON” in the “Options” menu a4. Check that the SD card you inserted matches the one selected by the Tool a5. Click the “Format” button b. Mac b1. Download the SD Association’s Formatting Tool from https://www.sdcard.org/downloads/formatter_4/eula_mac/ b2. Install and run the Formatting Tool on your machine b3. Select “Overwrite Format” b4. Check that the SD card you inserted matches the one selected by the Tool b5. Click the “Format” button c. Linux c1. We recommend using gparted (or the command line version parted) c2. Format the entire disk as FAT 3. Download the New Out Of Box Software (NOOBS) from: http://downloads.raspberrypi.org/noobs 4. Unzip the downloaded file a. Windows Right click on the file and choose “Extract all” b. Mac Double tap on the file c. Linux Run unzip [downloaded filename] 5. Copy the extracted files onto the SD card that you just formatted 6. Insert the SD card into your Pi and connect the power supply Your Pi will now boot into NOOBS and should display a list of operating systems that you can choose to install. If your display remains blank, you should select the correct output mode for your display by pressing one of the following number keys on your keyboard; HDMI mode this is the default display mode. HDMI safe mode select this mode if you are using the HDMI connector and cannot see anything on screen when the Pi has booted. Composite PAL mode select either this mode or composite NTSC mode if you are using the composite RCA video connector Composite NTSC mode","link":"/tech/set-up-your-raspberry-pi-for-the-first-time/"},{"title":"Setup log rotation for Apache access logs error logs using cronolog","text":"If you want Apache log file to be saved on daily basis automatically. Cronolog is one of the best way to do it. Although Apache itself has rotatelogs for rotating activities, rotatelogs are not really creating log file everyday based on the calendar date. Rotatelogs creates and saves log files based on the rotation time or file size limits. For example we set up rotatelogs to rotate logs every 86400 seconds, technically is 24 hours, the start time is whenever you start ratatelogs, not from 00:00:00AM as what people normally assume. For how to setup rotatelogs, you can follow the instruction here: Rotate Apache logs on a daily basis using rotatelogs Cronolog is a simple filter program that reads log file entries from standard input and writes each entry to the output file specified by a filename template and the current date and time. cronolog is intended to be used in conjunction with a Web server, such as Apache, to split the access log into daily or monthly logs. If you want your log files start from 0:00 to the exact end of a day 23:59, cronolog can handle that. 1. Install Cronolog. For Debian, Ubuntu, or Linux distributions using apt-get 1apt-get install cronolog For CentOS 1yum install cronolog 2. Modify Apache’s configuration file. For access logs, replace the following line 1CustomLog logs/access_log combined to 1CustomLog &quot;cronolog /var/log/httpd/access_log.%Y-%m-%d&quot; combined For error logs, replace the following line 1ErrorLog logs/error_log to 1ErrorLog &quot;cronolog /var/log/httpd/error_log.%Y-%m-%d&quot; 3. Check configuration syntax. Run the command below to check the configuration syntax. 123/usr/sbin/apachectl configtestSyntax OK 4. Restart Apache. The apachectl graceful command tells Apache that you want to restart the server gracefully without aborting any open connections. It automatically checks the configuration files before initiating the restart to make sure Apache doesn’t die. 1/usr/sbin/apachectl graceful If apachectl graceful doesn’t restart your server, there are a few other things you can try. apachectl restart to restart the server. If the server is not running it is started. This command also runs a configuration test to make sure Apache won’t die when it restarts. apachectl stop to stop the Apache server apachectl start to start the Apache server (will throw an error message if Apache is running) apachectl configtest to test the configuration file syntax. For cronolog usage details, click here.","link":"/tech/setup-log-rotation-for-apache-access-logs-error-logs-using-cronolog/"},{"title":"Protect your WordPress from Automated Comment Spam and Brute Force Login Attack","text":"Is your WordPress flooded with spam comment or being attacked by brute force login attempt? Thinking about spam blocking plugin? There are a lot of plug in can help you stop spam comment. You will notice it put thousands spam comments into spam folder after a while. Those Anti-Spam did a great job stopping spam comment show up in our post. There is some drawbacks for that kind of plugin. First,spam comments will be processed and store in your database before it gets deleted manually or automatically. Second, plugin like Akismet Anti-Spam will add a java-script to your site. If your site has limited resources, these kind of activities will drag down your site’s performance. If you use captcha plugin, you will also interrupt user’s experience. If you are looking for a light way to block the spam bot before the comment get posted. Yes, we have one. We can block the spam bot and also protect your login page at the same time, Spam bots’ comments will not even reach the server. Unless you got hit with spam from real human. This method is almost perfect and very light to your server. It has no captcha, no moderation queues, no complicate settings page, and 99.99% filter rate. This idea is inspired by this Stop Automated Comment Spam on WordPress with Nginx. How this work? Most spam bot will not process contents from server, including js and cookies. Their job is to get the comment form and post. So we can use java-script and cookies to block spam bot when they try to post any word. When post is viewed, browser will set a small cookie named _pass into viewer’s system. If viewer attempted to post a comment, Nginx or Apache will check if they have that cookie in their system. Comment will go through if cookie found. Otherwise, it will shows 403 to block the access. Since the cookie is set no matter viewer is attempt to leave comment or not, we can use the same cookie to prevent brute force login attack. Most spam bot and attack tools are not able to store cookie so the same theory work for both. What you need? Access to server’s configuration file. (Nginx or Apache’s config file) Ability to change something. add code to set cookie. You can add below code via Code Snippets or directly to theme’s function.php file. For HTTPS: 1234function set_post_cookie() {echo &apos;&lt;script&gt;document.cookie = &quot;_pass=1; max-age=43200; path=/; secure&quot;;&lt;/script&gt;&apos; . &quot;n&quot;; }add_action( &apos;comment_form&apos;, &apos;set_post_cookie&apos;, 100 ); This will set a cookie “human” and value is “1”. You can change the cookie name and value to whatever you want. If you use HTTP, remove the the work secure from above code. add below code to check and block spam bot with Nginx/Apache For NGINX: 123456#Stop Automated Comment Spam and log in attempt with Nginxif ($request_uri ~* /wp.comments.post.php/wp-login.php) { set $block_flag 1; }if ($http_cookie ~* _pass) { set $block_flag 0; }if ($block_flag) { return 403; } For Apache: 1234RewriteCond %{REQUEST_URI} ^/wp.comments.post.php?$ [OR]RewriteCond %{REQUEST_URI} ^(.*)?wp-login\\.php(.*)$RewriteCond %{HTTP_COOKIE} !_passRewriteRule ^forbid/(.*)$ - [F] reset the cookie for failed login attempt Every time incorrect login attempted cookie will be remove to prevent brute force login attack. Add below codes to functions.php of your theme 12345678function no_wordpress_errors(){echo &apos;&lt;script&gt;document.cookie = &quot;_pass=; expires=Thu, 01 Jan 1970 00:00:00 UTC; path=/; secure&quot;;&lt;/script&gt;&apos; . &quot;&quot;;$ip=$_SERVER[&apos;REMOTE_ADDR&apos;];$message = &quot;Your are blocked. IP address $ip&quot;;return $message;}add_filter( &apos;login_errors&apos;, &apos;no_wordpress_errors&apos;); JavaScript must be turned on and browser must accept cookie for this system to work.Remember! Next time when you try to login your admin page, open a post first so you will have the cookie and will not be blocked by this.","link":"/tech/stop-automated-comment-spam-brute-force-login-attack/"},{"title":"Try out Free New iOS Public Beta Update Without an Invite","text":"Apple has launched the iOS public beta program which allowing anyone in a trial scheme to use the new iOS. This DOES NOT require your iOS device to be jailbroken and you DO NOT need to add your iOS device’s UDID to an Apple Developer Account. Install Beta version iOS DOES NOT void the warranty, but apps and services may not work the same because it is BETA! The benefits of using Beta version iOS are you are getting latest iOS, bug fix, and improvements. You can sign up for Apple’s Beta Software program by visiting Appleseed Beta testing site. However, you may not allow to use the iOS beta because it is invite based. You will have to wait to be selected. Once you are invited, you will have to option to download a iOS Beta Software Profile. After you install the profile into your iOS device, you will see the new version update available. If you don’t want to signup for beta program, don’t want the long wait for the invite, want a simple step to get beta iOS, following the step below. First, use the iOS device that you want to install iOS Public Beta to visit this page (important!). Second, download and install the Mobile Config profile on your iOS Device using Safari. (This profile is from Apple Beta program and it is signed by Apple.) Third, once the profile is installed restart your iOS device. Lastly, go to Settings &gt; General &gt; Software Updates. You should now see the iOS Update available. What the profile mainly do is changes the URL of the XML file your device downloads when it checks for updates. The profile will automatically remove itself on April 1, 2016 at 07:15:00 GMT. You will get all available beta before then (including iOS 9). You can also remove the profile yourself by going to Settings &gt; General &gt; Profile. Oct 15, 2017: Removed iOS Mobile Config Profile. You can download from Apple for free without invitation now.","link":"/tech/try-our-free-new-ios-public-beta-update-without-an-invite/"},{"title":"Ubuntu port 53 already in use. How to free the DNS port","text":"Don’t be suprised when you see Ubuntu is complaining port 53 is not avaiable. Most people won’t encounter this issue unless you are doing things with DNS. In default, port 53 is reserved by systemd-resolved If you see errors like below and you have not done anything to use the DNS port. You are most likely affected by systemd-resol failed to create listening socket for port 53: Address already in use [fail] Error starting userland proxy: listen tcp4 0.0.0.0:53: bind: address already in use You can confirm if you are affect by systemd-resol by checking listening ports and applications. 1sudo netstat -tulpn | grep LISTEN systemd-resol is listening on port 53. 123tcp 0 0 127.0.0.53:53 0.0.0.0:* LISTEN 18447/systemd-resol tcp 0 0 0.0.0.0:22 0.0.0.0:* LISTEN 18411/sshd: /usr/sb tcp6 0 0 :::22 :::* LISTEN 18411/sshd: /usr/sb systemd-resolved is a system service that provides network name resolution to local applications. It implements a caching and validating DNS/DNSSEC stub resolver, as well as an LLMNR resolver and responder. To stop systems-resolved using port 53 is easy Edit /etc/systemd/resolved.conf set DNSStubListener to no1sudo nano /etc/systemd/resolved.conf Your resolved.conf will looks like below. You can set DNS=8.8.8.8 to whatever DNS server you want the system to use. Without it your system won’t able to resolve any domain. 1234567891011[Resolve]DNS=8.8.8.8#FallbackDNS=#Domains=#LLMNR=no#MulticastDNS=no#DNSSEC=no#DNSOverTLS=no#Cache=no-negativeDNSStubListener=no #ReadEtcHosts=yes Create a symbolic link for /run/systemd/resolve/resolv.conf with /etc/resolv.conf1sudo ln -sf /run/systemd/resolve/resolv.conf /etc/resolv.conf This command remove existing /etc/resolv.conf if it exist and create a symbolic link Reboot your system.","link":"/tech/ubuntu-port-53-already-in-use-how-to-free-the-dns-port/"},{"title":"Use Google Drive as Your Free Website's Uptime Monitor","text":"Most webmasters use “free” website monitoring services to track the downtime and uptime of their sites. These free service normally offer one domain monitoring service and often required to upgrade to the premium version for unlimited domain monitoring. Some feature like email or SMS alerts require premium version. Now, via Google Drive Spreadsheet, you can monitor the status your websites freely with out paying for any commercial services. You can track and monitor unlimited number of websites and get alerts from email or SMS. This Google Scripts based website monitoring tool is absolutely FREE as well. The setup only takes free minute. After you configured, Google Drive will monitor the uptime /downtime of your website(s) continuously and automatically. How is how to: Sign-in to your Google account and then click here to copy this Google sheet into your Google Drive. You can copy to as many Google account as you want. Put your website URLs in cell B2 (comma separated) and your email address in cell B3. If you wish to receive alerts by text messages, put Yes in cell B4. You’ll find a new Website Monitor menu in your Google Sheets toolbar. Click Initialize and you’ll get a pop-up asking for authorization. Grant the necessary access. Go to the Website Monitor menu again and choose “Start Website Monitor” to begin the monitoring process. Close the Google Sheet. How does this Google Drive Scripts based website monitor works? There’s a simple Google Script attached to the Google spreadsheet that does the monitoring. The script triggers every 5 minutes (in default) and then tries to fetch your website using URLFetchApp.fetch (a Google function similar to wget or curl). If the HTTP response code is anything other than 200, it indicates that there’s an issue with the underlying website. The spreadsheet will record whenever your website(s) is up or down. You will receive an email and/or SMS when your website(s) is/are down or up. How does the SMS alerts works? The SMS alerts are Sent via Google Google Apps Script will creates an event in your Google Calendar but with an SMS reminder. the event is set to expire in 30 seconds and thus you get an instant text alert on your mobile. If you aren’t getting text alerts on your phone, please ensure that your phone number is associated with Google Calendar as detailed in the following tutorial. To register your mobile phone with Google Calendar, here is how: Open Google Calendar. Click the gear icon at the top right &gt; Settings. Click the Mobile Setup tab. Select your country from the Country drop down menu. Enter your phone number in the Phone number field. Select your carrier from the drop-down menu, if applicable. Click the Send Verification Code button. Once you receive the text message, enter the code you received in the Verification code field and click the Finish setup button. Click Save. Original Script from: Digital Inspiration","link":"/tech/use-google-drive-as-your-free-websites-uptime-monitor/"},{"title":"Wordpress Mobile Site SEO: Vary HTTP header","text":"Google’s recommendation for Smartphone-optimized Websites recommends use Vary HTTP header when using mobile site dynamically serving different HTML on the same URL. Google recommend that the server send a hint to request that Googlebot for smartphones should crawl the page, too, and thus discover the mobile content. This hint is implemented using the Vary HTTP header. After the Content-Type header, a Vary header is sent to (if I understand it correctly) tell intermediate caches, like proxy servers, that the content type of the document varies depending on the capabilities of the client which requests the document. The Vary HTTP header has two important and useful implications according to Google: It signals to caching servers used in ISPs and elsewhere that they should consider the user agent when deciding whether to serve the page from cache or not. Without the Vary HTTP header, a cache may mistakenly serve mobile users the cache of the desktop HTML page or vice versa. It helps Googlebot discover your mobile-optimized content faster, as a valid Vary HTTP header is one of the signals we may use to crawl URLs that serve mobile-optimized content. By default, browser will get header from WordPress website like this: 1234HTTP/1.1 200 OKContent-Type: text/htmlConnection: Keep-Alive(... rest of HTTP response headers...) All you need to do is paste the following code into the funcions.php file of theme: 123456function add_vary_header($headers) { $headers[&apos;Vary&apos;] = &apos;User-Agent&apos;; return $headers;}add_filter(&apos;wp_headers&apos;, &apos;add_vary_header&apos;); You will get a header similar like this Which means that the contents of the response “will vary” depending on the user agent that requests the page. 12345HTTP/1.1 200 OKContent-Type: text/htmlVary: User-AgentConnection: Keep-Alive(... rest of HTTP response headers...) This tiny SEO trick will not change anything besides adding one line into the header response code.","link":"/tech/wordpress-mobile-site-seo-vary-http-header/"},{"title":"You don't have permission to save in this location","text":"If you encounter the error You don’t have permission to save in this location when you are trying to save the Hosts file, that means the account that you logged in you doesn’t have administrator permission to save a file or the hosts file is protected by other programs. You may try the following suggestions one by one to check the issue. Check if you are logged in as administrator account, guest account will have permissions problem. Temporarily disable antivirus program when you are editing the hosts file. Programs like Windows Defender will prevent unauthorized changes to the hosts file. If you know what you are doing, you can temporary disable the hosts file protection. To disable hosts file protection in Windows Defender: Open Windows Defender, switch to the “Settings” tab, click on the left side “excluded files and locations” option, click “Browse” button, navigate to the location of the hosts file as C:\\Windows\\System32\\Drivers\\etc\\hosts, then click on the “Add” button, then click “Save Changes.” If you are using administrator account and your antivirus programs is off, you can use the following method to resolve the problem. Applies to win7/win8/win8.1/win10 … Right-click notepad.exe, then left-click “Run as administrator”. You can now open and edit the Hosts file. One way that is not recommended for fixing this problem is by modifying the hosts file’s permissions and makes it editable for anyone. Changing hosts file’s permission will make the system vulnerable.","link":"/tech/you-dont-have-permission-to-save-in-this-location/"},{"title":"29 Code Snippets for WordPress Users","text":"Tired of installing tons of WordPress plugins for small features? You can use code snippets to do certain things without a dedicated plugin. Generally the functions.php file is the place to add code snippes. If you don’t want to edit PHP file and want to gain more fine control over code snippets? You should try out Code Snippets plugin. With Code Snippets, you can easily add PHP code snippets to your WordPress site without custom snippets in theme’s functions.php file. Search Code Snippets in WordPress’s Add Plugins page and install it. You can start adding code snippet just like how you write post. We collected some very useful code snippets for WordPress. All can be used with Code Snippets plugin or added it directly to PHP file. Auto update plug and theme 12add_filter( &apos;auto_update_plugin&apos;, &apos;__return_true&apos; );add_filter( &apos;auto_update_theme&apos;, &apos;__return_true&apos; ); Remove all HTML Comments and space 1234567891011121314151617181920212223242526272829function callback($buffer) { $search = array( &apos;/\\n/&apos;, &apos;/\\&gt;[^\\S ]+/s&apos;, // strip whitespaces after tags, except space &apos;/[^\\S ]+\\&lt;/s&apos;, // strip whitespaces before tags, except space &apos;/(\\s)+/s&apos;, // shorten multiple whitespace sequences &apos;/&lt;!--(.|s)*?--&gt;/&apos; ); $replace = array( &apos;&apos;, &apos;&gt;&apos;, &apos;&lt;&apos;, &apos;\\\\1&apos;, &apos;&apos; ); #$buffer = preg_replace(&apos;/&lt;!--(.|s)*?--&gt;/&apos;, &apos;&apos;, $buffer); $buffer = preg_replace($search, $replace, $buffer); return $buffer;}function buffer_start() { ob_start(&quot;callback&quot;);}function buffer_end() { ob_end_flush();}add_action(&apos;get_header&apos;, &apos;buffer_start&apos;);add_action(&apos;wp_footer&apos;, &apos;buffer_end&apos;, 9999); Add DNS Prefetching 123456789//* Adding DNS Prefetchingfunction stb_dns_prefetch() {echo &apos;&lt;meta http-equiv=&quot;x-dns-prefetch-control&quot; content=&quot;on&quot;&gt;&lt;link rel=&quot;dns-prefetch&quot; href=&quot;//pagead2.googlesyndication.com&quot; /&gt;&lt;link rel=&quot;dns-prefetch&quot; href=&quot;//googleads.g.doubleclick.net&quot; /&gt;&lt;link rel=&quot;dns-prefetch&quot; href=&quot;//www.google-analytics.com&quot; /&gt;&lt;link rel=&quot;dns-prefetch&quot; href=&quot;//s.gravatar.com/&quot; /&gt;&apos;;}add_action(&apos;wp_head&apos;, &apos;stb_dns_prefetch&apos;, 1); Stop loading wp-emoji-release.min.js 12remove_action(&apos;wp_head&apos;, &apos;print_emoji_detection_script&apos;, 7);remove_action(&apos;wp_print_styles&apos;, &apos;print_emoji_styles&apos;); Prefer loading jquery JavaScript with async and defer tag 12345678if (!is_admin()) { add_filter( &apos;script_loader_tag&apos;, function ( $tag, $handle ) { if ( strpos( $tag, &quot;jquery.min.js&quot; ) || strpos( $tag, &quot;jquery.js&quot;) ) { return $tag; } return str_replace( &apos; src&apos;, &apos; async src&apos;, $tag ); }, 10, 2 );} Load CDN jQuery from Google 1234567891011// Load CDN jQuery add_action( &apos;wp_enqueue_scripts&apos;, &apos;register_jquery&apos; );function register_jquery() { if (!is_admin() &amp;&amp; $GLOBALS[&apos;pagenow&apos;] != &apos;wp-login.php&apos;) { // comment out the next two lines to load the local copy of jQuery wp_deregister_script(&apos;jquery&apos;); wp_register_script(&apos;jquery&apos;, &apos;https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js&apos;, false, &apos;3.2.1&apos;); wp_enqueue_script(&apos;jquery&apos;); }}// end Remove jQuery-Migrate script from header (New plugin will not have incompatibility issue) Remove migrate script12345678add_filter( &apos;wp_default_scripts&apos;, &apos;remove_jquery_migrate&apos; );function remove_jquery_migrate( &amp;$scripts) { if(!is_admin()) { $scripts-&gt;remove( &apos;jquery&apos;); $scripts-&gt;add( &apos;jquery&apos;, false, array( &apos;jquery-core&apos; ), &apos;1.10.2&apos; ); }} No self pings 12345678// No Self Pingsfunction no_self_ping( &amp;$links ) { $home = get_option( &apos;home&apos; ); foreach ( $links as $l =&gt; $link ) if ( 0 === strpos( $link, $home ) ) unset($links[$l]);}add_action( &apos;pre_ping&apos;, &apos;no_self_ping&apos; ); Add p tag to &lt;!--more--&gt; tag detection1234567891011121314151617function has_more(){ global $post; if ( empty( $post ) ) return; if ($pos=strpos($post-&gt;post_content, &apos;&lt;!--more--&gt;&apos;)) { return true; } else { return false; }}//add p tag to more tagfunction add_p_tag($link){return &quot;&lt;p&gt;$link&lt;/p&gt;&quot;;}add_filter(&apos;the_content_more_link&apos;, &apos;add_p_tag&apos;); Inject google ads after n link 123456789101112131415161718192021222324function inject_ad_text_after_n_chars($content) { // insert after the first &lt;/a&gt; after x characters $after_character = 1; if (is_single()) { $before_content = substr($content, 0, $after_character); $after_content = substr($content, $after_character); $after_content = explode(&apos;&lt;/p&gt;&apos;, $after_content); $text = &apos;&lt;ins class=&quot;adsbygoogle&quot; style=&quot;display:block&quot; data-ad-client=&quot;your id&quot; data-ad-slot=&quot;your ad slot&quot; data-ad-format=&quot;auto&quot;&gt;&lt;/ins&gt;&lt;script&gt;(adsbygoogle = window.adsbygoogle || []).push({});&lt;/script&gt;&lt;/p&gt;&apos;; array_splice($after_content, 1, 0, $text); $after_content = implode(&apos;&apos;, $after_content); return $before_content . $after_content; } else { return $content; }}add_filter(&apos;the_content&apos;, &apos;inject_ad_text_after_n_chars&apos;, 13); Delay auto closing p tag to fix some problems. auto closing p tag to fix some problems.12remove_filter( &apos;the_content&apos;, &apos;wpautop&apos; );add_filter( &apos;the_content&apos;, &apos;wpautop&apos; , 12); Show Media upload path Media upload123if(get_option(&apos;upload_path&apos;)==&apos;wp-content/uploads&apos; || get_option(&apos;upload_path&apos;)==null) { update_option(&apos;upload_path&apos;,WP_CONTENT_DIR.&apos;uploads&apos;);} Image SEO, with size and height info get_post_image ($post_id1234567891011121314151617181920212223242526272829303132// select the post content from the db$image_id = get_post_thumbnail_id();$image_url = wp_get_attachment_image_src($image_id,&apos;large&apos;);$the_image_src = $image_url[0]; // if src found, then create a new img tag if(strlen($the_image_src)) { if(strlen($img_script)) { // if the src starts with http/https, then strip out server name if(preg_match(&quot;/^(http(|s):\\/\\/)/&quot;, $the_image_src)) { $the_image_src = preg_replace(&quot;/^(http(|s):\\/\\/)/&quot;, &apos;&apos;, $the_image_src); $frags = split(&quot;\\/&quot;, $the_image_src); array_shift($frags); $the_image_src = &apos;/&apos; . join(&quot;/&quot;, $frags); } $the_image = &apos;&lt;img class=&quot;&apos; . $class . &apos;&quot; alt=&quot;&apos; . $alt . &apos;&quot; src=&quot;&apos; . $img_script . $the_image_src . &apos;&quot; width=&quot;&apos; . $width . &apos;&quot; height=&quot;&apos; . $height . &apos;&quot;/&gt;&apos;; } else { $the_image = &apos;&lt;img class=&quot;&apos; . $class . &apos;&quot; alt=&quot;&apos; . $alt . &apos;&quot; src=&quot;&apos; . $the_image_src . &apos;&quot; width=&quot;&apos; . $width . &apos;&quot; height=&quot;&apos; . $height . &apos;&quot; width=&quot;&apos; . $width . &apos;&quot; height=&quot;&apos; . $height . &apos;&quot;/&gt;&apos;; } } // if there&apos;s no image else return false; return $the_image; } Add Nofollow to comments link Nofollow comments line12345678#function add_nofollow_to_comments_popup_link(){# return &apos; rel=&quot;nofollow&quot; &apos;;}#add_filter( &apos;comments_popup_link_attributes&apos;, &apos;add_nofollow_to_comments_popup_link&apos; );add_filter( &apos;get_comment_author_link&apos;, &apos;rv_remove_comment_author_link&apos;, 10, 3 );function rv_remove_comment_author_link( $return, $author, $comment_ID ) { return $author;} Remove junk header Remove junk12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455#remove_action(&apos;wp_head&apos;, &apos;wp_enqueue_scripts&apos;, 1);#add_action(&apos;wp_footer&apos;, &apos;wp_enqueue_scripts&apos;, 5);function ft_rtt_remove_title_attribute( $output ){ $output = preg_replace(&apos;/title=\\&quot;(.*?)\\&quot;/&apos;,&apos;&apos;,$output); return $output; }add_filter(&apos;wp_list_categories&apos;,&apos;ft_rtt_remove_title_attribute&apos;);add_filter(&apos;wp_list_pages&apos;,&apos;ft_rtt_remove_title_attribute&apos;);add_filter(&apos;the_category&apos;, &apos;ft_rtt_remove_title_attribute&apos; );add_filter(&apos;comment_ID&apos;, &apos;ft_rtt_remove_title_attribute&apos; );function wpbeginner_remove_version() { return &apos;&apos;;}add_filter(&apos;the_generator&apos;, &apos;wpbeginner_remove_version&apos;);add_filter(&apos;show_admin_bar&apos;, &apos;__return_false&apos;);remove_action(&apos;wp_head&apos;,&apos;rsd_link&apos;);remove_action(&apos;wp_head&apos;,&apos;wlwmanifest_link&apos;);remove_action( &apos;wp_head&apos;, &apos;index_rel_link&apos; );remove_action( &apos;wp_head&apos;, &apos;parent_post_rel_link&apos;, 10, 0 );remove_action( &apos;wp_head&apos;, &apos;start_post_rel_link&apos;, 10, 0 );remove_action( &apos;wp_head&apos;, &apos;adjacent_posts_rel_link_wp_head&apos;, 10, 0 );remove_action( &apos;wp_head&apos;, &apos;rel_canonical&apos; );remove_action( &apos;wp_head&apos;, &apos;wp_shortlink_wp_head&apos;, 10, 0 );remove_action( &apos;wp_head&apos;, &apos;noindex&apos;, 1 );remove_filter(&apos;comment_text&apos;, &apos;make_clickable&apos;, 9);#Remove Wordpress Comment Feed Link from header#Display the links to the extra feeds such as category feedsremove_action(&apos;wp_head&apos;, &apos;feed_links_extra&apos;, 3);#Display the links to the general feeds: Post and Comment Feedremove_action(&apos;wp_head&apos;, &apos;feed_links&apos;, 2);$qmr_work_tags = array( &apos;the_title&apos;, &apos;the_content&apos;, &apos;the_excerpt&apos;, &apos;comment_text&apos;, &apos;list_cats&apos;, &apos;single_post_title&apos;, &apos;comment_author&apos;, &apos;term_name&apos;, &apos;link_name&apos;, &apos;link_description&apos;, &apos;link_notes&apos;, &apos;bloginfo&apos;, &apos;wp_title&apos;, &apos;widget_title&apos;, &apos;term_description&apos;, &apos;category_description&apos;, &apos;widget_text&apos;);foreach ( $qmr_work_tags as $qmr_work_tag ) {remove_filter ($qmr_work_tag, &apos;wptexturize&apos;);} Remove category in url Remove category, together with plugin1234567891011121314151617181920212223function fix_slash( $string, $type ){ global $wp_rewrite; if ( $wp_rewrite-&gt;use_trailing_slashes == false ) { if ( $type != &apos;single&apos; &amp;&amp; $type != &apos;category&apos; ) return trailingslashit( $string ); if ( $type == &apos;single&apos; &amp;&amp; ( strpos( $string, &apos;.html/&apos; ) !== false ) ) return trailingslashit( $string ); if ( $type == &apos;category&apos; &amp;&amp; ( strpos( $string, &apos;category&apos; ) !== false ) ) { $aa_g = str_replace( &quot;/category/&quot;, &quot;/&quot;, $string ); return trailingslashit( $aa_g ); } if ( $type == &apos;category&apos; ) return trailingslashit( $string ); } return $string;} add_filter( &apos;user_trailingslashit&apos;, &apos;fix_slash&apos;, 55, 2 ); Add SEO title attributes next post link, previous post link Title attributes to next and previous post link functions12345678910111213141516171819add_filter(&apos;next_post_link&apos;,&apos;add_title_to_next_post_link&apos;);function add_title_to_next_post_link($link) { global $post; $post = get_post($post_id); $next_post = get_next_post(); $title = $next_post-&gt;post_title; $link = str_replace(&quot;rel=&quot;, &quot; title=&apos;&quot;.$title.&quot;&apos; rel=&quot;, $link); return $link;}add_filter(&apos;previous_post_link&apos;,&apos;add_title_to_previous_post_link&apos;);function add_title_to_previous_post_link($link) { global $post; $post = get_post($post_id); $previous_post = get_previous_post(); $title = $previous_post-&gt;post_title; $link = str_replace(&quot;rel=&quot;, &quot; title=&apos;&quot;.$title.&quot;&apos; rel=&quot;, $link); return $link;} Remove rel from category tag Remove rel123456function remove_rel($result) { $result = str_replace(&apos; rel=&quot;category tag&quot;&apos;, &apos;rel=&quot;tag&quot;&apos;, $result); return $result;}add_filter(&apos;wp_list_categories&apos;, &apos;remove_rel&apos;);add_filter(&apos;the_category&apos;, &apos;remove_rel&apos;); Remove query strings from static resources query strings from static resources123456789101112function ewp_remove_script_version( $src ){ return remove_query_arg( &apos;ver&apos;, $src );}add_filter( &apos;script_loader_src&apos;, &apos;ewp_remove_script_version&apos;, 15, 1 );add_filter( &apos;style_loader_src&apos;, &apos;ewp_remove_script_version&apos;, 15, 1 );#remove header recent comment styleadd_action(&apos;widgets_init&apos;, &apos;my_remove_recent_comments_style&apos;);function my_remove_recent_comments_style() { global $wp_widget_factory; remove_action(&apos;wp_head&apos;, array($wp_widget_factory-&gt;widgets[&apos;WP_Widget_Recent_Comments&apos;], &apos;recent_comments_style&apos;));} Add alt tags to thumbnail &apos;add_attachment&apos;, &apos;my_set_image_meta_upon_image_upload&apos; );12345678910111213141516171819202122232425262728293031function my_set_image_meta_upon_image_upload( $post_ID ) { // Check if uploaded file is an image, else do nothing if ( wp_attachment_is_image( $post_ID ) ) { $my_image_title = get_post( $post_ID )-&gt;post_title; // Sanitize the title: remove hyphens, underscores &amp; extra spaces: $my_image_title = preg_replace( &apos;%\\s*[-_\\s]+\\s*%&apos;, &apos; &apos;, $my_image_title ); // Sanitize the title: capitalize first letter of every word (other letters lower case): $my_image_title = ucwords( strtolower( $my_image_title ) ); // Create an array with the image meta (Title, Caption, Description) to be updated // Note: comment out the Excerpt/Caption or Content/Description lines if not needed $my_image_meta = array( &apos;ID&apos; =&gt; $post_ID, // Specify the image (ID) to be updated &apos;post_title&apos; =&gt; $my_image_title, // Set image Title to sanitized title //&apos;post_excerpt&apos; =&gt; $my_image_title, // Set image Caption (Excerpt) to sanitized title &apos;post_content&apos; =&gt; $my_image_title, // Set image Description (Content) to sanitized title ); // Set the image Alt-Text update_post_meta( $post_ID, &apos;_wp_attachment_image_alt&apos;, $my_image_title ); // Set the image meta (e.g. Title, Excerpt, Content) wp_update_post( $my_image_meta ); } } Add pre tag wrapper to code tag, and editor button pre tag12345678add_action(&apos;admin_print_footer_scripts&apos;,&apos;eg_quicktags&apos;);function eg_quicktags() {?&gt;&lt;script type=&quot;text/javascript&quot; charset=&quot;utf-8&quot;&gt; QTags.addButton( &apos;eg_pre&apos;, &apos;Code with Pre&apos;,&apos;&lt;pre&gt;&lt;code&gt;&apos;, &apos;&lt;/code&gt;&lt;/pre&gt;&apos;, &apos;q&apos; );&lt;/script&gt;&lt;?php} Login page tweak no_wordpress_errors(){123456789101112131415161718add_filter( &apos;login_errors&apos;, &apos;no_wordpress_errors&apos;);function my_login_logo_one() { ?&gt;&lt;style type=&quot;text/css&quot;&gt; body.login div#login h1 a {display: none; !important;} &lt;/style&gt;&lt;?php }add_action( &apos;login_enqueue_scripts&apos;, &apos;my_login_logo_one&apos; ); // changing the logo link from wordpress.org to your sitefunction mb_login_url() { return home_url(); }add_filter( &apos;login_headerurl&apos;, &apos;mb_login_url&apos; );// changing the alt text on the logo to show your site namefunction mb_login_title() { return get_option( &apos;blogname&apos; ); }add_filter( &apos;login_headertitle&apos;, &apos;mb_login_title&apos; ); Remove wp version param from any enqueued scripts remove wp version param from any enqueued scripts12345function remove_wp_ver_css_js( $src ) { if ( strpos( $src, &apos;ver=&apos; . get_bloginfo( &apos;version&apos; ) ) ) $src = remove_query_arg( &apos;ver&apos;, $src ); return $src;} Add X-UA-Compatible header 123456function add_http_header($headers) {$headers[&apos;X-UA-Compatible&apos;] = &apos;IE=edge,chrome=1&apos;;return $headers;}add_filter(&apos;wp_headers&apos;, &apos;add_http_header&apos;); Prevent WordPress from participating in Pingback Denial of Service Attacks Disable xmlrcp/pingback123456789101112131415161718192021222324252627282930313233add_filter( &apos;xmlrpc_enabled&apos;, &apos;__return_false&apos; );add_filter( &apos;pre_update_option_enable_xmlrpc&apos;, &apos;__return_false&apos; );add_filter( &apos;pre_option_enable_xmlrpc&apos;, &apos;__return_zero&apos; );// Disable trackbacksadd_filter( &apos;rewrite_rules_array&apos;, function( $rules ) { foreach( $rules as $rule =&gt; $rewrite ) { if( preg_match( &apos;/trackback\\/\\?\\$$/i&apos;, $rule ) ) { unset( $rules[$rule] ); } } return $rules;});// Disable X-Pingback HTTP Header.add_filter(&apos;wp_headers&apos;, function($headers, $wp_query){ if(isset($headers[&apos;X-Pingback&apos;])){ unset($headers[&apos;X-Pingback&apos;]); } return $headers;}, 11, 2);add_filter( &apos;xmlrpc_methods&apos;, function($methods){ unset( $methods[&apos;pingback.ping&apos;] ); unset( $methods[&apos;pingback.extensions.getPingbacks&apos;] ); unset( $methods[&apos;wp.getUsersBlogs&apos;] ); // Block brute force discovery of existing users unset( $methods[&apos;system.multicall&apos;] ); unset( $methods[&apos;system.listMethods&apos;] ); unset( $methods[&apos;system.getCapabilities&apos;] ); return $methods;}); Include thumbnail (post-thumb) in RSS feed INCLUDES THE THUMBNAIL IN OUR RSS FEED123456789function insertThumbnailRSS($content) {global $post;if ( has_post_thumbnail( $post-&gt;ID ) ){$content = &apos;&lt;p&gt;&apos; . get_the_post_thumbnail( $post-&gt;ID, &apos;post-thumb&apos;, array( &apos;alt&apos; =&gt; get_the_title(), &apos;title&apos; =&gt; get_the_title()) ) . &apos;&lt;/p&gt;&apos; . $content;}return $content;}add_filter(&apos;the_excerpt_rss&apos;, &apos;insertThumbnailRSS&apos;);add_filter(&apos;the_content_feed&apos;, &apos;insertThumbnailRSS&apos;); Prevent Page Scroll When Clicking the More Link Page Scroll When Clicking the More Link12345function remove_more_link_scroll( $link ) { $link = preg_replace( &apos;|#more-[0-9]+|&apos;, &apos;&apos;, $link ); return $link;}add_filter( &apos;the_content_more_link&apos;, &apos;remove_more_link_scroll&apos; ); Convert links and images to being site root relative Image URLs1234567891011121314151617add_filter(&apos;image_send_to_editor&apos;,&apos;image_to_relative&apos;,5,8);function image_to_relative($html, $id, $caption, $title, $align, $url, $size, $alt){ $sp = strpos($html,&quot;src=&quot;) + 5; $ep = strpos($html,&quot;\\&quot;&quot;,$sp); $imageurl = substr($html,$sp,$ep-$sp); $relativeurl = str_replace([&quot;http://&quot;, &quot;https://&quot;],&quot;&quot;,$imageurl); $sp = strpos($relativeurl,&quot;/&quot;); $relativeurl = substr($relativeurl,$sp); $html = str_replace($imageurl,$relativeurl,$html); return $html;} Set custom cookie If you have server control, you can use this to stop spam.Stop Automated Comment Spam with Nginx Automated Comment Spam with Nginx1234function set_post_cookie() { echo &apos;&lt;script&gt;document.cookie = &quot;_pass=1; max-age=1800; path=/; secure&quot;;&lt;/script&gt;&apos; . &quot;&quot;; }add_action( &apos;comment_form&apos;, &apos;set_post_cookie&apos;, 100 );","link":"/tech/29-code-snippets-for-wordpress-users/"},{"title":"Webpack Graphql compile error easy fix","text":"Complilation reports lot of errors with your Webpack and GraphQL setup? You might not have Webpack setup correctly. If you see errors like the example in this post below, the easiest fix is add .mjs to your Webpack config’s extension list before anything else. 1234567resolve: { extensions: [&apos;.mjs&apos;, &apos;.js&apos;, &apos;.jsx&apos;, &apos;.css&apos;, &apos;.scss&apos;], modules: [ path.resolve(__dirname, &apos;src&apos;), &apos;node_modules&apos;, ],}, Example errors you will be getting without .mjs in your Webpack config. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175Can&apos;t reexport the named export &apos;BREAK&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;BreakingChangeType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;DEFAULT_DEPRECATION_REASON&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;DangerousChangeType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;DirectiveLocation&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;FieldsOnCorrectTypeRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;FragmentsOnCompositeTypesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLBoolean&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLDeprecatedDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLEnumType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLError&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLFloat&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLID&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLIncludeDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLInputObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLInt&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLInterfaceType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLList&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLNonNull&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLScalarType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLSkipDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLString&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;GraphQLUnionType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;Kind&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;KnownArgumentNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;KnownDirectivesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;KnownFragmentNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;KnownTypeNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;LoneAnonymousOperationRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;NoFragmentCyclesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;NoUndefinedVariablesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;NoUnusedFragmentsRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;NoUnusedVariablesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;OverlappingFieldsCanBeMergedRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;PossibleFragmentSpreadsRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;ProvidedRequiredArgumentsRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;ScalarLeafsRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;SchemaMetaFieldDef&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;SingleFieldSubscriptionsRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;Source&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;TokenKind&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;TypeInfo&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;TypeKind&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;TypeMetaFieldDef&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;TypeNameMetaFieldDef&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueArgumentNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueDirectivesPerLocationRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueFragmentNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueInputFieldNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueOperationNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;UniqueVariableNamesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;ValidationContext&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;ValuesOfCorrectTypeRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;VariablesAreInputTypesRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;VariablesInAllowedPositionRule&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__Directive&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__DirectiveLocation&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__EnumValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__Field&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__InputValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__Schema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__Type&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;__TypeKind&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertAbstractType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertCompositeType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertEnumType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertInputObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertInputType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertInterfaceType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertLeafType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertListType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertNamedType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertNonNullType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertNullableType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertOutputType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertScalarType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertUnionType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertValidName&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertValidSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;assertWrappingType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;astFromValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;buildASTSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;buildClientSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;buildSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;coerceValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;concatAST&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;createSourceEventStream&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;defaultFieldResolver&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;doTypesOverlap&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;execute&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;extendSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;findBreakingChanges&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;findDangerousChanges&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;findDeprecatedUsages&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;formatError&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getDescription&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getDirectiveValues&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getIntrospectionQuery&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getLocation&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getNamedType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getNullableType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getOperationAST&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getOperationRootType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;getVisitFn&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;graphql&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;graphqlSync&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;introspectionFromSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;introspectionQuery&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;introspectionTypes&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isAbstractType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isCompositeType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isDefinitionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isEnumType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isEqualType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isExecutableDefinitionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isInputObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isInputType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isInterfaceType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isIntrospectionType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isLeafType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isListType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isNamedType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isNonNullType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isNullableType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isObjectType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isOutputType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isRequiredArgument&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isRequiredInputField&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isScalarType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isSelectionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isSpecifiedDirective&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isSpecifiedScalarType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeDefinitionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeExtensionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeSubTypeOf&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeSystemDefinitionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isTypeSystemExtensionNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isUnionType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isValidJSValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isValidLiteralValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isValidNameError&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isValueNode&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;isWrappingType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;lexicographicSortSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;parse&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;parseType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;parseValue&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;print&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;printError&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;printIntrospectionSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;printSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;printType&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;responsePathAsArray&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;separateOperations&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;specifiedDirectives&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;specifiedRules&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;specifiedScalarTypes&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;subscribe&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;typeFromAST&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;validate&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;validateSchema&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;valueFromAST&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;valueFromASTUntyped&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;visit&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;visitInParallel&apos; from non EcmaScript module (only default export is available)Can&apos;t reexport the named export &apos;visitWithTypeInfo&apos; from non EcmaScript module (only default export is available)","link":"/tech/webpack-graphql-compile-error-easy-fix/"}],"tags":[{"name":"WordPress","slug":"wordpress","link":"/tag/wordpress/"},{"name":"MySQL","slug":"mysql","link":"/tag/mysql/"},{"name":"apps","slug":"apps","link":"/tag/apps/"},{"name":"OpenWrt","slug":"openwrt","link":"/tag/openwrt/"},{"name":"Ads","slug":"ads","link":"/tag/ads/"},{"name":"printers","slug":"printers","link":"/tag/printers/"},{"name":"Apache","slug":"apache","link":"/tag/apache/"},{"name":"MacOS","slug":"macos","link":"/tag/macos/"},{"name":"Wireguard","slug":"wireguard","link":"/tag/wireguard/"},{"name":"AWS","slug":"aws","link":"/tag/aws/"},{"name":"baby","slug":"baby","link":"/tag/baby/"},{"name":"pfsense","slug":"pfsense","link":"/tag/pfsense/"},{"name":"Nginx","slug":"nginx","link":"/tag/nginx/"},{"name":"Server","slug":"server","link":"/tag/server/"},{"name":"timezone","slug":"timezone","link":"/tag/timezone/"},{"name":"Windows","slug":"windows","link":"/tag/windows/"},{"name":"port","slug":"port","link":"/tag/port/"},{"name":"Amazon","slug":"amazon","link":"/tag/amazon/"},{"name":"React","slug":"react","link":"/tag/react/"},{"name":"API","slug":"api","link":"/tag/api/"},{"name":"Beini","slug":"beini","link":"/tag/beini/"},{"name":"DOS","slug":"dos","link":"/tag/dos/"},{"name":"PDF","slug":"pdf","link":"/tag/pdf/"},{"name":"UEFI","slug":"uefi","link":"/tag/uefi/"},{"name":"Java","slug":"java","link":"/tag/java/"},{"name":"Mikrotik","slug":"mikrotik","link":"/tag/mikrotik/"},{"name":"PCC","slug":"pcc","link":"/tag/pcc/"},{"name":"DNS","slug":"dns","link":"/tag/dns/"},{"name":"SSL","slug":"ssl","link":"/tag/ssl/"},{"name":"Raspberry-Pi","slug":"raspberry-pi","link":"/tag/raspberry-pi/"},{"name":"Office","slug":"office","link":"/tag/office/"},{"name":"Wireless","slug":"wireless","link":"/tag/wireless/"},{"name":"Google Voice","slug":"google-voice","link":"/tag/google-voice/"},{"name":"CentOS","slug":"centos","link":"/tag/centos/"},{"name":"Docker","slug":"docker","link":"/tag/docker/"},{"name":"entware","slug":"entware","link":"/tag/entware/"},{"name":"firmware","slug":"firmware","link":"/tag/firmware/"},{"name":"ram","slug":"ram","link":"/tag/ram/"},{"name":"LAMP","slug":"lamp","link":"/tag/lamp/"},{"name":"Opencart","slug":"opencart","link":"/tag/opencart/"},{"name":"iPhone","slug":"iphone","link":"/tag/iphone/"},{"name":"Linksys","slug":"linksys","link":"/tag/linksys/"},{"name":"Safari","slug":"safari","link":"/tag/safari/"},{"name":"keepass","slug":"keepass","link":"/tag/keepass/"},{"name":"Python","slug":"python","link":"/tag/python/"},{"name":"iptables","slug":"iptables","link":"/tag/iptables/"},{"name":"Open Source","slug":"open-source","link":"/tag/open-source/"},{"name":"DISKPART","slug":"diskpart","link":"/tag/diskpart/"},{"name":"React Native","slug":"react-native","link":"/tag/react-native/"},{"name":"patch","slug":"patch","link":"/tag/patch/"},{"name":"MAC","slug":"mac","link":"/tag/mac/"},{"name":"hosts","slug":"hosts","link":"/tag/hosts/"},{"name":"driver","slug":"driver","link":"/tag/driver/"},{"name":"iOS","slug":"ios","link":"/tag/ios/"},{"name":"Google Drive","slug":"google-drive","link":"/tag/google-drive/"},{"name":"SEO","slug":"seo","link":"/tag/seo/"},{"name":"Webpack","slug":"webpack","link":"/tag/webpack/"},{"name":"GraphQL","slug":"graphql","link":"/tag/graphql/"}],"categories":[{"name":"tech","slug":"tech","link":"/tech/"},{"name":"lifestyle","slug":"lifestyle","link":"/lifestyle/"}]}