{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"office\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/tech/free-office-365-for-students-and-teachers/",
            "url": "https://www.qualityology.com/tech/free-office-365-for-students-and-teachers/",
            "title": "Free Office 365 for Students and Teachers",
            "date_published": "2014-09-23T04:36:13.000Z",
            "content_html": "<p>Office 365 Education for Students and Teachers is now available. You can install Office on up to 5 PCs or Macs and on other mobile devices, including Windows tablets and iPads. <a href=\"http://go.microsoft.com/fwlink/p/?LinkId=506946\" title=\"Free office 365 for students and teachers\">Check if you&#x2019;re eligible</a> <img src=\"/2014/09/office365-6f0e2f552dcb29d5ee86f8c0401dd6c0.png\" alt=\"Office365\"> </p>\n<p><strong>What are the eligibility requirements for FREE Office 365 Education program?</strong> </p>\n<p>Use your .edu or .edu.* email address to see if your school is qualify for this program. </p>\n<p><strong>What will I get?</strong></p>\n<p> Latest version Word, Excel, PowerPoint, Outlook, OneNote, Publisher, and Access on up to 5 PCs or Macs and Office apps on other mobile devices including Windows tablets and iPads. The plan also includes 1TB of OneDrive storage, managed by the school, and students can edit and collaborate using Office Online, Yammer, and SharePoint sites. </p>\n<p><strong>How long can I use this plan for?</strong> </p>\n<p>If you are eligible, you can use the plan until you graduate or are no longer enrolled at a qualified school. Student eligibility may be re-verified at any time. Basically, keep your .edu email active. </p>\n<p><strong>What do I do if I am student but I&#x2019;m not eligible for this program?</strong> </p>\n<p>Buy the discounted version Office 365. <a href=\"https://products.office.com/en-us/student/office-for-students\" title=\"Office 365 for student\">Click here to go</a>.</p>\n",
            "tags": [
                "Office"
            ]
        }
    ]
}