{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"keepass\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/tech/macpasshttp-keepasshttp-plugin-for-mac-keepass/",
            "url": "https://www.qualityology.com/tech/macpasshttp-keepasshttp-plugin-for-mac-keepass/",
            "title": "MacPassHTTP - keepasshttp plugin for Mac keepass",
            "date_published": "2016-04-26T05:57:37.000Z",
            "content_html": "<p>This plugin is primarily intended for Macpass with PassIFox for Mozilla Firefox, chromeIPass for Google Chrome, or passafari for Mac Safari. KeePassHttp does&#x2019;t not officially support Mac system just like Keepass doesn&#x2019;t have a official native client for Mac. Since MacPass, this situation has changed and now MacOS people can use MacPass as native keepass application together with MacPassHTTP to get the similar experience like the Windows platform. Safari must install passafari extension in order to connect to MacPass or other keepkass application. <a href=\"https://github.com/mmichaa/passafari.safariextension/releases/download/v1.0.beta2/passafari-v1.0.beta2.safariextz\">Safari extension passafari download</a> The latest version of MacPass can be download from <a href=\"https://github.com/mstarke/MacPass/releases\">MacPass Official Release</a>. However, the official MacPass release does not include MacPassHTTP (keepasshttp support). It must be compile manually. Install/compile guide can be found <a href=\"https://github.com/MacPass/MacPassHTTP\">MacPassHTTP</a>. As of now, the last version of MacPass is 0.6.2. If you don&#x2019;t want to go through the compile process, you can download the plugin from this post. <a href=\"https://www.qualityology.com/2016/04/MacPassHTTP.mpplugin.zip\">MacPassHTTP.mpplugin</a> The plugin has been tested for MacPass 0.6.2. Future version support is unknown. It should go to folder ~/Library/Application Support/MacPass/ <img src=\"/2016/04/MacPassHTTP.png\" alt=\"Macpasshttp\"> You can open the folder from terminal and drag the plugin into the folder.</p>\n<figure class=\"highlight plain hljs\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">open ~/Library/Application\\ Support/MacPass/</span><br></pre></td></tr></table></figure>\n<p>After that you should be able to see it on MacPass. <img src=\"/2016/04/MacPassHTTP_Plugin.png\" alt=\"Macpasshttp Plugin\"></p>\n",
            "tags": [
                "keepass"
            ]
        },
        {
            "id": "https://www.qualityology.com/tech/native-keepass-for-mac-os-x-with-keepasshttp-macpass/",
            "url": "https://www.qualityology.com/tech/native-keepass-for-mac-os-x-with-keepasshttp-macpass/",
            "title": "Native KeePass client for MAC OS X with KeePassHTTP - MacPass",
            "date_published": "2015-07-30T02:48:31.000Z",
            "content_html": "<p>Keeps can be used via Mono on OS X but lack of important functionality and not work very well. MacPass is a KeePass compatible password manager for OS X. MacPass is free and open source. </p>\n<p>Unlike other KeePass for Mac alternatives, MacPass support KeePassHTTP. KeePassHTTP is a KeePass plugin that allows MacPass to connect with a browser extension like Passifox / ChromeIPass to automatically fill in ID and password details on web pages. KeePassHTTP is not available on the official release as of MacPass version 0.5. It will included in default after version 0.6. However, current version binaries already included KeePassHTTP and can be turn on when building your own MacPass. <a href=\"https://github.com/mstarke/MacPass/releases/latest\">Download MacPass with KeePassHTTP</a> <img src=\"/2015/07/enable-keepasshttp.png\" alt=\"Enable Keepasshttp\"> </p>\n<p>When your extension makes a connection with your database, MacPass will display a confirmation dialog on screen. <img src=\"/2015/07/KeePassHttp.png\" alt=\"Keepasshttp\"> Hit &#x201C;yes&#x201D; to allow the connection between your extension and MacPass. SOURCE: Native OS X KeePass client <a href=\"http://mstarke.github.io/MacPass\">http://mstarke.github.io/MacPass</a></p>\n",
            "tags": [
                "keepass"
            ]
        }
    ]
}