{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"safari\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/tech/macos-safari-cannot-install-extension-solution/",
            "url": "https://www.qualityology.com/tech/macos-safari-cannot-install-extension-solution/",
            "title": "MacOS Safari cannot install extension solution",
            "date_published": "2016-04-27T03:51:21.000Z",
            "content_html": "<p>Some old MacOS user may notice that installing Safari extention is not working like before in new system. &#x201C;Install now&#x201D; is no longer exist, it was replaced by &#x201C;Trust&#x201D;. However, when click the &#x201C;Trust&#x201D; button to install external extension, extension will not be installed in to Safari. That has nothing to do with the extension compatible issue.</p>\n<p>This seems like a bug on the &#x201C;Trust&#x201D; button. Mouse click on the &#x201C;Trust&#x201D; button is ignored. However, there is a trick to get this work. We can use keyboard to confirm the installation. Before that, we need to enable the keyboard control access in Windows and dialogs. For OS X 10.11.* or maybe later version if bug still exist. Go to System Preferences &gt; Keyboard &gt; Shortcuts &gt; Full Keyboard Access, select &#x201C;All controls&#x201D;. Now we can press Tab key to move focus between button in Windows and dialogs. <img src=\"/2016/04/osx-10.11-keyboard-all-controls-03fd0e9d02b81495541dfce711785500.png\" alt=\"Osx 10.11 Keyboard All Controls\"> Now try to install Safari extension, when the dialog pop up, do not use mouse to click the &#x201C;Trust&#x201D; button since it will not work, use keyboard instead. Press the &#x201C;tab&#x201D; key to move the focus to &#x201C;Trust&#x201D; button and hit space or return. Extension will be installed.</p>\n",
            "tags": [
                "Safari"
            ]
        }
    ]
}