{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"pdf\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/tech/open-pdfa-pdf-file-without-read-mode/",
            "url": "https://www.qualityology.com/tech/open-pdfa-pdf-file-without-read-mode/",
            "title": "Open PDF/A PDF file without read-only mode",
            "date_published": "2017-10-20T05:49:04.000Z",
            "content_html": "<p>The file you have opened complies with the pdf/a standard and has been opened read-only. If you open a PDF/A standard PDF, in default you will not able to modify it because Adobe PDF reader or Acrobat will open it in view only mode. <img src=\"/2017/10/pdf-a.png\" alt=\"Pdf A\"></p>\n<blockquote>\n<p>PDF/A is an ISO-standardized version of the Portable Document Format (PDF) specialized for use in the archiving and long-term preservation of electronic documents. PDF/A differs from PDF by prohibiting features ill-suited to long-term archiving, such as font linking (as opposed to font embedding) and encryption.[1] The ISO requirements for PDF/A file viewers include color management guidelines, support for embedded fonts, and a user interface for reading embedded annotations (From Wikipedia).</p>\n</blockquote>\n<p>PDF/A format is important and mainly for business use. It&#x2019;s a format that ensures a PDF file can be reproduced exactly the same way because all necessary information for displaying the document is embedded in the file. It is safe, It is safer and securer for long run. Actually Adobe PDF reader or Acrobat have the option to turn off the PDF/A view only mode.</p>\n<h2 id=\"How-to-open-a-PDF-A-PDF-file-without-read-only-mode\"><a href=\"#How-to-open-a-PDF-A-PDF-file-without-read-only-mode\" class=\"headerlink\" title=\"How to open a PDF/A PDF file without read-only mode?\"></a>How to open a PDF/A PDF file without read-only mode?</h2><p><strong>Edit</strong>&gt;<strong>Preferences</strong>&gt;<strong>Documents</strong>&gt;<strong>PDF/A View mode</strong>. Set <strong>view documents in PDF/A mode</strong> to &#x201C;never&#x201D;. You can revert back to the default setting anytime you want to.</p>\n",
            "tags": [
                "PDF"
            ]
        },
        {
            "id": "https://www.qualityology.com/tech/disable-adobe-reader-build-in-pdf-viewer-in-firefox-chrome-ie/",
            "url": "https://www.qualityology.com/tech/disable-adobe-reader-build-in-pdf-viewer-in-firefox-chrome-ie/",
            "title": "Disable Adobe Reader build in PDF Viewer in Firefox Chrome IE",
            "date_published": "2014-10-10T06:46:00.000Z",
            "content_html": "<p>Firefox, Chrome, and the latest version Internet Explorer now have a built in PDF reader. The built-in PDF viewer is enabled by default. It allow users to view PDF without installing Adobe PDF reader. However, the built-in viewers are not compatible with all PDF files. Some PDF files have special arrangements or contain extra functions would have issues when viewing it with built-in PDF viewer. This viewer might not display all PDF documents correctly. To change the default PDF view in web browsers, follow the instructions to active the Adobe PDF reader plug-ins or add-ons. <strong>Google Chrome</strong> Open Chrome, Type <strong>chrome://plugins</strong> in the address bar to open the Plug-ins page. <img src=\"/2014/10/chrome-plugin.png\" alt=\"Chrome Plugin\"> Locate the Adobe PDF plug-in, and do one of the following:</p>\n<ul>\n<li>  To make Adobe PDF plug-in the default PDF viewer in the browser, enable the Adobe PDF plug-in and disable Chrome PDF Viewer.</li>\n<li>  To disable in browser PDF viewing and force Chrome download PDF files, leaves both viewer plug-ins disabled so the PDFs won&#x2019;t display in the browser.</li>\n</ul>\n<p><strong>Mozilla Firefox</strong> Press Ctrl+Shift+A to open the <strong>Add-ons Manager</strong> window. Enable the Acrobat or Reader plugin by select &#x201C;Always Active&#x201D; Next open <strong>option</strong> windows, under <strong>Applications</strong> tab <img src=\"/2014/10/firefox-pdf.png\" alt=\"Firefox Pdf\"> Select <strong>Use Adobe Acrobat (in Firefox)</strong> for Adobe Acrobat Forms Document, Adobe Acrobat XML Data Package File, and Portable Document Format (PDF). * To disable in browser PDF viewing, select <strong>save file</strong>. <strong>Internet Explorer (IE)</strong></p>\n<ol>\n<li> Open Internet Explorer, and choose Tools &gt; Manage Add-ons.</li>\n<li> Under Add-on Types, select Toolbars And Extensions.</li>\n<li> In the Show menu, select All Add-ons.</li>\n<li> In the list of add-ons, select Adobe PDF Reader.</li>\n</ol>\n<p><img src=\"/2014/10/ie-pdf.png\" alt=\"Ie Pdf\"></p>\n",
            "tags": [
                "PDF"
            ]
        }
    ]
}