{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"google drive\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/tech/use-google-drive-as-your-free-websites-uptime-monitor/",
            "url": "https://www.qualityology.com/tech/use-google-drive-as-your-free-websites-uptime-monitor/",
            "title": "Use Google Drive as Your Free Website's Uptime Monitor",
            "date_published": "2014-08-01T05:02:21.000Z",
            "content_html": "<p>Most webmasters use &#x201C;free&#x201D; website monitoring services to track the downtime and uptime of their sites. These free service normally offer one domain monitoring service and often required to upgrade to the premium version for unlimited domain monitoring. Some feature like email or SMS alerts require premium version. Now, via Google Drive Spreadsheet, you can monitor the status your websites freely with out paying for any commercial services. You can track and monitor unlimited number of websites and get alerts from email or SMS. This Google Scripts based website monitoring tool is absolutely FREE as well. The setup only takes free minute. After you configured, Google Drive will monitor the uptime /downtime of your website(s) continuously and automatically. </p>\n<p><strong>How is how to:</strong> </p>\n<ol>\n<li>Sign-in to your Google account and then <a href=\"https://docs.google.com/spreadsheet/ccc?key=0AtZBCk9l0uZJdEozSFM2cFEyVmtjbUgtNEhjNGlheWc&amp;newcopy=true\" title=\"Google Drive Website monitor\">click here</a> to copy this Google sheet into your Google Drive. You can copy to as many Google account as you want. </li>\n<li>Put your website URLs in cell B2 (comma separated) and your email address in cell B3. If you wish to receive alerts by text messages, put Yes in cell B4. </li>\n<li>You&#x2019;ll find a new Website Monitor menu in your Google Sheets toolbar. Click Initialize and you&#x2019;ll get a pop-up asking for authorization. Grant the necessary access. </li>\n<li>Go to the Website Monitor menu again and choose &#x201C;Start Website Monitor&#x201D; to begin the monitoring process. Close the Google Sheet. <img src=\"/2014/07/google-drive-web-monitor-723f51e0d412f2f0189b885fc996abc6.png\" alt=\"Google Drive Web Monitor\"> <strong>How does this Google Drive Scripts based website monitor works?</strong> There&#x2019;s a simple Google Script attached to the Google spreadsheet that does the monitoring. The script triggers every 5 minutes (in default) and then tries to fetch your website using URLFetchApp.fetch (a Google function similar to wget or curl). If the HTTP response code is anything other than 200, it indicates that there&#x2019;s an issue with the underlying website. The spreadsheet will record whenever your website(s) is up or down. You will receive an email and/or SMS when your website(s) is/are down or up. </li>\n</ol>\n<p><strong>How does the SMS alerts works?</strong> The SMS alerts are Sent via Google Google Apps Script will creates an event in your Google Calendar but with an SMS reminder. the event is set to expire in 30 seconds and thus you get an instant text alert on your mobile. If you aren&#x2019;t getting text alerts on your phone, please ensure that your phone number is associated with Google Calendar as detailed in the following tutorial. </p>\n<p><strong>To register your mobile phone with Google Calendar, here is how:</strong></p>\n<ol>\n<li> Open Google Calendar.</li>\n<li> Click the gear icon at the top right &gt; Settings.</li>\n<li> Click the Mobile Setup tab.</li>\n<li> Select your country from the Country drop down menu.</li>\n<li> Enter your phone number in the Phone number field.</li>\n<li> Select your carrier from the drop-down menu, if applicable.</li>\n<li> Click the Send Verification Code button.</li>\n<li> Once you receive the text message, enter the code you received in the Verification code field and click the Finish setup button.</li>\n<li> Click Save.</li>\n</ol>\n<p>Original Script from: <a href=\"http://www.labnol.org/internet/website-uptime-monitor/21060/\" title=\"Digital Inspiration\">Digital Inspiration</a></p>\n",
            "tags": [
                "Google Drive"
            ]
        }
    ]
}