{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"lifestyle\" category",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/lifestyle/best-easiest-way-sterilize-baby-bottles-uv-sterilization/",
            "url": "https://www.qualityology.com/lifestyle/best-easiest-way-sterilize-baby-bottles-uv-sterilization/",
            "title": "Best and easiest way to sterilize baby bottles - UV sterilization",
            "date_published": "2017-11-13T07:19:14.000Z",
            "content_html": "<p>Baby is vulnerable to diseases and illnesses, so you will want to ensure their bottles are clean and germ free until baby&#x2019;s immune system developed providing a much higher tolerance to bacterias and germs. Sterilizing bottles can have different ways. Some require more efforts and times and some need more cautions. <strong>There are many ways to sterilize baby bottles.</strong></p>\n<ul>\n<li>  Use&#xA0;electric steamers</li>\n<li>  Use Microwave</li>\n<li>  Use boiling water</li>\n<li>  Use UV sterilizer</li>\n<li>  Sterilizing Tablets</li>\n<li>  Many other ways.</li>\n</ul>\n<p>The best and easiest way to sterilize baby bottles at home is use UV&#xA0;sterilizer if you can get one. <strong>Why use UV sterilizer?</strong></p>\n<ol>\n<li> It does not use water, so no worry about germ from steamers water.</li>\n<li> No need to boil. Plastic bottle safe.</li>\n<li> UV can kill viruses, germs and bacteria (99.9% rate).</li>\n<li> Some sterilizer offer dryer function, save your time for sleep!</li>\n</ol>\n<p>The only con of this method is usually UV sterilizer is a bit expensive compare to other methods. There are not a lot of options of UV sterilizer in the market. You don&#x2019;t want a products that can only&#xA0;sterilize one bottle or one nipple at a time because you will have more than one bottle need to be sterilized. If you don&#x2019;t know which one to get, you can consider the&#xA0;Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer. </p>\n<p>It is available at Amazon and Wabi&#x2019;s website.</p>\n<h3 id=\"Get-one-from-Amazon-Wabi-Baby-Touch-Panel-Dual-Function-UV-Sterilizer-amp-Dryer\"><a href=\"#Get-one-from-Amazon-Wabi-Baby-Touch-Panel-Dual-Function-UV-Sterilizer-amp-Dryer\" class=\"headerlink\" title=\"Get one from Amazon: Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer\"></a>Get one from Amazon: <a href=\"https://www.amazon.com/gp/product/B07195QKZC/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B07195QKZC&amp;linkCode=as2&amp;tag=all4oscom-20&amp;linkId=46bd14015f4146986852b0978ac71e30\">Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer</a></h3><p>Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer have sterilizer and dryer function so all you need to do is wash the bottles and put them into Wabi UV sterilizer &amp; dryer. We tested one&#xA0;Wabi Baby Touch Panel Dual Function UV Sterilizer &amp; Dryer and found it is a nice product for family with new baby. Wabi UV sterilizer &amp; dryer is not the small one you usually see in the market. The box width is about the mid size computer case. But it is lighter than it looks like. </p>\n<p><img src=\"/2017/11/wabi-uv-sterilizer-dryer.jpg\" alt=\"Wabi Uv Sterilizer Dryer\"> </p>\n<p>You will find this UV sterilizer looks very well made and nice. </p>\n<p><img src=\"/2017/11/wabi-uv-sterilizer-dryer-unbox.jpg\" alt=\"Wabi Uv Sterilizer Dryer Unbox\"> </p>\n<p>It has touch panel for function control. Very simple and easy to use.</p>\n<p><img src=\"/2017/11/wabi-uv-sterilizer-dryer-touch-functions.jpg\" alt=\"Wabi Uv Sterilizer Dryer Touch Functions\"> </p>\n<p>Not too small, but not too big. We use 8oz bottle in our test.</p>\n<p><img src=\"/2017/11/wabi-uv-sterilizer-dryer-size.jpg\" alt=\"Wabi Uv Sterilizer Dryer Size\"> </p>\n<p>Looks very cool also when it is on. </p>\n<p><img src=\"/2017/11/wabi-uv-sterilizer-dryer-on.jpg\" alt=\"Wabi Uv Sterilizer Dryer On\"> </p>\n<p>We tested the UV and dryer function for a set of bottles. After the full cycle complete, all bottles were dry and feels clean. It does left some warm feeling when finish, but that is totally normal.</p>\n",
            "tags": [
                "baby"
            ]
        },
        {
            "id": "https://www.qualityology.com/lifestyle/get-free-25-cricket-wireless-credit-new-customer/",
            "url": "https://www.qualityology.com/lifestyle/get-free-25-cricket-wireless-credit-new-customer/",
            "title": "Get Free $25 Cricket Wireless Credit for New Customer - Expired",
            "date_published": "2017-10-26T16:53:00.000Z",
            "content_html": "<p>Why use Cricket Wireless?</p>\n<ul>\n<li>  Cricket Wireless uses AT&amp;T cell towers so it will have native AT&amp;T coverage plus some domestic roaming.</li>\n<li>  You can even have Canada and Mexico roaming coverage when traveling by paying $10 more.</li>\n<li>  Cricket Wireless get new feature even faster than AT&amp;T&#x2019;s prepaid plan (former AT&amp;T gophone). For example, Cricket Wireless user have VoLTE (Voice over LTE) now while AT&amp;T&#x2019;s prepaid plan still missing that option.</li>\n<li>  Tax is included. Why pay 20% more tax?</li>\n<li>  Affordable family plan, 5 lines for $100! No hidden fee.</li>\n<li>  Local stores everywhere if you need assistence</li>\n<li>  Cricket Wireless offer more GB than other competitors in same price.</li>\n</ul>\n<p>The only downside is Cricket Wireless limit the max LTE peak download speeds to 8 Mbps, however, that is fast enough to watch HD video. If you&#x2019;re a new customer looking to try Cricket Wireless and want to save even more, you can use our&#xA0; referral for a $25 Credit for each line. If you&#x2019;re planning on moving multiple lines, after you activate your own line, then refer your other lines so you receive your own $25 credit for each line! After you have them all transferred, you should be able to group them all together for some major group discounts by calling customer service. </p>\n<p>***<strong>Cricket no longer offer referral credit now</strong>. </p>\n<p>How to claim the $25 credit?</p>\n<ol>\n<li> Open the referral link: Cricket Rewards</li>\n<li> Set up your Cricket Rewards account</li>\n<li> Activate Cricket service within 30 days of the referral and update your phone number within the Cricket Rewards app if you got a new one.</li>\n<li> Keep your account active and in good standing for 60 days.</li>\n</ol>\n<p>You can refer your friend using the Cricket Rewards account too. Both parties will receive $25 Credit.</p>\n",
            "tags": [
                "Wireless"
            ]
        }
    ]
}