{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qualityology - Let's get the most out of life! • All posts by \"wireless\" tag",
    "description": "To uncover the best way to achieve desired level of quality in everything. - We dive deep on adding quality to tech gadgets, business, and entertainment because quality matter in life.",
    "home_page_url": "https://www.qualityology.com",
    "items": [
        {
            "id": "https://www.qualityology.com/lifestyle/get-free-25-cricket-wireless-credit-new-customer/",
            "url": "https://www.qualityology.com/lifestyle/get-free-25-cricket-wireless-credit-new-customer/",
            "title": "Get Free $25 Cricket Wireless Credit for New Customer - Expired",
            "date_published": "2017-10-26T16:53:00.000Z",
            "content_html": "<p>Why use Cricket Wireless?</p>\n<ul>\n<li>  Cricket Wireless uses AT&amp;T cell towers so it will have native AT&amp;T coverage plus some domestic roaming.</li>\n<li>  You can even have Canada and Mexico roaming coverage when traveling by paying $10 more.</li>\n<li>  Cricket Wireless get new feature even faster than AT&amp;T&#x2019;s prepaid plan (former AT&amp;T gophone). For example, Cricket Wireless user have VoLTE (Voice over LTE) now while AT&amp;T&#x2019;s prepaid plan still missing that option.</li>\n<li>  Tax is included. Why pay 20% more tax?</li>\n<li>  Affordable family plan, 5 lines for $100! No hidden fee.</li>\n<li>  Local stores everywhere if you need assistence</li>\n<li>  Cricket Wireless offer more GB than other competitors in same price.</li>\n</ul>\n<p>The only downside is Cricket Wireless limit the max LTE peak download speeds to 8 Mbps, however, that is fast enough to watch HD video. If you&#x2019;re a new customer looking to try Cricket Wireless and want to save even more, you can use our&#xA0; referral for a $25 Credit for each line. If you&#x2019;re planning on moving multiple lines, after you activate your own line, then refer your other lines so you receive your own $25 credit for each line! After you have them all transferred, you should be able to group them all together for some major group discounts by calling customer service. </p>\n<p>***<strong>Cricket no longer offer referral credit now</strong>. </p>\n<p>How to claim the $25 credit?</p>\n<ol>\n<li> Open the referral link: Cricket Rewards</li>\n<li> Set up your Cricket Rewards account</li>\n<li> Activate Cricket service within 30 days of the referral and update your phone number within the Cricket Rewards app if you got a new one.</li>\n<li> Keep your account active and in good standing for 60 days.</li>\n</ol>\n<p>You can refer your friend using the Cricket Rewards account too. Both parties will receive $25 Credit.</p>\n",
            "tags": [
                "Wireless"
            ]
        }
    ]
}